Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/component_mapping.po
Languages: pt_br

source: Component Mapping
pt_br: Mapeamento de Componentes

source: The notion of a <emphasis>component</emphasis> is re-used in several different contexts, for different purposes, throughout Hibernate.
pt_br: A noção de <emphasis>componente</emphasis> é reusada em vários contextos diferentes, para propósitos diferentes, pelo Hibernate.

source: Dependent objects
pt_br: Objetos dependentes

source: A component is a contained object that is persisted as a value type, not an entity reference. The term "component" refers to the object-oriented notion of composition (not to architecture-level components). For example, you might model a person like this:
pt_br: Um componente é um objeto contido que é persistido como um tipo de valor, não uma referência de entidade. O termo "componente" refere-se à noção de composição da orientação a objetos (não a componentes no nível de arquitetura). Por exemplo, você pode modelar uma pessoa desta maneira:

source: Now <literal>Name</literal> may be persisted as a component of <literal>Person</literal>. Notice that <literal>Name</literal> defines getter and setter methods for its persistent properties, but doesn't need to declare any interfaces or identifier properties.
pt_br: Agora <literal>Name</literal> pode ser persistido como um componente de <literal>Person</literal>. Note que <literal>Name</literal> define métodos getter e setter para suas propriedades persistentes, mas não necessita declarar nenhuma interface ou propriedades identificadoras.

source: Our Hibernate mapping would look like:
pt_br: Nosso mapeamento do Hibernate seria semelhante a isso

source: The person table would have the columns <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> and <literal>last</literal>.
pt_br: A tabela pessoa teria as seguintes colunas <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> and <literal>last</literal>.

source: Like all value types, components do not support shared references. In other words, two persons could have the same name, but the two person objects would contain two independent name objects, only "the same" by value. The null value semantics of a component are <emphasis>ad hoc</emphasis>. When reloading the containing object, Hibernate will assume that if all component columns are null, then the entire component is null. This should be okay for most purposes.
pt_br: Assim como todos tipos por valor, componentes não suportam referencias cruzadas. Em outras palavras, duas pessoas poderiam possuir o mesmo nome, mas os dois objetos pessoa poderiam conter dois objetos nome independentes, apenas com "o mesmo" por valor. A semântica dos valores null de um componente são <emphasis>ad hoc</emphasis>. No recarregameno do conteúdo do objeto, O Hibernate assumira que se todas as colunas do componente são null, então todo o componente é null. Isto seria o certo para a maioria dos propósitos.

source: The properties of a component may be of any Hibernate type (collections, many-to-one associations, other components, etc). Nested components should <emphasis>not</emphasis> be considered an exotic usage. Hibernate is intended to support a very fine-grained object model.
pt_br: As propriedades de um componente podem ser de qualquer tipo do Hibernate(collections, associações muitos-para-um, outros componentes, etc). Componentes agrupados <emphasis>não </emphasis> devem ser consideros um uso exótico. O Hibernate tem a intenção de suportar um modelo de objetos muito bem granulado.

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
pt_br: O elemento <literal>&lt;component&gt;</literal> permite um subelemento <literal>&lt;parent&gt;</literal> que mapeia uma propriedade da classe componente como uma referência de volta para a entidade que a contém.

source: Collections of dependent objects
pt_br: Collections de objetos dependentes

source: Collections of components are supported (eg. an array of type <literal>Name</literal>). Declare your component collection by replacing the <literal>&lt;element&gt;</literal> tag with a <literal>&lt;composite-element&gt;</literal> tag.
pt_br: Collections de componentes são suportadadas(ex. uma array de tipo <literal>Name</literal>). Declare a sua collection de componentes substituindo a tag<literal>&lt;element&gt;</literal> pela tag <literal>&lt;composite-element&gt;</literal>.

source: Note: if you define a <literal>Set</literal> of composite elements, it is very important to implement <literal>equals()</literal> and <literal>hashCode()</literal> correctly.
pt_br: Nota: se você definir um <literal>Set</literal> de elementos compostos, é muito importante implementar <literal>equals()</literal> e <literal>hashCode()</literal> corretamente.

source: Composite elements may contain components but not collections. If your composite element itself contains components, use the <literal>&lt;nested-composite-element&gt;</literal> tag. This is a pretty exotic case - a collection of components which themselves have components. By this stage you should be asking yourself if a one-to-many association is more appropriate. Try remodelling the composite element as an entity - but note that even though the Java model is the same, the relational model and persistence semantics are still slightly different.
pt_br: Elementos compostos podem conter componentes mas não collections. Se o seu elemento composto contiver componentes , use a tag <literal>&lt;nested-composite-element&gt;</literal> . Este é um caso bastante exótico – uma collections de componentes que por si própria possui componentes. Neste momento você deve estar se perguntando se uma associação de um-para-muitos seria mais apropriada. Tente remodelar o elemento composto como uma entidade – mas note que mesmo pensando que o modelo Java é o mesmo, o modelo relacional e a semântica de persistência ainda são diferentes.

source: Please note that a composite element mapping doesn't support null-able properties if you're using a <literal>&lt;set&gt;</literal>. Hibernate has to use each columns value to identify a record when deleting objects (there is no separate primary key column in the composite element table), which is not possible with null values. You have to either use only not-null properties in a composite-element or choose a <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> or <literal>&lt;idbag&gt;</literal>.
pt_br: Por favor, note que um mapeamento de elemento composto não suporta propriedades capazes de serem null se você estiver usando um <literal>&lt;set&gt;</literal>. O Hibernate tem que usar cada valor das colunas para identificar um registro quando estiver deletando objetos (não existe coluna chave primária separada na tabela de elemento composto), que não é possível com valores null. Você tem que usar um dos dois, ou apenas propriedades não null em um elemento composto ou escolher uma <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> ou <literal>&lt;idbag&gt;</literal>.

source: A special case of a composite element is a composite element with a nested <literal>&lt;many-to-one&gt;</literal> element. A mapping like this allows you to map extra columns of a many-to-many association table to the composite element class. The following is a many-to-many association from <literal>Order</literal> to <literal>Item</literal> where <literal>purchaseDate</literal>, <literal>price</literal> and <literal>quantity</literal> are properties of the association:
pt_br: Um caso especial de elemento composto é um elemento composto com um elemento <literal>&lt;many-to-one&gt;</literal> aninhado. Um mapeamento como este permite você a mapear colunas extras de uma tabela de associação de muitos-para-muitos para a classe de elemento composto. A seguinte associação de muitos-para-muitos de <literal>Order</literal> para um <literal>Item</literal> onde <literal>purchaseDate</literal>, <literal>price</literal> e <literal>quantity</literal> são propriedades da associação:

source: Of course, there can't be a reference to the purchae on the other side, for bidirectional association navigation. Remember that components are value types and don't allow shared references. A single <literal>Purchase</literal> can be in the set of an <literal>Order</literal>, but it can't be referenced by the <literal>Item</literal> at the same time.
pt_br: Claro, que não pode ter uma referência para purchase no outro lado, para a navegação da associação bidirecional. Lembre-se que componentes são tipos por valor e não permitem referências compartilhadas. Uma classe <literal>Purchase</literal> simples pode estar no set de uma classe <literal>Order</literal>, mas ela não pode ser referenciada por <literal>Item</literal> no mesmo momento.

source: Even ternary (or quaternary, etc) associations are possible:
pt_br: Até mesmo associações ternárias (ou quaternária, etc) são possíveis:

source: Composite elements may appear in queries using the same syntax as associations to other entities.
pt_br: Elementos compostos podem aparecer em pesquisas usando a mesma sintaxe assim como associações para outras entidades.

source: Components as Map indices
pt_br: Componentes como índices de Map

source: The <literal>&lt;composite-map-key&gt;</literal> element lets you map a component class as the key of a <literal>Map</literal>. Make sure you override <literal>hashCode()</literal> and <literal>equals()</literal> correctly on the component class.
pt_br: O elemento <literal>&lt;composite-map-key&gt;</literal> permite você mapear uma classe componente como uma chave de um <literal>Map</literal>. Tenha certeza que você sobrescreveu <literal>hashCode()</literal> e <literal>equals()</literal> corretamente na classe componente.

source: Components as composite identifiers
pt_br: . Componentes como identificadores compostos

source: You may use a component as an identifier of an entity class. Your component class must satisfy certain requirements:
pt_br: Você pode usar um componente como um identificador de uma classe entidade. Sua classe componente deve satisfazer certos requisitos:

source: It must implement <literal>java.io.Serializable</literal>.
pt_br: Ele deve implementar <literal>java.io.Serializable</literal>.

source: It must re-implement <literal>equals()</literal> and <literal>hashCode()</literal>, consistently with the database's notion of composite key equality.
pt_br: Ele deve re-implementar <literal>equals()</literal> e <literal>hashCode()</literal>, consistentemente com a noção de igualdade de chave composta do banco de dados.

source: Note: in Hibernate3, the second requirement is not an absolutely hard requirement of Hibernate. But do it anyway.
pt_br: Nota: no Hibernate 3, o segundo requisito não é um requisito absolutamente necessário. Mas atenda ele de qualquer forma.

source: You can't use an <literal>IdentifierGenerator</literal> to generate composite keys. Instead the application must assign its own identifiers.
pt_br: Você não pode usar um <literal>IdentifierGenerator</literal> para gerar chaves compostas. Ao invés disso o aplicativo deve gerenciar seus próprios identificadores.

source: Use the <literal>&lt;composite-id&gt;</literal> tag (with nested <literal>&lt;key-property&gt;</literal> elements) in place of the usual <literal>&lt;id&gt;</literal> declaration. For example, the <literal>OrderLine</literal> class has a primary key that depends upon the (composite) primary key of <literal>Order</literal>.
pt_br: Use a tag <literal>&lt;composite-id&gt;</literal> (com elementos <literal>&lt;key-property&gt;</literal> aninhados) no lugar da declaração <literal>&lt;id&gt;</literal> de costume. Por exemplo, a classe <literal>OrderLine</literal> possui uma chave primária que depende da chave primária (composta) de <literal>Order</literal>.

source: Now, any foreign keys referencing the <literal>OrderLine</literal> table are also composite. You must declare this in your mappings for other classes. An association to <literal>OrderLine</literal> would be mapped like this:
pt_br: Agora, qualquer chave estrangeira referenciando a tabela <literal>OrderLine</literal> também serão compostas. Você deve declarar isto em seus mapeamentos para outras classes. Uma associação para <literal>OrderLine</literal> seria mapeada dessa forma:

source: (Note that the <literal>&lt;column&gt;</literal> tag is an alternative to the <literal>column</literal> attribute everywhere.)
pt_br: (Note que a tag <literal>&lt;column&gt;</literal> é uma alternativa para o atributo <literal>column</literal> por toda a parte.)

source: A <literal>many-to-many</literal> association to <literal>OrderLine</literal> also uses the composite foreign key:
pt_br: Uma associação <literal>many-to-many</literal> para <literal>many-to-many</literal> também usa a chave estrangeira composta:

source: The collection of <literal>OrderLine</literal>s in <literal>Order</literal> would use:
pt_br: A collection de <literal>OrderLine</literal>s em <literal>Order</literal> usaria:

source: (The <literal>&lt;one-to-many&gt;</literal> element, as usual, declares no columns.)
pt_br: (O elemento <literal>&lt;one-to-many&gt;</literal>, como de costume, não declara colunas.)

source: If <literal>OrderLine</literal> itself owns a collection, it also has a composite foreign key.
pt_br: Se <literal>OrderLine</literal> possui uma collection, ela também tem uma chave estrangeira composta.

source: Dynamic components
pt_br: Componentes Dinâmicos

source: You may even map a property of type <literal>Map</literal>:
pt_br: Você pode até mesmo mapear uma propriedade do tipo <literal>Map</literal>:

source: The semantics of a <literal>&lt;dynamic-component&gt;</literal> mapping are identical to <literal>&lt;component&gt;</literal>. The advantage of this kind of mapping is the ability to determine the actual properties of the bean at deployment time, just by editing the mapping document. Runtime manipulation of the mapping document is also possible, using a DOM parser. Even better, you can access (and change) Hibernate's configuration-time metamodel via the <literal>Configuration</literal> object.
pt_br: A semântica de um mapeamento <literal>&lt;dynamic-component&gt;</literal> é idêntica à <literal>&lt;component&gt;</literal>. A vantagem deste tipo de mapeamento é a habilidade de determinar as propriedades atuais do bean no momento de deploy, apenas editando o documento de mapeamento. A Manipulação em tempo de execução do documento de mapeamento também é possível, usando o parser DOM. Até melhor, você pode acessar (e mudar) o metamodelo configuration-time do Hibernate através do objeto <literal>Configuration</literal>.
