Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/inheritance_mapping.po
Languages: fr_fr

source: Inheritance Mapping
fr_fr: Mapping d'héritage de classe

source: The Three Strategies
fr_fr: Les trois stratégies

source: Hibernate supports the three basic inheritance mapping strategies:
fr_fr: Hibernate supporte les trois stratégies d'héritage de base :

source: table per class hierarchy
fr_fr: une table par hiérarchie de classe (table per class hierarchy)

source: table per concrete class
fr_fr: une table par classe concrète (table per concrete class)

source: In addition, Hibernate supports a fourth, slightly different kind of polymorphism:
fr_fr: Hibernate supporte en plus une quatrièmestratégie, légèrement différente, qui supporte le polymorphisme :

source: implicit polymorphism
fr_fr: le polymorphisme implicite

source: It is possible to use different mapping strategies for different branches of the same inheritance hierarchy, and then make use of implicit polymorphism to achieve polymorphism across the whole hierarchy. However, Hibernate does not support mixing <literal>&lt;subclass&gt;</literal>, and <literal>&lt;joined-subclass&gt;</literal> and <literal>&lt;union-subclass&gt;</literal> mappings under the same root <literal>&lt;class&gt;</literal> element. It is possible to mix together the table per hierarchy and table per subclass strategies, under the the same <literal>&lt;class&gt;</literal> element, by combining the <literal>&lt;subclass&gt;</literal> and <literal>&lt;join&gt;</literal> elements (see below).
fr_fr: Il est possible d'utiliser différentes stratégies de mapping pour différentes branches d'une même hiérarchie d'héritage, et alors d'employer le polymorphisme implicite pour réaliser le polymorphisme à travers toute la hiérarchie. Pourtant, Hibernate ne supporte pas de mélanger des mappings <literal>&lt;subclass&gt;</literal> et <literal>&lt;joined-subclass&gt;</literal> et <literal>&lt;union-subclass&gt;</literal> pour le même élément <literal>&lt;class&gt;</literal> racine. Il est possible de mélanger ensemble les stratégies d'une table par hiérarchie et d'une table par sous-classe, pour le même élément <literal>&lt;class&gt;</literal>, en combinant les éléments <literal>&lt;subclass&gt;</literal> et <literal>&lt;join&gt;</literal> (voir dessous).

source: It is possible to define <literal>subclass</literal>, <literal>union-subclass</literal>, and <literal>joined-subclass</literal> mappings in separate mapping documents, directly beneath <literal>hibernate-mapping</literal>. This allows you to extend a class hierachy just by adding a new mapping file. You must specify an <literal>extends</literal> attribute in the subclass mapping, naming a previously mapped superclass. Note: Previously this feature made the ordering of the mapping documents important. Since Hibernate3, the ordering of mapping files does not matter when using the extends keyword. The ordering inside a single mapping file still needs to be defined as superclasses before subclasses.
fr_fr: Il est possible de définir des mappings de <literal>subclass</literal>, <literal>union-subclass</literal>, et <literal>joined-subclass</literal> dans des documents de mapping séparés, directement sous <literal>hibernate-mapping</literal>. Ceci vous permet d'étendre une hiérarchie de classe juste en ajoutant un nouveau fichier de mapping. Vous devez spécifier un attribut <literal>extends</literal> dans le mapping de la sous-classe, en nommant une super-classe précédemment mappée. Note : précédemment cette foncionnalité rendait l'ordre des documents de mapping important. Depuis Hibernate3, l'ordre des fichier de mapping n'importe plus lors de l'utilisation du mot-clef "extends". L'ordre à l'intérieur d'un simple fichier de mapping impose encore de définir les classes mères avant les classes filles.

source: Table per class hierarchy
fr_fr: Une table par hiérarchie de classe

source: Suppose we have an interface <literal>Payment</literal>, with implementors <literal>CreditCardPayment</literal>, <literal>CashPayment</literal>, <literal>ChequePayment</literal>. The table per hierarchy mapping would look like:
fr_fr: Supposons que nous ayons une interface <literal>Payment</literal>, implémentée par <literal>CreditCardPayment</literal>, <literal>CashPayment</literal>, <literal>ChequePayment</literal>. La stratégie une table par hiérarchie serait :

source: Exactly one table is required. There is one big limitation of this mapping strategy: columns declared by the subclasses, such as <literal>CCTYPE</literal>, may not have <literal>NOT NULL</literal> constraints.
fr_fr: Une seule table est requise. Une grande limitation de cette stratégie est que les colonnes déclarées par les classes filles, telles que <literal>CCTYPE</literal>, ne peuvent avoir de contrainte <literal>NOT NULL</literal>.

source: Table per subclass
fr_fr: Une table par classe fille

source: A table per subclass mapping would look like:
fr_fr: La stratégie une table par classe fille serait :

source: Four tables are required. The three subclass tables have primary key associations to the superclass table (so the relational model is actually a one-to-one association).
fr_fr: Quatre tables sont requises. Les trois tables des classes filles ont une clé primaire associée à la table classe mère (le modèle relationnel est une association un-vers-un).

source: Table per subclass, using a discriminator
fr_fr: Une table par classe fille, en utilisant un discriminant

source: Note that Hibernate's implementation of table per subclass requires no discriminator column. Other object/relational mappers use a different implementation of table per subclass which requires a type discriminator column in the superclass table. The approach taken by Hibernate is much more difficult to implement but arguably more correct from a relational point of view. If you would like to use a discriminator column with the table per subclass strategy, you may combine the use of <literal>&lt;subclass&gt;</literal> and <literal>&lt;join&gt;</literal>, as follow:
fr_fr: Notez que l'implémentation Hibernate de la stratégie un table par classe fille ne nécessite pas de colonne discriminante dans la table classe mère. D'autres implémentations de mappers Objet/Relationnel utilisent une autre implémentation de la stratégie une table par classe fille qui nécessite une colonne de type discriminant dans la table de la classe mère. L'approche prise par Hibernate est plus difficile à implémenter mais plus correcte d'une point de vue relationnel. Si vous aimeriez utiliser une colonne discriminante avec la stratégie d'une table par classe fille, vous pourriez combiner l'utilisation de <literal>&lt;subclass&gt;</literal> et <literal>&lt;join&gt;</literal>, comme suit :

source: The optional <literal>fetch="select"</literal> declaration tells Hibernate not to fetch the <literal>ChequePayment</literal> subclass data using an outer join when querying the superclass.
fr_fr: La déclaration optionnelle <literal>fetch="select"</literal> indique à Hibernate de ne pas récupérer les données de la classe fille <literal>ChequePayment</literal> par une jointure externe lors des requêtes sur la classe mère.

source: Mixing table per class hierarchy with table per subclass
fr_fr: Mélange d'une table par hiérarchie de classe avec une table par classe fille

source: You may even mix the table per hierarchy and table per subclass strategies using this approach:
fr_fr: Vous pouvez même mélanger les stratégies d'une table par hiérarchie de classe et d'une table par classe fille en utilisant cette approche :

source: For any of these mapping strategies, a polymorphic association to the root <literal>Payment</literal> class is mapped using <literal>&lt;many-to-one&gt;</literal>.
fr_fr: Pour importe laquelle de ces stratégies, une association polymorphique vers la classe racine <literal>Payment</literal> est mappée en utilisant <literal>&lt;many-to-one&gt;</literal>.

source: Table per concrete class
fr_fr: Une table par classe concrète

source: There are two ways we could go about mapping the table per concrete class strategy. The first is to use <literal>&lt;union-subclass&gt;</literal>.
fr_fr: Il y a deux manières d'utiliser la stratégie d'une table par classe concrète. La première est d'employer <literal>&lt;union-subclass&gt;</literal>.

source: Three tables are involved for the subclasses. Each table defines columns for all properties of the class, including inherited properties.
fr_fr: Trois tables sont nécessaires pour les classes filles. Chaque table définit des colonnes pour toutes les propriétés de la classe, incluant les propriétés héritéés.

source: The limitation of this approach is that if a property is mapped on the superclass, the column name must be the same on all subclass tables. (We might relax this in a future release of Hibernate.) The identity generator strategy is not allowed in union subclass inheritance, indeed the primary key seed has to be shared accross all unioned subclasses of a hierarchy.
fr_fr: La limitation de cette approche est que si une propriété est mappée sur la classe mère, le nom de la colonne doit être le même pour toutes les classes filles. (Nous pourrions être plus souple dans une future version d'Hibernate). La stratégie du générateur d'identifiant n'est pas permise dans l'héritage de classes filles par union, en effet la valeur (NdT : seed) de la clef primaire doit être partagée par toutes les classes filles "union" d'une hiérarchie.

source: If your superclass is abstract, map it with <literal>abstract="true"</literal>. Of course, if it is not abstract, an additional table (defaults to <literal>PAYMENT</literal> in the example above) is needed to hold instances of the superclass.
fr_fr: Si votre classe mère est abstraite, mappez la avec <literal>abstract="true"</literal>. Bien sûr, si elle n'est pas abstraite, une table supplémentaire (par défaut, <literal>PAYMENT</literal> dans l'exemple ci-dessus) est requise pour contenir des instances de la classe mère.

source: Table per concrete class, using implicit polymorphism
fr_fr: Une table par classe concrète, en utilisant le polymorphisme implicite

source: An alternative approach is to make use of implicit polymorphism:
fr_fr: Une approche alternative est l'emploi du polymorphisme implicite :

source: Notice that nowhere do we mention the <literal>Payment</literal> interface explicitly. Also notice that properties of <literal>Payment</literal> are mapped in each of the subclasses. If you want to avoid duplication, consider using XML entities (e.g. <literal>[ &lt;!ENTITY allproperties SYSTEM "allproperties.xml"&gt; ]</literal> in the <literal>DOCTYPE</literal> declartion and <literal>&amp;allproperties;</literal> in the mapping).
fr_fr: Notez que nulle part nous ne mentionnons l'interface <literal>Payment</literal> explicitement. Notez aussi que des propriétés de <literal>Payment</literal> sont mappées dans chaque classe fille. Si vous voulez éviter des duplications, considérez l'utilisation des entités XML (cf. <literal>[ &lt;!ENTITY allproperties SYSTEM "allproperties.xml"&gt; ]</literal> dans la déclaration du <literal>DOCTYPE</literal> et <literal>&amp;allproperties;</literal> dans le mapping).

source: The disadvantage of this approach is that Hibernate does not generate SQL <literal>UNION</literal>s when performing polymorphic queries.
fr_fr: L'inconvénient de cette approche est qu'Hibernate ne génère pas d'<literal>UNION</literal>s SQL lors de l'exécution des requêtes polymorphiques.

source: For this mapping strategy, a polymorphic association to <literal>Payment</literal> is usually mapped using <literal>&lt;any&gt;</literal>.
fr_fr: Pour cette stratégie de mapping, une association polymorphique pour <literal>Payment</literal> est habituellement mappée en utilisant <literal>&lt;any&gt;</literal>.

source: Mixing implicit polymorphism with other inheritance mappings
fr_fr: Mélange du polymorphisme implicite avec d'autres mappings d'héritage

source: There is one further thing to notice about this mapping. Since the subclasses are each mapped in their own <literal>&lt;class&gt;</literal> element (and since <literal>Payment</literal> is just an interface), each of the subclasses could easily be part of another inheritance hierarchy! (And you can still use polymorphic queries against the <literal>Payment</literal> interface.)
fr_fr: Il y a une chose supplémentaire à noter à propos de ce mapping. Puisque les classes filles sont chacune mappées avec leur propre élément <literal>&lt;class&gt;</literal> (et puisque <literal>Payment</literal> est juste une interface), chaque classe fille pourrait facilement faire partie d'une autre hiérarchie d'héritage ! (Et vous pouvez encore faire des requêtes polymorphiques pour l'interface <literal>Payment</literal>).

source: Once again, we don't mention <literal>Payment</literal> explicitly. If we execute a query against the <literal>Payment</literal> interface - for example, <literal>from Payment</literal> - Hibernate automatically returns instances of <literal>CreditCardPayment</literal> (and its subclasses, since they also implement <literal>Payment</literal>), <literal>CashPayment</literal> and <literal>ChequePayment</literal> but not instances of <literal>NonelectronicTransaction</literal>.
fr_fr: Encore une fois, nous ne mentionnons pas explicitement <literal>Payment</literal>. Si nous exécutons une requête sur l'interface <literal>Payment</literal> - par exemple, <literal>from Payment</literal> - Hibernate retournera automatiquement les instances de <literal>CreditCardPayment</literal> (et ses classes filles puisqu'elles implémentent aussi <literal>Payment</literal>), <literal>CashPayment</literal> et <literal>ChequePayment</literal> mais pas les instances de <literal>NonelectronicTransaction</literal>.

source: There are certain limitations to the "implicit polymorphism" approach to the table per concrete-class mapping strategy. There are somewhat less restrictive limitations to <literal>&lt;union-subclass&gt;</literal> mappings.
fr_fr: Il y a certaines limitations à l'approche du "polymorphisme implicite" pour la stratégie de mapping d'une table par classe concrète. Il y a plutôt moins de limitations restrictives aux mappings <literal>&lt;union-subclass&gt;</literal>.

source: The following table shows the limitations of table per concrete-class mappings, and of implicit polymorphism, in Hibernate.
fr_fr: La table suivante montre les limitations des mappings d'une table par classe concrète, et du polymorphisme implicite, dans Hibernate.

source: Features of inheritance mappings
fr_fr: Caractéristiques du mapping d'héritage

source: Inheritance strategy
fr_fr: Stratégie d'héritage

source: Polymorphic many-to-one
fr_fr: many-to-one polymorphique

source: Polymorphic one-to-one
fr_fr: one-to-one polymorphique

source: Polymorphic one-to-many
fr_fr: one-to-many polymorphique

source: Polymorphic many-to-many
fr_fr: many-to-many polymorphique

source: Polymorphic queries
fr_fr: Requêtes polymorphiques

source: Polymorphic joins
fr_fr: Jointures polymorphiques

source: Outer join fetching
fr_fr: Récupération par jointure externe

source: table per class-hierarchy
fr_fr: une table par hiérarchie de classe

source: supported
fr_fr: supportée

source: table per concrete-class (union-subclass)
fr_fr: une table par classe concrète (union-subclass)

source: table per concrete class (implicit polymorphism)
fr_fr: une table par classe concrète (polymorphisme implicite)
