Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/session_api.po
Languages: es_es

source: Working with objects
es_es: Trabajando con objetos

source: Hibernate is a full object/relational mapping solution that not only shields the developer from the details of the underlying database management system, but also offers <emphasis>state management</emphasis> of objects. This is, contrary to the management of SQL <literal>statements</literal> in common JDBC/SQL persistence layers, a very natural object-oriented view of persistence in Java applications.
es_es: Hibernate es una soluci&#x00f3;n completa de mapeo objeto/relacional que no s&#x00f3;lo abstrae al desarrollador de los detalles del sistema de manejo de base datos subyacente, sino que adem&#x00e1;s ofrece <emphasis>manejo de estado</emphasis> de objetos. Esto es, al contrario del manejo de <literal>sentencias</literal> SQL en capas comunes de persistencia JDBC/SQL, una vista de la persistencia en aplicaciones Java muy natural y orientada a objetos.

source: In other words, Hibernate application developers should always think about the <emphasis>state</emphasis> of their objects, and not necessarily about the execution of SQL statements. This part is taken care of by Hibernate and is only relevant for the application developer when tuning the performance of the system.
es_es: En otras palabras, los desarroladores de aplicaciones Hibernate deben siempre pensar en el <emphasis>estado</emphasis> de sus objetos, y no necesariamente en la ejecuci&#x00f3;n de sentencias SQL. Esta parte es cuidada por Hibernate y es s&#x00f3;lo relevante para el desarrollador de la aplicaci&#x00f3;n al afinar el rendimiento del sistema.

source: Hibernate object states
es_es: Estados de objeto de Hibernate

source: Hibernate defines and supports the following object states:
es_es: Hibernate define y soporta los siguientes estados de objeto:

source: <emphasis>Transient</emphasis> - an object is transient if it has just been instantiated using the <literal>new</literal> operator, and it is not associated with a Hibernate <literal>Session</literal>. It has no persistent representation in the database and no identifier value has been assigned. Transient instances will be destroyed by the garbage collector if the application doesn't hold a reference anymore. Use the Hibernate <literal>Session</literal> to make an object persistent (and let Hibernate take care of the SQL statements that need to be executed for this transition).
es_es: <emphasis>Transitorio</emphasis> - un objeto es transitorio si ha sido reci&#x00e9;n instanciado usando el operador <literal>new</literal>, y no est&#x00e1; asociado a una <literal>Session</literal> de Hibernate. No tiene una representaci&#x00f3;n persistente en la base de datos y no se le ha asignado un valor identificador. Las instancias transitorias ser&#x00e1;n destru&#x00ed;das por el recolector de basura si la aplicaci&#x00f3;n no mantiene m&#x00e1;s una referencia. Usa la <literal>Session</literal> de Hibernate para hacer un objeto persistente (y deja que Hibernate cuide de las sentencias SQL que necesitan ejecutarse para esta transici&#x00f3;n).

source: <emphasis>Persistent</emphasis> - a persistent instance has a representation in the database and an identifier value. It might just have been saved or loaded, however, it is by definition in the scope of a <literal>Session</literal>. Hibernate will detect any changes made to an object in persistent state and synchronize the state with the database when the unit of work completes. Developers don't execute manual <literal>UPDATE</literal> statements, or <literal>DELETE</literal> statements when an object should be made transient.
es_es: <emphasis>Persistente</emphasis> - una instancia persistente tiene una representaci&#x00f3;n en la base de datos y un valor identificador. Puede haber sido salvado o cargado, sin embargo, est&#x00e1; por definici&#x00f3;n en el &#x00e1;mbito de una <literal>Session</literal>. Hibernate detectar&#x00e1; cualquier cambio hecho a un objeto en estado persistentey sincronizar&#x00e1; el estado con la base de datos cuando se complete la unidad de trabajo. Los desarrolladores no ejecutan sentencias <literal>UPDATE</literal> manuales, o sentencias <literal>DELETE</literal> cuando un objeto debe ser hecho transitorio.

source: <emphasis>Detached</emphasis> - a detached instance is an object that has been persistent, but its <literal>Session</literal> has been closed. The reference to the object is still valid, of course, and the detached instance might even be modified in this state. A detached instance can be reattached to a new <literal>Session</literal> at a later point in time, making it (and all the modifications) persistent again. This feature enables a programming model for long running units of work that require user think-time. We call them <emphasis>application transactions</emphasis>, i.e. a unit of work from the point of view of the user.
es_es: <emphasis>Separado (detached)</emphasis> - una instancia separada es un objeto que ha sido hecho persistente, pero su <literal>Session</literal> ha sido cerrada. La referencia al objeto todav&#x00ed;a es v&#x00e1;lida, por supuesto, y la instancia separada podr&#x00ed;a incluso ser modificada en este estado. Una instancia separada puede ser re-unida a una nueva <literal>Session</literal> en un punto posterior en el tiempo, haci&#x00e9;ndola persistente de nuevo (con todas las modificaciones). Este aspecto habilita un modelo de programaci&#x00f3;n para unidades de trabajo de ejecuci&#x00f3;n larga que requieren tiempo-para-pensar del usuario. Las llamamos <emphasis>transaccciones de aplicaci&#x00f3;n</emphasis>, es decir, una unidad de trabajo desde el punto de vista del usuario.

source: We'll now discuss the states and state transitions (and the Hibernate methods that trigger a transition) in more detail.
es_es: Discutiremos ahora los estados y transiciones de estados (y los m&#x00e9;todos de Hibernate que disparan una transici&#x00f3;n) en m&#x00e1;s detalle:

source: Making objects persistent
es_es: Haciendo los objetos persistentes

source: Newly instantiated instances of a a persistent class are considered <emphasis>transient</emphasis> by Hibernate. We can make a transient instance <emphasis>persistent</emphasis> by associating it with a session:
es_es: Las instancias reci&#x00e9;n instanciadas de una clase persistente son consideradas <emphasis>transitorias</emphasis> por Hibernate. Podemos hacer una instancia transitoria <emphasis>persistente</emphasis> asoci&#x00e1;ndola con una sesi&#x00f3;n:

source: If <literal>Cat</literal> has a generated identifier, the identifier is generated and assigned to the <literal>cat</literal> when <literal>save()</literal> is called. If <literal>Cat</literal> has an <literal>assigned</literal> identifier, or a composite key, the identifier should be assigned to the <literal>cat</literal> instance before calling <literal>save()</literal>. You may also use <literal>persist()</literal> instead of <literal>save()</literal>, with the semantics defined in the EJB3 early draft.
es_es: Si <literal>Cat</literal> tiene un identificador generado, el identificador es generado y asignado al <literal>cat</literal> cuando se llama a <literal>save()</literal>. Si <literal>Cat</literal> tiene un identificador <literal>assigned</literal>, o una clave compuesta, el identificador debe ser asignado a la instancia de <literal>cat</literal> antes de llamar a <literal>save()</literal>. Puedes tambi&#x00e9;n usar <literal>persist()</literal> en vez de <literal>save()</literal>, con la sem&#x00e1;ntica definida en el temprano borrador de EJB3.

source: <literal>persist()</literal> makes a transient instance persistent. However, it doesn't guarantee that the identifier value will be assigned to the persistent instance immediately, the assignment might happen at flush time. <literal>persist()</literal> also guarantees that it will not execute an <literal>INSERT</literal> statement if it is called outside of transaction boundaries. This is useful in long-running conversations with an extended Session/persistence context.
es_es: UNTRANSLATED!!! <literal>persist()</literal> makes a transient instance persistent. However, it doesn't guarantee that the identifier value will be assigned to the persistent instance immediately, the assignment might happen at flush time. <literal>persist()</literal> also guarantees that it will not execute an <literal>INSERT</literal> statement if it is called outside of transaction boundaries. This is useful in long-running conversations with an extended Session/persistence context.

source: Alternatively, you may assign the identifier using an overloaded version of <literal>save()</literal>.
es_es: Alternativamente, puedes asignar el identificador usando una versi&#x00f3;n sobrecargada de <literal>save()</literal>.

source: If the object you make persistent has associated objects (e.g. the <literal>kittens</literal> collection in the previous example), these objects may be made persistent in any order you like unless you have a <literal>NOT NULL</literal> constraint upon a foreign key column. There is never a risk of violating foreign key constraints. However, you might violate a <literal>NOT NULL</literal> constraint if you <literal>save()</literal> the objects in the wrong order.
es_es: Si el objeto que haces persistente tiene objetos asociados (por ejemplo, la colecci&#x00f3;n <literal>kittens</literal> en el ejemplo anterior), estos objetos pueden ser hechos persistentes en cualquier orden que quieras a menos que tengas una restricci&#x00f3;n <literal>NOT NULL</literal> sobre una columna clave for&#x00e1;nea. Nunca hay riesgo de violar restricciones de clave for&#x00e1;nea. Sin embargo, podr&#x00ed;as violar una restricci&#x00f3;n <literal>NOT NULL</literal> si llamas a <literal>save()</literal> sobre objetos en orden err&#x00f3;neo.

source: Usually you don't bother with this detail, as you'll very likely use Hibernate's <emphasis>transitive persistence</emphasis> feature to save the associated objects automatically. Then, even <literal>NOT NULL</literal> constraint violations don't occur - Hibernate will take care of everything. Transitive persistence is discussed later in this chapter.
es_es: Usualmente no te preocupas con este detalle, pues muy probablemente usar&#x00e1;s la funcionalidad de <emphasis>persistencia transitiva</emphasis> de Hibernate para salvar los objetos asociados autom&#x00e1;ticamente. Entonces, ni siquiera ocurren violaciones de restricciones <literal>NOT NULL</literal> - Hibernate cuidar&#x00e1; de todo. La persistencia transitiva se discute m&#x00e1;s adelante en este cap&#x00ed;tulo.

source: Loading an object
es_es: Cargando un objeto

source: The <literal>load()</literal> methods of <literal>Session</literal> gives you a way to retrieve a persistent instance if you already know its identifier. <literal>load()</literal> takes a class object and will load the state into a newly instantiated instance of that class, in persistent state.
es_es: Los m&#x00e9;todos <literal>load()</literal> de <literal>Session</literal> te brindan una forma de traer una instancia persistente si ya saves su identificador. <literal>load()</literal> toma un objeto clase y cargar&#x00e1; el estado dentro de una instancia reci&#x00e9;n instanciada de esta clase, en estado persistente.

source: Alternatively, you can load state into a given instance:
es_es: Alternativamente, puedes cargar estado dentro de una instancia dada:

source: Note that <literal>load()</literal> will throw an unrecoverable exception if there is no matching database row. If the class is mapped with a proxy, <literal>load()</literal> just returns an uninitialized proxy and does not actually hit the database until you invoke a method of the proxy. This behaviour is very useful if you wish to create an association to an object without actually loading it from the database. It also allows multiple instances to be loaded as a batch if <literal>batch-size</literal> is defined for the class mapping.
es_es: Nota que <literal>load()</literal> lanzar&#x00e1; una excepci&#x00f3;n irrecuperable si no hay una fila correspondiente en base de datos. Si la clase es mapeada con un proxy, <literal>load()</literal> s&#x00f3;lo devuelve un proxy no inicializado y no llamar&#x00e1; realmente a la base de datos hasta que invoques un m&#x00e9;todo del proxy. Este comportamiento es muy &#x00fa;til si deseas crear una asociaci&#x00f3;n a un objeto sin cargarlo realmente de la base de datos. Permite adem&#x00e1;s que m&#x00fa;ltiples instancias sean cargadas como un lote si se define <literal>batch-size</literal> para el mapeo de la clase.

source: If you are not certain that a matching row exists, you should use the <literal>get()</literal> method, which hits the database immediately and returns null if there is no matching row.
es_es: Si no tienes certeza que exista una fila correspondiente, debes usar el m&#x00e9;todo <literal>get()</literal>, que llama a la base de datos inmediatamente y devuelve nulo si no existe una fila correspondiente.

source: You may even load an object using an SQL <literal>SELECT ... FOR UPDATE</literal>, using a <literal>LockMode</literal>. See the API documentation for more information.
es_es: Puedes incluso cargar un objeto usando un <literal>SELECT ... FOR UPDATE</literal> de SQL, usando un <literal>LockMode</literal>. Ver la documentaci&#x00f3;n de la API para m&#x00e1;s informaci&#x00f3;n.

source: Note that any associated instances or contained collections are <emphasis>not</emphasis> selected <literal>FOR UPDATE</literal>, unless you decide to specify <literal>lock</literal> or <literal>all</literal> as a cascade style for the association.
es_es: Ten en cuenta que <emphasis>ninguna</emphasis> instancia asociada o colecci&#x00f3;n contenida es selecciona <literal>FOR UPDATE</literal>, a menos que decidas especificar <literal>lock</literal> o <literal>all</literal> como un estilo de cascada para la asociaci&#x00f3;n.

source: It is possible to re-load an object and all its collections at any time, using the <literal>refresh()</literal> method. This is useful when database triggers are used to initialize some of the properties of the object.
es_es: Es posible volver a cargar un objeto y todas sus colecciones en cualquier momento, usando el m&#x00e9;todo <literal>refresh()</literal>. Esto es &#x00fa;til cuando se usan disparadores de base de datos para inicializar algunas de las propiedades del objeto.

source: An important question usually appears at this point: How much does Hibernate load from the database and how many SQL <literal>SELECT</literal>s will it use? This depends on the <emphasis>fetching strategy</emphasis> and is explained in <xref linkend="performance-fetching"/>.
es_es: Una cuesti&#x00f3;n importante aparece usualmente en este punto: Â¿Cu&#x00e1;nto carga Hibernate de la base de datos y cu&#x00e1;ntos <literal>SELECT</literal>s de SQL usar&#x00e1;? Esto depende de la <emphasis>estrategia de recuperaci&#x00f3;n</emphasis> y se explica en <xref linkend="performance-fetching"/>.

source: Querying
es_es: Consultando

source: If you don't know the identifiers of the objects you are looking for, you need a query. Hibernate supports an easy-to-use but powerful object oriented query language (HQL). For programmatic query creation, Hibernate supports a sophisticated Criteria and Example query feature (QBC and QBE). You may also express your query in the native SQL of your database, with optional support from Hibernate for result set conversion into objects.
es_es: Si no sabes los identificadores de los objetos que est&#x00e1;s buscando, necesitas una consulta. Hibernate soporta un lenguaje de consulta orientado a objetos (HQL) f&#x00e1;cil de usar pero potente. Para la creaci&#x00f3;n de consultas program&#x00e1;ticas, Hibernate soporta una funcionalidad sofisticada de consulta de Criteria y Example (QBC and QBE). Tambi&#x00e9;n puedes expresar tu consulta en el SQL nativo de tu base de datos, con soporte opcional de Hibernate para la conversi&#x00f3;n del conjunto resultado en objetos.

source: Executing queries
es_es: Ejecutando consultas

source: HQL and native SQL queries are represented with an instance of <literal>org.hibernate.Query</literal>. This interface offers methods for parameter binding, result set handling, and for the execution of the actual query. You always obtain a <literal>Query</literal> using the current <literal>Session</literal>:
es_es: Las consultas HQL y SQL nativas son representadas con una instancia de <literal>org.hibernate.Query</literal>. Esta interface ofrece m&#x00e9;todos para la ligaci&#x00f3;n de par&#x00e1;metros, manejo del conjunto resultado, y para la ejecuci&#x00f3;n de la consulta real. Siempre obtienes una <literal>Query</literal> usando la <literal>Session</literal> actual:

source: <![CDATA[List cats = session.createQuery( "from Cat as cat where cat.birthdate < ?") .setDate(0, date) .list(); List mothers = session.createQuery( "select mother from Cat as cat join cat.mother as mother where cat.name = ?") .setString(0, name) .list(); List kittens = session.createQuery( "from Cat as cat where cat.mother = ?") .setEntity(0, pk) .list(); Cat mother = (Cat) session.createQuery( "select cat.mother from Cat as cat where cat = ?") .setEntity(0, izi) .uniqueResult();]] Query mothersWithKittens = (Cat) session.createQuery( "select mother from Cat as mother left join fetch mother.kittens"); Set uniqueMothers = new HashSet(mothersWithKittens.list());]]>
es_es: <![CDATA[List cats = session.createQuery( "from Cat as cat where cat.birthdate < ?") .setDate(0, date) .list(); List mothers = session.createQuery( "select mother from Cat as cat join cat.mother as mother where cat.name = ?") .setString(0, name) .list(); List kittens = session.createQuery( "from Cat as cat where cat.mother = ?") .setEntity(0, pk) .list(); Cat mother = (Cat) session.createQuery( "select cat.mother from Cat as cat where cat = ?") .setEntity(0, izi) .uniqueResult();]]>

source: A query is usually executed by invoking <literal>list()</literal>, the result of the query will be loaded completely into a collection in memory. Entity instances retrieved by a query are in persistent state. The <literal>uniqueResult()</literal> method offers a shortcut if you know your query will only return a single object. Note that queries that make use of eager fetching of collections usually return duplicates of the root objects (but with their collections initialized). You can filter these duplicates simply through a <literal>Set</literal>.
es_es: Una consulta se ejecuta usualmente invocando a <literal>list()</literal>, el resultado de la consulta ser&#x00e1; cargado completamente dentro de una colecci&#x00f3;n en memoria. Las instancias de entidad tra&#x00ed;das por una consulta est&#x00e1;n en estado persistente. El m&#x00e9;todo <literal>uniqueResult()</literal> ofrece un atajo si sabes que tu consulta devolver&#x00e1; s&#x00f3;lo un objeto.

source: Iterating results
es_es: Iterando los resultados

source: Occasionally, you might be able to achieve better performance by executing the query using the <literal>iterate()</literal> method. This will only usually be the case if you expect that the actual entity instances returned by the query will already be in the session or second-level cache. If they are not already cached, <literal>iterate()</literal> will be slower than <literal>list()</literal> and might require many database hits for a simple query, usually <emphasis>1</emphasis> for the initial select which only returns identifiers, and <emphasis>n</emphasis> additional selects to initialize the actual instances.
es_es: Ocasionalmente, podr&#x00ed;as ser capaz de lograr mejor rendimiento al ejecutar la consulta usando el m&#x00e9;todo <literal>iterate()</literal>. Esto s&#x00f3;lo ser&#x00e1; en el caso que esperes que las instancias reales de entidad devueltas por la consulta est&#x00e9;n ya en la sesi&#x00f3;n o cach&#x00e9; de segundo nivel. Si todav&#x00ed;a no est&#x00e1;n en cach&#x00e9;, <literal>iterate()</literal> ser&#x00e1; m&#x00e1;s lento que <literal>list()</literal> y podr&#x00ed;a requerir muchas llamadas a la base de datos para una consulta simple, usualmente <emphasis>1</emphasis> para la selecci&#x00f3;n inicial que solamente devuelve identificadores, y <emphasis>n</emphasis> selecciones adicionales para inicializar las instancias reales.

source: Queries that return tuples
es_es: Consultas que devuelven tuplas

source: Hibernate queries sometimes return tuples of objects, in which case each tuple is returned as an array:
es_es: Las consultas de Hibernate a veces devuelven tuplas de objetos, en cuyo caso cada tupla se devuelve como un array:

source: Scalar results
es_es: Resultados escalares

source: Queries may specify a property of a class in the <literal>select</literal> clause. They may even call SQL aggregate functions. Properties or aggregates are considered "scalar" results (and not entities in persistent state).
es_es: Las consultas pueden especificar una propiedad de una clase en la cl&#x00e1;usula <literal>select</literal>. Pueden incluso llamar a funciones de agregaci&#x00f3;n SQL. Las propiedades o agregaciones son considerados resultados "escalares" (y no entidades en estado persistente).

source: <![CDATA[Iterator results = sess.createQuery( "select cat.color, min(cat.birthdate), count(cat) from Cat cat " + "group by cat.color") .list() .iterator(); while ( results.hasNext() ) { Object[] row = (Object[]) results.next(); Color type = (Color) row[0]; Date oldest = (Date) row[1]; Integer count = (Integer) row[2]; ..... }]]>
es_es: <![CDATA[Iterator results = sess.createQuery( "select cat.color, min(cat.birthdate), count(cat) from Cat cat " + "group by cat.color") .list() .iterator(); while ( results.hasNext() ) { Object[] row = results.next(); Color type = (Color) row[0]; Date oldest = (Date) row[1]; Integer count = (Integer) row[2]; ..... }]]>

source: Bind parameters
es_es: Ligaci&#x00f3;n de par&#x00e1;metros

source: Methods on <literal>Query</literal> are provided for binding values to named parameters or JDBC-style <literal>?</literal> parameters. <emphasis>Contrary to JDBC, Hibernate numbers parameters from zero.</emphasis> Named parameters are identifiers of the form <literal>:name</literal> in the query string. The advantages of named parameters are:
es_es: Se proveen m&#x00e9;todos en <literal>Query</literal> para ligar valores a par&#x00e1;metros con nombre o par&#x00e1;metros <literal>?</literal> de estilo JDBC. <emphasis>Al contrario de JDBC, Hibernate numera los par&#x00e1;metros desde cero.</emphasis> Los par&#x00e1;metros con nombre son identificadores de la forma <literal>:name</literal> en la cadena de la consulta. Las ventajas de los par&#x00e1;metros con nombre son:

source: named parameters are insensitive to the order they occur in the query string
es_es: los par&#x00e1;metros con nombre son insensibles al orden en que aparecen en la cadena de consulta

source: they may occur multiple times in the same query
es_es: pueden aparecer m&#x00fa;ltiples veces en la misma consulta

source: they are self-documenting
es_es: son auto-documentados

source: Pagination
es_es: Paginaci&#x00f3;n

source: If you need to specify bounds upon your result set (the maximum number of rows you want to retrieve and / or the first row you want to retrieve) you should use methods of the <literal>Query</literal> interface:
es_es: Si necesitas especificar l&#x00ed;mites sobre tu conjunto resultado (el n&#x00fa;mero m&#x00e1;ximo de filas que quieras traer y/o la primera fila que quieras traer) debes usar los m&#x00e9;todos de la interface <literal>Query</literal>:
