Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/session_api.po
Languages: es_es

source: Hibernate knows how to translate this limit query into the native SQL of your DBMS.
es_es: Hibernate sabe c&#x00f3;mo traducir este l&#x00ed;mite de consulta al SQL nativo de tu DBMS.

source: Scrollable iteration
es_es: Iteraci&#x00f3;n scrollable

source: If your JDBC driver supports scrollable <literal>ResultSet</literal>s, the <literal>Query</literal> interface may be used to obtain a <literal>ScrollableResults</literal> object, which allows flexible navigation of the query results.
es_es: Si tu driver JDBC soporta <literal>ResultSet</literal>s scrollables, la interface <literal>Query</literal> puede ser usada para obtener un objeto <literal>ScrollableResults</literal>, que permite una navegaci&#x00f3;n flexible de los resultados de consulta.

source: Note that an open database connection (and cursor) is required for this functionality, use <literal>setMaxResult()</literal>/<literal>setFirstResult()</literal> if you need offline pagination functionality.
es_es: Nota que se requiere una conexi&#x00f3;n de base de datos abierta (y cursor) para esta funcionalidad, usa <literal>setMaxResult()</literal>/<literal>setFirstResult()</literal> si necesitas la funcionalidad de paginaci&#x00f3;n fuera de l&#x00ed;nea.

source: Externalizing named queries
es_es: Externalizando consultas con nombre

source: You may also define named queries in the mapping document. (Remember to use a <literal>CDATA</literal> section if your query contains characters that could be interpreted as markup.)
es_es: Puedes adem&#x00e1;s definir consultas con nombre en el documento de mapeo. (Recuerda usar una secci&#x00f3;n <literal>CDATA</literal> si tu consulta contiene caracteres que puedan ser interpretados como etiquetado.)

source: <![CDATA[<query name="ByNameAndMaximumWeight"><![CDATA[ from eg.DomesticCat as cat where cat.name = ? and cat.weight > ? ] ]></query>]]>
es_es: <![CDATA[<query name="eg.DomesticCat.by.name.and.minimum.weight"><![CDATA[ from eg.DomesticCat as cat where cat.name = ? and cat.weight > ? ] ]></query>]]>

source: Parameter binding and executing is done programatically:
es_es: La ligaci&#x00f3;n de par&#x00e1;metros y ejecuci&#x00f3;n se hace program&#x00e1;ticamente:

source: <![CDATA[Query q = sess.getNamedQuery("ByNameAndMaximumWeight"); q.setString(0, name); q.setInt(1, minWeight); List cats = q.list();]]>
es_es: <![CDATA[Query q = sess.getNamedQuery("eg.DomesticCat.by.name.and.minimum.weight"); q.setString(0, name); q.setInt(1, minWeight); List cats = q.list();]]>

source: Note that the actual program code is independent of the query language that is used, you may also define native SQL queries in metadata, or migrate existing queries to Hibernate by placing them in mapping files.
es_es: Nota que el c&#x00f3;digo real del programa es independiente del lenguaje de consulta usado; puedes adem&#x00e1;s definir consultas SQL nativas en metadatos, o migrar consultas existentes a Hibernate coloc&#x00e1;ndolas en ficheros de mapeo.

source: Also note that a query declaration inside a <literal>&lt;hibernate-mapping&gt;</literal> element requires a global unique name for the query, while a query declaration inside a <literal>&lt;class&gt;</literal> element is made unique automatically by prepending the fully qualified name of the class, for example <literal>eg.Cat.ByNameAndMaximumWeight</literal>.
es_es: UNTRANSLATED! Also note that a query declaration inside a <literal>&lt;hibernate-mapping&gt;</literal> element requires a global unique name for the query, while a query declaration inside a <literal>&lt;class&gt;</literal> element is made unique automatically by prepending the fully qualified name of the class, for example <literal>eg.Cat.ByNameAndMaximumWeight</literal>.

source: Filtering collections
es_es: Filtrando colecciones

source: A collection <emphasis>filter</emphasis> is a special type of query that may be applied to a persistent collection or array. The query string may refer to <literal>this</literal>, meaning the current collection element.
es_es: Un <emphasis>filtro</emphasis> de colecci&#x00f3;n es un tipo especial de consulta que puede ser aplicado a una colecci&#x00f3;n persistente o array. La cadena de consulta puede referirse a <literal>this</literal>, significando el elemento de colecci&#x00f3;n actual.

source: The returned collection is considered a bag, and it's a copy of the given collection. The original collection is not modified (this is contrary to the implication of the name "filter", but consistent with expected behavior).
es_es: La colecci&#x00f3;n devuelta es considerada un bag, y es una copia de la colecci&#x00f3;n dada. La colecci&#x00f3;n original no es modificada (esto es contrario a la implicaci&#x00f3;n del nombre "filtro", pero consistente con el comportamiento esperado).

source: Observe that filters do not require a <literal>from</literal> clause (though they may have one if required). Filters are not limited to returning the collection elements themselves.
es_es: Observa que los filtros no requieren una cl&#x00e1;usula <literal>from</literal> (aunque pueden tener uno si se requiere). Los filtros no est&#x00e1;n limitados a devolver los elementos de colecci&#x00f3;n por s&#x00ed; mismos.

source: Even an empty filter query is useful, e.g. to load a subset of elements in a huge collection:
es_es: Incluso una consulta de filtro vac&#x00ed;o es &#x00fa;til, por ejemplo, para cargar un subconjunto de elementos en una colecci&#x00f3;n enorme:

source: Criteria queries
es_es: Consultas de criterios

source: HQL is extremely powerful but some developers prefer to build queries dynamically, using an object-oriented API, rather than building query strings. Hibernate provides an intuitive <literal>Criteria</literal> query API for these cases:
es_es: HQL es extremadamente potente pero algunos desarrolladores prefieren construir consultas din&#x00e1;micamente usando una API orientada a objetos, en vez construir cadenas de consulta. Hibernate provee una API intuitiva de consulta <literal>Criteria</literal> para estos casos:

source: The <literal>Criteria</literal> and the associated <literal>Example</literal> API are discussed in more detail in <xref linkend="querycriteria"/>.
es_es: Las APIs de <literal>Criteria</literal> y la asociada <literal>Example</literal> son discutidas en m&#x00e1;s detalle en <xref linkend="querycriteria"/>.

source: Queries in native SQL
es_es: Consultas en SQL nativo

source: You may express a query in SQL, using <literal>createSQLQuery()</literal> and let Hibernate take care of the mapping from result sets to objects. Note that you may at any time call <literal>session.connection()</literal> and use the JDBC <literal>Connection</literal> directly. If you chose to use the Hibernate API, you must enclose SQL aliases in braces:
es_es: Puedes expresar una consulta en SQL, usando <literal>createSQLQuery()</literal> y dejando que Hibernate cuide del mapeo de los conjuntos resultado a objetos. Nota que puedes llamar en cualquier momento a <literal>session.connection()</literal> y usar la <literal>Connection</literal> JDBC directamente. Si eliges usar la API de Hibernate, debes encerrar los alias de SQL entre llaves:

source: SQL queries may contain named and positional parameters, just like Hibernate queries. More information about native SQL queries in Hibernate can be found in <xref linkend="querysql"/>.
es_es: Las consultas SQL pueden contener par&#x00e1;metros con nombre y posicionales, al igual que las consultas de Hibernate. Puede encontrarse m&#x00e1;s informaci&#x00f3;n sobre consultas en SQL nativo en <xref linkend="querysql"/>.

source: Modifying persistent objects
es_es: Modificando objetos persistentes

source: <emphasis>Transactional persistent instances</emphasis> (ie. objects loaded, saved, created or queried by the <literal>Session</literal>) may be manipulated by the application and any changes to persistent state will be persisted when the <literal>Session</literal> is <emphasis>flushed</emphasis> (discussed later in this chapter). There is no need to call a particular method (like <literal>update()</literal>, which has a different purpose) to make your modifications persistent. So the most straightforward way to update the state of an object is to <literal>load()</literal> it, and then manipulate it directly, while the <literal>Session</literal> is open:
es_es: Las <emphasis>instancias persistentes transaccionales</emphasis> (es decir, objetos cargados, creados o consultados por la <literal>Session</literal>) pueden ser manipulados por la aplicaci&#x00f3;n y cualquier cambio al estado persistente ser&#x00e1; persistido cuando la <literal>Session</literal> sea <emphasis>limpiada (flushed)</emphasis> (discutido m&#x00e1;s adelante en este cap&#x00ed;tulo). No hay necesidad de llamar un m&#x00e9;todo en particular (como <literal>update()</literal>, que tiene un prop&#x00f3;sito diferente) para hacer persistentes tus modificaciones. De modo que la forma m&#x00e1;s directa de actualizar el estado de un objeto es cargarlo con <literal>load()</literal>, y entonces manipularlo directamente, mientras la <literal>Session</literal> est&#x00e1; abierta:

source: Sometimes this programming model is inefficient since it would require both an SQL <literal>SELECT</literal> (to load an object) and an SQL <literal>UPDATE</literal> (to persist its updated state) in the same session. Therefore Hibernate offers an alternate approach, using detached instances.
es_es: A veces este modelo de programaci&#x00f3;n es ineficiente pues podr&#x00ed;a requerir una <literal>SELECT</literal> de SQL (para cargar un objeto) y un <literal>UPDATE</literal> de SQL (para hacer persistentes sus datos actualizados) en la misma sesi&#x00f3;n. Por lo tanto, Hibernate ofrece un enfoque alternativo, usando instancias separadas (detached).

source: Note that Hibernate does not offer its own API for direct execution of <literal>UPDATE</literal> or <literal>DELETE</literal> statements. Hibernate is a <emphasis>state management</emphasis> service, you don't have to think in <emphasis>statements</emphasis> to use it. JDBC is a perfect API for executing SQL statements, you can get a JDBC <literal>Connection</literal> at any time by calling <literal>session.connection()</literal>. Furthermore, the notion of mass operations conflicts with object/relational mapping for online transaction processing-oriented applications. Future versions of Hibernate may however provide special mass operation functions. See <xref linkend="batch"/> for some possible batch operation tricks.
es_es: Nota que Hibernate no ofreve su propia API para ejecuci&#x00f3;n directa de sentencias <literal>UPDATE</literal> o <literal>DELETE</literal>. Hibernate es un servicio de <emphasis>gesti&#x00f3;n de estado</emphasis>, no tienes que pensar en <literal>sentencias</literal> para usarlo. JDBC es una API perfecta para ejecutar sentencias SQL; puedes obtener una <literal>Connection</literal> JDBC en cualquier momento llamando a <literal>session.connection()</literal>. Adem&#x00e1;s, la noci&#x00f3;n de operaciones masivas entra en conflicto con el mapeo objeto/relacional en aplicaciones en l&#x00ed;nea orientadas al procesamiento de transacciones. Versiones futuras de Hibernate pueden, sin embargo, proveer funciones de operaci&#x00f3;n masiva especiales. Ver <xref linkend="batch"/> por algunos trucos de operaci&#x00f3;n en lote (batch) posibles.

source: Modifying detached objects
es_es: Modificando objetos separados

source: Many applications need to retrieve an object in one transaction, send it to the UI layer for manipulation, then save the changes in a new transaction. Applications that use this kind of approach in a high-concurrency environment usually use versioned data to ensure isolation for the "long" unit of work.
es_es: Muchas aplicaciones necesitan recuperar un objeto en una transacci&#x00f3;n, enviarla a la capa de UI para su manipulaci&#x00f3;n, y entonces salvar los cambios en una nueva transacci&#x00f3;n. Las aplicaciones que usan este tipo de enfoque en un entorno de alta concurrencia usualmente usan datos versionados para asegurar el aislamiento de la unidad de trabajo "larga".

source: Hibernate supports this model by providing for reattachment of detached instances using the <literal>Session.update()</literal> or <literal>Session.merge()</literal> methods:
es_es: Hibernate soporta este modelo al proveer re-uni&#x00f3;n de instancias separadas usando los m&#x00e9;todos <literal>Session.update()</literal> o <literal>Session.merge()</literal>:

source: If the <literal>Cat</literal> with identifier <literal>catId</literal> had already been loaded by <literal>secondSession</literal> when the application tried to reattach it, an exception would have been thrown.
es_es: Si el <literal>Cat</literal> con identificador <literal>catId</literal> ya hubiera sido cargado por <literal>secondSession</literal> cuando la aplicaci&#x00f3;n intent&#x00f3; volver a unirlo, se habr&#x00ed;a lanzado una excepci&#x00f3;n.

source: Use <literal>update()</literal> if you are sure that the session does not contain an already persistent instance with the same identifier, and <literal>merge()</literal> if you want to merge your modifications at any time without consideration of the state of the session. In other words, <literal>update()</literal> is usually the first method you would call in a fresh session, ensuring that reattachment of your detached instances is the first operation that is executed.
es_es: Usa <literal>update()</literal> si no est&#x00e1;s seguro que la sesi&#x00f3;n tenga una instancia ya persistente con el mismo identificador, y <literal>merge()</literal> si quieres fusionar tus modificaciones en cualquier momento sin consideraci&#x00f3;n del estado de la sesi&#x00f3;n. En otras palabras, <literal>update()</literal> es usualmente el primer m&#x00e9;todo que llamar&#x00ed;as en una sesi&#x00f3;n fresca, asegurando que la re-uni&#x00f3;n de tus instancias separadas es la primera operaci&#x00f3;n que se ejecuta.

source: The application should individually <literal>update()</literal> detached instances reachable from the given detached instance if and <emphasis>only</emphasis> if it wants their state also updated. This can be automated of course, using <emphasis>transitive persistence</emphasis>, see <xref linkend="objectstate-transitive"/>.
es_es: La aplicaci&#x00f3;n debe actualizar individualmente las instancias separadas alcanzables por la instancia separada dada llamando a <literal>update()</literal>, si y <emphasis>s&#x00f3;lo</emphasis> si quiere que sus estados sean tambi&#x00e9;n actualizados. Esto puede, por supuesto, ser automatizado usando <emphasis>persistencia transitiva</emphasis>, ver <xref linkend="objectstate-transitive"/>.

source: The <literal>lock()</literal> method also allows an application to reassociate an object with a new session. However, the detached instance has to be unmodified!
es_es: El m&#x00e9;todo <literal>lock()</literal> tambi&#x00e9;n permite a una aplicaci&#x00f3;n reasociar un objeto con una sesi&#x00f3;n nueva. Sin embargo, la instancia separada no puede haber sido modificada!

source: Note that <literal>lock()</literal> can be used with various <literal>LockMode</literal>s, see the API documentation and the chapter on transaction handling for more information. Reattachment is not the only usecase for <literal>lock()</literal>.
es_es: Nota que <literal>lock()</literal> puede ser usado con varios <literal>LockMode</literal>s, ver la documentaci&#x00f3;n de la API y el cap&#x00ed;tulo sobre manejo de transacciones para m&#x00e1;s informaci&#x00f3;n. La re-uni&#x00f3;n no es el &#x00fa;nico caso de uso para <literal>lock()</literal>.

source: Other models for long units of work are discussed in <xref linkend="transactions-optimistic"/>.
es_es: Se discuten otros modelos para unidades de trabajo largas en <xref linkend="transactions-optimistic"/>.

source: Automatic state detection
es_es: Detecci&#x00f3;n autom&#x00e1;tica de estado

source: Hibernate users have requested a general purpose method that either saves a transient instance by generating a new identifier or updates/reattaches the detached instances associated with its current identifier. The <literal>saveOrUpdate()</literal> method implements this functionality.
es_es: Los usuarios de Hibernate han pedido un m&#x00e9;todo de prop&#x00f3;sito general que bien salve una instancia transitoria generando un identificador nuevo, o bien actualice/re&#x00fa;na las instancias separadas asociadas con su identificador actual. El m&#x00e9;todo <literal>saveOrUpdate()</literal> implementa esta funcionalidad.

source: The usage and semantics of <literal>saveOrUpdate()</literal> seems to be confusing for new users. Firstly, so long as you are not trying to use instances from one session in another new session, you should not need to use <literal>update()</literal>, <literal>saveOrUpdate()</literal>, or <literal>merge()</literal>. Some whole applications will never use either of these methods.
es_es: El uso y sem&#x00e1;ntica de <literal>saveOrUpdate()</literal> parece ser confuso para usuarios nuevos. Primeramente, en tanto no est&#x00e9;s intentando usar instancias de una sesi&#x00f3;n en otra sesi&#x00f3;n nueva, no debes necesitar usar <literal>update()</literal>, <literal>saveOrUpdate()</literal>, o <literal>merge()</literal>. Algunas aplicaciones enteras nunca usar&#x00e1;n ninguno de estos m&#x00e9;todos.

source: Usually <literal>update()</literal> or <literal>saveOrUpdate()</literal> are used in the following scenario:
es_es: Usualmente <literal>update()</literal> o <literal>saveOrUpdate()</literal> se usan en el siguiente escenario:

source: the application loads an object in the first session
es_es: la aplicaci&#x00f3;n carga un objeto en la primera sesi&#x00f3;n

source: the object is passed up to the UI tier
es_es: el objeto es pasado a la capa de UI

source: some modifications are made to the object
es_es: se hacen algunas modificaciones al objeto

source: the object is passed back down to the business logic tier
es_es: el objeto se pasa abajo de regreso a la capa de negocio

source: the application persists these modifications by calling <literal>update()</literal> in a second session
es_es: la aplicaci&#x00f3;n hace estas modificaciones persistentes llamando a <literal>update()</literal> en una segunda sesi&#x00f3;n

source: <literal>saveOrUpdate()</literal> does the following:
es_es: <literal>saveOrUpdate()</literal> hace lo siguiente:

source: if the object is already persistent in this session, do nothing
es_es: si el objeto ya es persistente en esta sesi&#x00f3;n, no hace nada

source: if another object associated with the session has the same identifier, throw an exception
es_es: si otro objeto asociado con la sesi&#x00f3;n tiene el mismo identificador, lanza una excepci&#x00f3;n

source: if the object has no identifier property, <literal>save()</literal> it
es_es: si el objeto no tiene ninguna propiedad identificadora, lo salva llamando a <literal>save()</literal>

source: if the object's identifier has the value assigned to a newly instantiated object, <literal>save()</literal> it
es_es: si el identificador del objeto tiene el valor asignado a un objeto reci&#x00e9;n instanciado, lo salva llamando a <literal>save()</literal>

source: if the object is versioned (by a <literal>&lt;version&gt;</literal> or <literal>&lt;timestamp&gt;</literal>), and the version property value is the same value assigned to a newly instantiated object, <literal>save()</literal> it
es_es: si el objeto est&#x00e1; versionado (por un <literal>&lt;version&gt;</literal> o <literal>&lt;timestamp&gt;</literal>), y el valor de la propiedad de versi&#x00f3;n es el mismo valor asignado a una objeto reci&#x00e9;n instanciado, lo salva llamando a <literal>save()</literal>

source: otherwise <literal>update()</literal> the object
es_es: en cualquier otro caso se actualiza el objeto llamando a <literal>update()</literal>

source: and <literal>merge()</literal> is very different:
es_es: y <literal>merge()</literal> es muy diferente:

source: if there is a persistent instance with the same identifier currently associated with the session, copy the state of the given object onto the persistent instance
es_es: si existe una instancia persistente con el mismo identificador asignado actualmente con la sesi&#x00f3;n, copia el estado del objeto dado en la instancia persistente

source: if there is no persistent instance currently associated with the session, try to load it from the database, or create a new persistent instance
es_es: si no existe ninguna instancia persistente actualmente asociada a la sesi&#x00f3;n, intente cargarla de la base de datos, o crear una nueva instancia persistente

source: the persistent instance is returned
es_es: la instancia persistente es devuelta

source: the given instance does not become associated with the session, it remains detached
es_es: la instancia dada no resulta ser asociada a la sesi&#x00f3;n, permanece separada

source: Deleting persistent objects
es_es: Borrando objetos persistentes

source: <literal>Session.delete()</literal> will remove an object's state from the database. Of course, your application might still hold a reference to a deleted object. It's best to think of <literal>delete()</literal> as making a persistent instance transient.
es_es: <literal>Session.delete()</literal> quitar&#x00e1; el estado de un objeto de la base de datos. Por supuesto, tu aplicaci&#x00f3;n podr&#x00ed;a tener a&#x00fa;n una referencia a un objeto borrado. Lo mejor es pensar en <literal>delete()</literal> como hacer transitoria una instancia persistente.

source: You may delete objects in any order you like, without risk of foreign key constraint violations. It is still possible to violate a <literal>NOT NULL</literal> constraint on a foreign key column by deleting objects in the wrong order, e.g. if you delete the parent, but forget to delete the children.
es_es: Puedes borrar los objetos en el orden que gustes, sin riesgo de violaciones de restricci&#x00f3;n de clave for&#x00e1;nea. A&#x00fa;n es posible violar una restricci&#x00f3;n <literal>NOT NULL</literal> sobre una columna clave for&#x00e1;nea borrando objetos en un orden err&#x00f3;neo, por ejemplo, si borras el padre, pero olvidas borrar los hijos.

source: Replicating object between two different datastores
es_es: Replicando objetos entre dos almac&#x00e9;nes de datos diferentes

source: It is occasionally useful to be able to take a graph of persistent instances and make them persistent in a different datastore, without regenerating identifier values.
es_es: Es ocasionalmente &#x00fa;til ser capaz de tomar un grafo de instancias persistentes y hacerlas persistentes en un almac&#x00e9;n de datos diferente, sin regenerar los valores identificadores.

source: The <literal>ReplicationMode</literal> determines how <literal>replicate()</literal> will deal with conflicts with existing rows in the database.
es_es: El <literal>ReplicationMode</literal> determina c&#x00f3;mo <literal>replicate()</literal> tratar&#x00e1; los conflictos con filas existentes en la base de datos.

source: <literal>ReplicationMode.IGNORE</literal> - ignore the object when there is an existing database row with the same identifier
es_es: <literal>ReplicationMode.IGNORE</literal> - ignora el objeto cuando existe una fila de base de datos con el mismo identificador

source: <literal>ReplicationMode.OVERWRITE</literal> - overwrite any existing database row with the same identifier
es_es: <literal>ReplicationMode.OVERWRITE</literal> - sobrescribe cualquier fila de base de datos existente con el mismo identificador
