Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/session_api.po
Languages: es_es

source: <literal>ReplicationMode.EXCEPTION</literal> - throw an exception if there is an existing database row with the same identifier
es_es: <literal>ReplicationMode.EXCEPTION</literal> - lanza una excepci&#x00f3;n si existe una fila de base de datos con el mismo identificador

source: <literal>ReplicationMode.LATEST_VERSION</literal> - overwrite the row if its version number is earlier than the version number of the object, or ignore the object otherwise
es_es: <literal>ReplicationMode.LATEST_VERSION</literal> - sobrescribe la fila si su n&#x00fa;mero de versi&#x00f3;n es anterior al n&#x00fa;mero de versi&#x00f3;n del objeto, o en caso contrario ignora el objeto

source: Usecases for this feature include reconciling data entered into different database instances, upgrading system configuration information during product upgrades, rolling back changes made during non-ACID transactions and more.
es_es: Los casos de uso para esta funcionalidad incluyen reconciliar datos ingresados en instancias diferentes de bases de datos, actualizar informaci&#x00f3;n de configuraci&#x00f3;n de sistema durante actualizaciones de producto, deshacer cambios producidos durante transacciones no-ACID y m&#x00e1;s.

source: Flushing the Session
es_es: Limpiando (flushing) la sesi&#x00f3;n

source: From time to time the <literal>Session</literal> will execute the SQL statements needed to synchronize the JDBC connection's state with the state of objects held in memory. This process, <emphasis>flush</emphasis>, occurs by default at the following points
es_es: Cada tanto, la <literal>Session</literal> ejecutar&#x00e1; las sentencias SQL necesarias para sincronizar el estado de la conexi&#x00f3;n JDBC con el estado de los objetos mantenidos en menoria. Este proceso, <emphasis>limpieza (flush)</emphasis>, ocurre por defecto en los siguientes puntos

source: before some query executions
es_es: antes de algunas ejecuciones de consulta

source: from <literal>org.hibernate.Transaction.commit()</literal>
es_es: desde <literal>org.hibernate.Transaction.commit()</literal>

source: from <literal>Session.flush()</literal>
es_es: desde <literal>Session.flush()</literal>

source: The SQL statements are issued in the following order
es_es: Las sentencias SQL son liberadas en el siguiente orden

source: all entity insertions, in the same order the corresponding objects were saved using <literal>Session.save()</literal>
es_es: todas las inserciones de entidades, en el mismo orden que los objetos correspondientes fueron salvados usando <literal>Session.save()</literal>

source: all entity updates
es_es: todas las actualizaciones de entidades

source: all collection deletions
es_es: todas los borrados de colecciones

source: all collection element deletions, updates and insertions
es_es: todos los borrados, actualizaciones e inserciones de elementos de colecci&#x00f3;n

source: all collection insertions
es_es: todas las inserciones de colecciones

source: all entity deletions, in the same order the corresponding objects were deleted using <literal>Session.delete()</literal>
es_es: todos los borrados de entidades, en el mismo orden que los objetos correspondientes fueron borrados usando <literal>Session.delete()</literal>

source: (An exception is that objects using <literal>native</literal> ID generation are inserted when they are saved.)
es_es: (Una excepci&#x00f3;n es que los objetos que usan generaci&#x00f3;n de ID <literal>native</literal> se insertan cuando son salvados.)

source: Except when you explicity <literal>flush()</literal>, there are absolutely no guarantees about <emphasis>when</emphasis> the <literal>Session</literal> executes the JDBC calls, only the <emphasis>order</emphasis> in which they are executed. However, Hibernate does guarantee that the <literal>Query.list(..)</literal> will never return stale data; nor will they return the wrong data.
es_es: Excepto cuando llamas expl&#x00ed;citamente a <literal>flush()</literal>, no hay en absoluto garant&#x00ed;as sobre <emphasis>cu&#x00e1;ndo</emphasis> la <literal>Session</literal> ejecuta las llamadas JDBC. s&#x00f3;lo sobre el <emphasis>orden</emphasis> en que son ejecutadas. Sin embargo, Hibernate garantiza que los m&#x00e9;todos <literal>Query.list(..)</literal> nunca devolver&#x00e1;n datos a&#x00f1;ejos o err&#x00f3;neos.

source: It is possible to change the default behavior so that flush occurs less frequently. The <literal>FlushMode</literal> class defines three different modes: only flush at commit time (and only when the Hibernate <literal>Transaction</literal> API is used), flush automatically using the explained routine, or never flush unless <literal>flush()</literal> is called explicitly. The last mode is useful for long running units of work, where a <literal>Session</literal> is kept open and disconnected for a long time (see <xref linkend="transactions-optimistic-longsession"/>).
es_es: Es posible cambiar el comportamiento por defecto de modo que la limpieza (flush) ocurra menos frecuentemente. La clase <literal>FlushMode</literal> tres modos diferentes: s&#x00f3;lo en tiempo de compromiso (y s&#x00f3;lo cuando se use la API de <literal>Transaction</literal> de Hibernate), limpieza autom&#x00e1;tica usando la rutina explicada, o nunca limpiar a menos que se llame a <literal>flush()</literal> expl&#x00ed;citamente. El &#x00fa;ltimo modo es &#x00fa;til para unidades de trabajo largas, donde una <literal>Session</literal> se mantiene abierta y desconectada por largo tiempo (ver <xref linkend="transactions-optimistic-longsession"/>).

source: <![CDATA[sess = sf.openSession(); Transaction tx = sess.beginTransaction(); sess.setFlushMode(FlushMode.COMMIT); // allow queries to return stale state Cat izi = (Cat) sess.load(Cat.class, id); izi.setName(iznizi); // might return stale data sess.find("from Cat as cat left outer join cat.kittens kitten"); // change to izi is not flushed! ... tx.commit(); // flush occurs sess.close();]]>
es_es: <![CDATA[sess = sf.openSession(); Transaction tx = sess.beginTransaction(); sess.setFlushMode(FlushMode.COMMIT); // allow queries to return stale state Cat izi = (Cat) sess.load(Cat.class, id); izi.setName(iznizi); // might return stale data sess.find("from Cat as cat left outer join cat.kittens kitten"); // change to izi is not flushed! ... tx.commit(); // flush occurs]]>

source: During flush, an exception might occur (e.g. if a DML operation violates a constraint). Since handling exceptions involves some understanding of Hibernate's transactional behavior, we discuss it in <xref linkend="transactions"/>.
es_es: Durante la limpieza, puede ocurrir una excepci&#x00f3;n (por ejemplo, si una operaci&#x00f3;n DML violase una restricci&#x00f3;n). Ya que el manejo de excepciones implica alguna comprensi&#x00f3;n del comportamiento transaccional de Hibernate, lo discutimos en <xref linkend="transactions"/>.

source: Transitive persistence
es_es: Persistencia transitiva

source: It is quite cumbersome to save, delete, or reattach individual objects, especially if you deal with a graph of associated objects. A common case is a parent/child relationship. Consider the following example:
es_es: Es absolutamente inc&#x00f3;modo dalvar, borrar, o reunir objetos individuales, especialmente si tratas con un grafo de objetos asociados. Un caso com&#x00fa;n es una relaci&#x00f3;n padre/hijo. Considera el siguiente ejemplo:

source: If the children in a parent/child relationship would be value typed (e.g. a collection of addresses or strings), their life cycle would depend on the parent and no further action would be required for convenient "cascading" of state changes. When the parent is saved, the value-typed child objects are saved as well, when the parent is deleted, the children will be deleted, etc. This even works for operations such as the removal of a child from the collection; Hibernate will detect this and, since value-typed objects can't have shared references, delete the child from the database.
es_es: Si los hijos en una relaci&#x00f3;n padre/hijo pudieran ser tipificados en valor (por ejemplo, una colecci&#x00f3;n de direcciones o cadenas), sus ciclos de vida depender&#x00ed;an del padre y se requerir&#x00ed;a ninguna otra acci&#x00f3;n para el tratamiento en "cascada" de cambios de estado. Cuando el padre es salvado, los objetos hijo tipificados en valor son salvados tambi&#x00e9;n, cuando se borra el padre, se borran los hijos, etc. Esto funciona incluso para operaciones como el retiro de un hijo de la colecci&#x00f3;n. Hibernate detectar&#x00e1; esto y, ya que los objetos tipificados en valor no pueden tener referencias compartidas, borrar&#x00e1; el hijo de la base de datos.

source: Now consider the same scenario with parent and child objects being entities, not value-types (e.g. categories and items, or parent and child cats). Entities have their own life cycle, support shared references (so removing an entity from the collection does not mean it can be deleted), and there is by default no cascading of state from one entity to any other associated entities. Hibernate does not implement <emphasis>persistence by reachability</emphasis> by default.
es_es: Ahora considera el mismo escenario con los objetos padre e hijos siendo entidades, no tipos de valor (por ejemplo, categor&#x00ed;as e &#x00ed;tems, o gatos padre e hijos). Las entidades tienen su propio ciclo de vida, soportan referencias compartidas (de modo que quitar una entidad de una colecci&#x00f3;n no significa que sea borrada), y no hay por defecto ning&#x00fa;n tratamiento en "cascada" de estado de una entidad a otras entidades asociadas. Hibernate no implementa <emphasis>persistencia por alcance</emphasis>.

source: For each basic operation of the Hibernate session - including <literal>persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</literal> - there is a corresponding cascade style. Respectively, the cascade styles are named <literal>create, merge, save-update, delete, lock, refresh, evict, replicate</literal>. If you want an operation to be cascaded along an association, you must indicate that in the mapping document. For example:
es_es: Para cada operaci&#x00f3;n b&#x00e1;sica de la sesi&#x00f3;n de Hibernate - incluyendo <literal>persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</literal> - hay un estilo de cascada correspondiente. Respectivamente, los estilos de cascada se llaman <literal>create, merge, save-update, delete, lock, refresh, evict, replicate</literal>. Si quieres que una operaci&#x00f3;n sea tratada en cascada a lo largo de una asociaci&#x00f3;n, debes indicar eso en el documento de mapeo. Por ejemplo:

source: Cascade styles my be combined:
es_es: Los estilos de cascada pueden combinarse:

source: You may even use <literal>cascade="all"</literal> to specify that <emphasis>all</emphasis> operations should be cascaded along the association. The default <literal>cascade="none"</literal> specifies that no operations are to be cascaded.
es_es: Puedes incluso usar <literal>cascade="all"</literal> para especificar que <emphasis>todas</emphasis> las operaciones deben ser tratadas en cascada a lo largo de la asociaci&#x00f3;n. El por defecto <literal>cascade="none"</literal> especifica que ninguna operaci&#x00f3;n ser&#x00e1; tratada en cascada.

source: A special cascade style, <literal>delete-orphan</literal>, applies only to one-to-many associations, and indicates that the <literal>delete()</literal> operation should be applied to any child object that is removed from the association.
es_es: Un estilo de cascada especial, <literal>delete-orphan</literal>, se aplica s&#x00f3;lo a asociaciones uno-a-muchos, e indica que la operaci&#x00f3;n <literal>delete()</literal> debe aplicarse a cualquier objeto hijo que sea quitado de la asociaci&#x00f3;n.

source: Recommendations:
es_es: Recomendaciones:

source: It doesn't usually make sense to enable cascade on a <literal>&lt;many-to-one&gt;</literal> or <literal>&lt;many-to-many&gt;</literal> association. Cascade is often useful for <literal>&lt;one-to-one&gt;</literal> and <literal>&lt;one-to-many&gt;</literal> associations.
es_es: Usualmente no tiene sentido habilitar el tratamiento en cascada a una asociaci&#x00f3;n <literal>&lt;many-to-one&gt;</literal> o <literal>&lt;many-to-many&gt;</literal>. El tratamiento en cascada es frecuentemente &#x00fa;til para las asociaciones <literal>&lt;one-to-one&gt;</literal> y <literal>&lt;one-to-many&gt;</literal>. associations.

source: If the child object's lifespan is bounded by the lifespan of the parent object, make it a <emphasis>life cycle object</emphasis> by specifying <literal>cascade="all,delete-orphan"</literal>.
es_es: Si la esperanza de vida de los objetos hijos est&#x00e1; ligada a la eesperanza de vida del objeto padre, h&#x00e1;zlo un <emphasis>objeto de ciclo de vida</emphasis> especificando <literal>cascade="all,delete-orphan"</literal>.

source: Otherwise, you might not need cascade at all. But if you think that you will often be working with the parent and children together in the same transaction, and you want to save yourself some typing, consider using <literal>cascade="persist,merge,save-update"</literal>.
es_es: En otro caso, puede que no necesites tratamiento en cascada en absoluto. Pero si piensas que estar&#x00e1;s trabajando frecuentemente con padre e hijos juntos en la misma transacci&#x00f3;n, y quieres ahorrarte algo de tipeo, considera usar <literal>cascade="persist,merge,save-update"</literal>.

source: Mapping an association (either a single valued association, or a collection) with <literal>cascade="all"</literal> marks the association as a <emphasis>parent/child</emphasis> style relationship where save/update/delete of the parent results in save/update/delete of the child or children.
es_es: Mapear una asociaci&#x00f3;n (ya sea una asociaci&#x00f3;n monovaluada, o una colecci&#x00f3;n) con <literal>cascade="all"</literal> marca la asociaci&#x00f3;n como una relaci&#x00f3;n del estilo <emphasis>padre/hijo</emphasis> donde save/update/delete en el padre resulta en save/update/delete del hijo o hijos.

source: Futhermore, a mere reference to a child from a persistent parent will result in save/update of the child. This metaphor is incomplete, however. A child which becomes unreferenced by its parent is <emphasis>not</emphasis> automatically deleted, except in the case of a <literal>&lt;one-to-many&gt;</literal> association mapped with <literal>cascade="delete-orphan"</literal>. The precise semantics of cascading operations for a parent/child relationship are as follows:
es_es: Adem&#x00e1;s, una mera referencia a un hijo desde un padre persistente resultar&#x00e1; en un save/update del hijo. Esta met&#x00e1;fora est&#x00e1; incompleta, sin embargo. Un hijo que deje de ser referenciado por su padre <emphasis>no</emphasis> es borrado autom&#x00e1;ticamente, excepto en el caso de una asociaci&#x00f3;n <literal>&lt;one-to-many&gt;</literal> mapeada con <literal>cascade="delete-orphan"</literal>. La sem&#x00e1;ntica precisa de las operaciones en cascada para una relaci&#x00f3;n padre/hijo es:

source: If a parent is passed to <literal>persist()</literal>, all children are passed to <literal>persist()</literal>
es_es: Si un padre le es pasado a <literal>persist()</literal>, todos los hijos le son pasados a <literal>persist()</literal>

source: If a parent is passed to <literal>merge()</literal>, all children are passed to <literal>merge()</literal>
es_es: Si un padre le es pasado a <literal>merge()</literal>, todos los hijos le son pasados a <literal>merge()</literal>

source: If a parent is passed to <literal>save()</literal>, <literal>update()</literal> or <literal>saveOrUpdate()</literal>, all children are passed to <literal>saveOrUpdate()</literal>
es_es: Si un padre le es pasado a <literal>save()</literal>, <literal>update()</literal> o <literal>saveOrUpdate()</literal>, todos los hijos le son pasados a <literal>saveOrUpdate()</literal>

source: If a transient or detached child becomes referenced by a persistent parent, it is passed to <literal>saveOrUpdate()</literal>
es_es: Si un hijo transitorio o separado se vuelve referenciado por un padre persistente, le es pasado a <literal>saveOrUpdate()</literal>

source: If a parent is deleted, all children are passed to <literal>delete()</literal>
es_es: Si un padre es borrado, todos los hijos le son pasados a <literal>delete()</literal>

source: If a child is dereferenced by a persistent parent, <emphasis>nothing special happens</emphasis> - the application should explicitly delete the child if necessary - unless <literal>cascade="delete-orphan"</literal>, in which case the "orphaned" child is deleted.
es_es: Si un hijo deja de ser referenciado por un padre persistente, <emphasis>no ocurre nada especial</emphasis> - la aplicaci&#x00f3;n debe borrar expl&#x00ed;citamente el hijo de ser necesario - a menos que <literal>cascade="delete-orphan"</literal>, en cuyo caso el hijo "hu&#x00e9;rfano" es borrado.

source: Finally, note that cascading of operations can be applied to an object graph at <emphasis>call time</emphasis> or at <emphasis>flush time</emphasis>. All operations, if enabled, are cascaded to associated entities reachable when the operation is executed. However, <literal>save-upate</literal> and <literal>delete-orphan</literal> are transitive for all associated entities reachable during flush of the <literal>Session</literal>.
es_es: UNTRANSLATED!!! Finally, note that cascading of operations can be applied to an object graph at <emphasis>call time</emphasis> or at <emphasis>flush time</emphasis>. All operations, if enabled, are cascaded to associated entities reachable when the operation is executed. However, <literal>save-upate</literal> and <literal>delete-orphan</literal> are transitive for all associated entities reachable during flush of the <literal>Session</literal>.

source: Using metadata
es_es: Usando metadatos

source: Hibernate requires a very rich meta-level model of all entity and value types. From time to time, this model is very useful to the application itself. For example, the application might use Hibernate's metadata to implement a "smart" deep-copy algorithm that understands which objects should be copied (eg. mutable value types) and which should not (eg. immutable value types and, possibly, associated entities).
es_es: Hibernate requiere de un modelo de meta-nivel muy rico de todas las entidades y tipos de valor. De vez en cuando, este modelo es muy &#x00fa;til para la aplicaci&#x00f3;n misma. Por ejemplo, la aplicaci&#x00f3;n podr&#x00ed;a usar los metadatos de Hibernate para implementar un algoritmo "inteligente" de copia en profundidad que entienda qu&#x00e9; objetos deben ser copiados (por ejemplo, tipo de valor mutables) y cu&#x00e1;les no (por ejemplo, tipos de valor inmutables y, posiblemente, entidades asociadas).

source: Hibernate exposes metadata via the <literal>ClassMetadata</literal> and <literal>CollectionMetadata</literal> interfaces and the <literal>Type</literal> hierarchy. Instances of the metadata interfaces may be obtained from the <literal>SessionFactory</literal>.
es_es: Hibernate expone los metadatos v&#x00ed;a las interfaces <literal>ClassMetadata</literal> y <literal>CollectionMetadata</literal> y la jerarqu&#x00ed;a <literal>Type</literal>. Las instancias de las interfaces de metadatos pueden obtenerse de <literal>SessionFactory</literal>.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
