Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: fr_fr, ja_jp

source: A <literal>Session</literal> begins when it is first needed, when the first call to <literal>getCurrentSession()</literal> is made. It is then bound by Hibernate to the current thread. When the transaction ends, either through commit or rollback, Hibernate automatically unbinds the <literal>Session</literal> from the thread and closes it for you. If you call <literal>getCurrentSession()</literal> again, you get a new <literal>Session</literal> and can start a new unit of work. This <emphasis>thread-bound</emphasis> programming model is the most popular way of using Hibernate, as it allows flexible layering of your code (transaction demarcation code can be separated from data access code, we'll do this later in this tutorial).
fr_fr: Une <literal>Session</literal> commence lorsqu'elle est vraiment utilisée la première fois, Lorsque nous appelons pour la première fois <literal>getCurrentSession()</literal>. Ensuite, elle est liée, par Hibernate, au thread courant. Lorsque la transaction s'achève (commit ou rollback), Hibernate délie la <literal>Session</literal> du thread et la ferme pour vous. Si vous invoquez <literal>getCurrentSession()</literal> une autre fois, vous obtenez une nouvelle <literal>Session</literal> et pouvez entamer une nouvelle unité de travail. Ce modèle de programmation "<emphasis>thread-bound</emphasis>" est le moyen le plus populaire d'utiliser Hibernate.
ja_jp: <literal>Session</literal> は最初に必要となったとき、つまり最初に <literal>getCurrentSession()</literal> が 呼ばれたときに開始します。 そのときHibernateにより現在のスレッドに結び付けられます。 トランザクションが終了（コミットもしくはロールバック）したとき、 Hibernateもスレッドから <literal>Session</literal> を切り離し、クローズします。 再び <literal>getCurrentSession()</literal> を呼ぶと、 新しい <literal>Session</literal> を取得して新しい作業単位をスタートできます。 この <emphasis>thread-bound</emphasis> プログラミング・モデルはHibernateを利用する上で最も人気があります。

source: Related to the unit of work scope, should the Hibernate <literal>Session</literal> be used to execute one or several database operations? The above example uses one <literal>Session</literal> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope of a Hibernate <literal>Session</literal> is flexible but you should never design your application to use a new Hibernate <literal>Session</literal> for <emphasis>every</emphasis> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real (web) application is shown later in this tutorial.
fr_fr: UNTRANSLATED ! Related to the unit of work scope, should the Hibernate <literal>Session</literal> be used to execute one or several database operations? The above example uses one <literal>Session</literal> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope of a Hibernate <literal>Session</literal> is flexible but you should never design your application to use a new Hibernate <literal>Session</literal> for <emphasis>every</emphasis> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real (web) application is shown later in this tutorial.

source: Have a look at <xref linkend="transactions"/> for more information about transaction handling and demarcation. We also skipped any error handling and rollback in the previous example.
fr_fr: Lisez <xref linkend="transactions"/> pour plus d'informations sur la gestion des transactions et leur démarcations. Nous n'avons pas géré les erreurs et rollback sur l'exemple précédent.
ja_jp: トランザクションの扱いと境界の詳しい情報については、 <xref linkend="transactions"/> を見てください。 この例ではエラー処理やロールバックも割愛します。

source: To run this first routine we have to add a callable target to the Ant build file:
fr_fr: Pour lancer cette première routine, nous devons ajouter une cible appelable dans le fichier de construction de Ant :
ja_jp: この最初のルーチンを実行するには、Antのビルドファイルに呼び出し可能なターゲットを 追加しなければなりません：

source: The value of the <literal>action</literal> argument is set on the command line when calling the target:
fr_fr: La valeur de l'argument <literal>action</literal> correspond à la ligne de commande qui appelle la cible :
ja_jp: <literal>action</literal> 引数の値は、ターゲットを呼ぶときにコマンドラインで設定します：

source: You should see, after compilation, Hibernate starting up and, depending on your configuration, lots of log output. At the end you will find the following line:
fr_fr: Vous devriez voir, après la compilation, Hibernate démarrer et, en fonction de votre configuration, beaucoup de traces sur la sortie. À la fin vous trouverez la ligne suivante :
ja_jp: コンパイルすると、Hibernateがスタートし、あなたの設定によりますが、 多くのログ出力があるはずです。 その最後には以下の行があるでしょう：

source: This is the <literal>INSERT</literal> executed by Hibernate, the question marks represent JDBC bind parameters. To see the values bound as arguments, or to reduce the verbosity of the log, check your <literal>log4j.properties</literal>.
fr_fr: C'est l'<literal>INSERT</literal> exécuté par Hibernate, les points d'interrogation représentent les paramètres JDBC liés. Pour voir les valeurs liées aux arguments, ou pour réduire la verbosité des traces, vérifier votre <literal>log4j.properties</literal>.
ja_jp: これはHibernateが実行する <literal>INSERT</literal> で、 クエスチョンマークはJDBCバインドパラメータを表しています。 引数としてバインドされる値を見るため、あるいはログの冗長性を減らすためには、 <literal>log4j.properties</literal> をチェックしてください。

source: Now we'd like to list stored events as well, so we add an option to the main method:
fr_fr: Maintenant nous aimerions aussi lister les événements stockés, donc nous ajoutons une option à la méthode principale :
ja_jp: それでは同じように格納されたイベントの一覧を見ようと思います。 そのためメインメソッドにオプションを追加します：

source: We also add a new <literal>listEvents() method</literal>:
fr_fr: Nous ajoutons aussi une nouvelle méthode <literal>listEvents()</literal> :
ja_jp: 新しい <literal>listEvents()メソッド</literal> も追加します。

source: What we do here is use an HQL (Hibernate Query Language) query to load all existing <literal>Event</literal> objects from the database. Hibernate will generate the appropriate SQL, send it to the database and populate <literal>Event</literal> objects with the data. You can create more complex queries with HQL, of course.
fr_fr: Ce que nous faisons ici c'est utiliser une requête HQL (Hibernate Query Language) pour charger tous les objets <literal>Event</literal> existants de la base de données. Hibernate générera le SQL approprié, l'enverra à la base de données et peuplera des objets <literal>Event</literal> avec les données. Vous pouvez créer des requêtes plus complexes avec HQL, bien sûr.
ja_jp: ここですることは、データベースから存在するすべての <literal>Event</literal> オブジェクトをロードするHQL (Hibernate Query Language) クエリを使うことです。 Hibernateは適切なSQLを生成し、それをデータベースに送り、 そのデータを使って <literal>Event</literal> オブジェクトを生成します。 当然HQLでさらに複雑なクエリを作成できます。

source: Now, to execute and test all of this, follow these steps:
fr_fr: Maintenant, pour exécuter et tester tout ça, suivez ces étapes :
ja_jp: 以下のステップで、すべての実行とテストを行います。

source: Run <literal>ant run -Daction=store</literal> to store something into the database and, of course, to generate the database schema before through hbm2ddl.
fr_fr: Exécutez <literal>ant run -Daction=store</literal> pour stocker quelque chose dans la base de données et, bien sûr, pour générer, avant, le schéma de la base de données grâce à hbm2ddl.
ja_jp: hbm2ddlを通す前にデータベースのデータを作成し、データベーススキーマを生成するために、 <literal>ant run -Daction=store</literal> を実行してください。

source: Now disable hbm2ddl by commenting out the property in your <literal>hibernate.cfg.xml</literal> file. Usually you only leave it turned on in continous unit testing, but another run of hbm2ddl would <emphasis>drop</emphasis> everything you have stored - the <literal>create</literal> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory is build".
fr_fr: Maintenant désactivez hbm2ddl en commentant la propriété dans votre fichier <literal>hibernate.cfg.xml</literal>. Généralement vous la laissez seulement activée dans des tests unitaires en continu, mais une autre exécution de hbm2ddl <emphasis>effacerait</emphasis> tout ce que vous avez stocké - le paramètre de configuration <literal>create</literal> se traduit en fait par "supprimer toutes les tables du schéma, puis re-créer toutes les tables, lorsque la SessionFactory est construite".
ja_jp: 今は <literal>hibernate.cfg.xml</literal> ファイルのプロパティをコメントアウトしてhbm2ddlを無効にしてください。 通常は継続的に単体テストをしている間はhbm2ddlを有効にしておくのですが、 それ以外の場合にhbm2ddlを起動すると格納しておいた全てのデータを <emphasis>ドロップ</emphasis> するでしょう。 設定を <literal>create</literal> にすると、結果として 「SessionFactory生成の際、スキーマから全てのテーブルをドロップして再作成する」という設定になります。

source: If you now call Ant with <literal>-Daction=list</literal>, you should see the events you have stored so far. You can of course also call the <literal>store</literal> action a few times more.
fr_fr: Si maintenant vous appelez Ant avec <literal>-Daction=list</literal>, vous devriez voir les événements que vous avez stockés jusque là. Vous pouvez bien sûr aussi appeler l'action <literal>store</literal> plusieurs fois.
ja_jp: 今 <literal>-Daction=list</literal> と指定してAntを呼ぶと、 これまで格納したイベントが見えるはずです。 <literal>store</literal> アクションを数回以上呼ぶことも可能です。

source: Note: Most new Hibernate users fail at this point and we see questions about <emphasis>Table not found</emphasis> error messages regularly. However, if you follow the steps outlined above you will not have this problem, as hbm2ddl creates the database schema on the first run, and subsequent application restarts will use this schema. If you change the mapping and/or database schema, you have to re-enable hbm2ddl once again.
fr_fr: UNTRANSLATED! Note: Most new Hibernate users fail at this point and we see questions about <emphasis>Table not found</emphasis> error messages regularly. However, if you follow the steps outlined above you will not have this problem, as hbm2ddl creates the database schema on the first run, and subsequent application restarts will use this schema. If you change the mapping and/or database schema, you have to re-enable hbm2ddl once again.
ja_jp: 注意：初めてHibernateに触れる人々の多くがここで失敗するため、<emphasis>Table not found</emphasis> エラーメッセージに 関する質問を定期的に見かけます。 しかし上記のステップに従えば、hbm2ddlが最初に実行されたときにデータベーススキーマを作成し、 その後の実行においてもこのスキーマを使用するので、問題は起こらないでしょう。 マッピングやデータベーススキーマを変更したときは、もう一度hbm2ddlを有効にしてください。

source: Part 2 - Mapping associations
fr_fr: Partie 2 - Mapper des associations
ja_jp: パート2 - 関連のマッピング

source: We mapped a persistent entity class to a table. Let's build on this and add some class associations. First we'll add people to our application, and store a list of events they participate in.
fr_fr: Nous avons mappé une classe d'une entité persistante vers une table. Partons de là et ajoutons quelques associations de classe. D'abord nous ajouterons des gens à notre application, et stockerons une liste d'événements auxquels ils participent.
ja_jp: 永続エンティティクラスをテーブルにマッピングしました。 さらにこの上にいくつかのクラスの関連を追加しましょう。 まず初めにアプリケーションに人々を追加し、彼らが参加するイベントのリストを格納します。

source: Mapping the Person class
fr_fr: Mapper la classe Person
ja_jp: Personクラスのマッピング

source: The first cut of the <literal>Person</literal> class is simple:
fr_fr: La première version de la classe <literal>Person</literal> est simple :
ja_jp: 最初の <literal>Person</literal> クラスは単純です：

source: Create a new mapping file called <literal>Person.hbm.xml</literal> (don't forget the DTD reference at the top):
fr_fr: Créez un nouveau fichier de mapping appelé <literal>Person.hbm.xml</literal> (n'oubliez pas la référence à la DTD)
ja_jp: <literal>Person.hbm.xml</literal> という新しいマッピングファイルを作成してください （ファイルの最初にDTDへの参照を忘れずに入れてください）：

source: Finally, add the new mapping to Hibernate's configuration:
fr_fr: Finalement, ajoutez la nouveau mapping à la configuration d'Hibernate :
ja_jp: 最後にHibernateの設定に新しいマッピングを追加してください：

source: We'll now create an association between these two entities. Obviously, persons can participate in events, and events have participants. The design questions we have to deal with are: directionality, multiplicity, and collection behavior.
fr_fr: Nous allons maintenant créer une association entre ces deux entités. Évidemment, des personnes peuvent participer aux événements, et des événements ont des participants. Les questions de conception que nous devons traiter sont : direction, cardinalité et comportement de la collection.
ja_jp: それではこれら2つのエンティティ間の関連を作成します。 人々がイベントに参加でき、イベントが参加者を持つのは明らかです。 扱わなければならない設計の問題は、方向、多重度、コレクションの振る舞いです。

source: A unidirectional Set-based association
fr_fr: Une association unidirectionnelle basée sur Set
ja_jp: 単方向Setベース関連

source: We'll add a collection of events to the <literal>Person</literal> class. That way we can easily navigate to the events for a particular person, without executing an explicit query - by calling <literal>aPerson.getEvents()</literal>. We use a Java collection, a <literal>Set</literal>, because the collection will not contain duplicate elements and the ordering is not relevant for us.
fr_fr: Nous allons ajouter une collection d'événements à la classe <literal>Person</literal>. De cette manière nous pouvons facilement naviguer dans les événements d'une personne particulière, sans exécuter une requête explicite - en appelant <literal>aPerson.getEvents()</literal>. Nous utilisons une collection Java, un <literal>Set</literal>, parce que la collection ne contiendra pas d'éléments dupliqués et l'ordre ne nous importe pas.
ja_jp: イベントのコレクションを <literal>Person</literal> クラスに追加します。 こうしておくと、明示的なクエリ、つまりわざわざ<literal>aPerson.getEvents()</literal>を呼び出さずに、 特定の人に紐付くイベントを簡単にナビゲートすることができます。 私たちはJavaのコレクション、<literal>Set</literal> を使います。 コレクションは重複要素を持たないし、順番は私たちには意味がないからです。

source: We need a unidirectional, many-valued associations, implemented with a <literal>Set</literal>. Let's write the code for this in the Java classes and then map it:
fr_fr: Nous avons besoin d'une association unidirectionnelle, pluri-valuée, implémentée avec un <literal>Set</literal>. Écrivons le code pour ça dans les classes Java et mappons les :
ja_jp: <literal>Set</literal> で実装される単方向、多値関連が必要です。 Javaクラス内に対応するコードを書いてマッピングしましょう：

source: Before we map this association, think about the other side. Clearly, we could just keep this unidirectional. Or, we could create another collection on the <literal>Event</literal>, if we want to be able to navigate it bi-directional, i.e. <literal>anEvent.getParticipants()</literal>. This is not necessary, from a functional perspective. You could always execute an explicit query to retrieve the participants for a particular event. This is a design choice left to you, but what is clear from this discussion is the multiplicity of the association: "many" valued on both sides, we call this a <emphasis>many-to-many</emphasis> association. Hence, we use Hibernate's many-to-many mapping:
fr_fr: D'abord nous mappons cette association, mais pensez à l'autre côté. Clairement, nous pouvons la laisser unidirectionnelle. Ou alors, nous pourrions créer une autre collection sur <literal>Event</literal>, si nous voulons être capable de la parcourir de manière bidirectionnelle, c'est-à-dire avoir <literal>anEvent.getParticipants()</literal>. Ce n'est pas nécessaire d'un point de vue fonctionnel. Vous pourrez toujours exécuter une requête explicite pour récupérer les participants d'un "event" particulier. Ce choix de conception vous est laissé, mais ce qui reste certains est la cardinalité de l'association: "plusieurs" des deux côtés, nous appelons cela une association <emphasis>many-to-many</emphasis>. Par conséquent nous utilisons un mapping Hibernate many-to-many:
ja_jp: この関連をマッピングする前に、反対側について考えてください。 明らかなことですが、今はこれを単方向にしただけです。 逆に、 <literal>Event</literal> 側にも別のコレクションを作ることもできます。 例えば <literal>anEvent.getParticipants()</literal> のように、 双方向にナビゲートしたければ、そうすることもできます。 これは機能的にみて必要ではありません。 特定のイベントに関係するデータを取得する明確なクエリを、いつでも実行することが出来ました。 この設計の選択は開発者に任されていて、この議論により明らかなのは関連の多重度です。 つまり両側を「多」値にする、 <emphasis>多対多</emphasis> と呼ばれる関連です。 そのためHibernateのmany-to-manyマッピングを使います：

source: Hibernate supports all kinds of collection mappings, a <literal>&lt;set&gt;</literal> being most common. For a many-to-many association (or <emphasis>n:m</emphasis> entity relationship), an association table is needed. Each row in this table represents a link between a person and an event. The table name is configured with the <literal>table</literal> attribute of the <literal>set</literal> element. The identifier column name in the association, for the person's side, is defined with the <literal>&lt;key&gt;</literal> element, the column name for the event's side with the <literal>column</literal> attribute of the <literal>&lt;many-to-many&gt;</literal>. You also have to tell Hibernate the class of the objects in your collection (correct: the class on the other side of the collection of references).
fr_fr: Hibernate supporte toutes sortes de mapping de collection, un <literal>&lt;set&gt;</literal> étant le plus commun. Pour une association many-to-many (ou une relation d'entité <emphasis>n:m</emphasis>), une table d'association est requise. Chaque ligne dans cette table représente un lien entre une personne et un événement. Le nom de la table est configuré avec l'attribut <literal>table</literal> de l'élément <literal>set</literal>. Le nom de la colonne identifiant dans l'association, du côté de la personne, est défini avec l'élément <literal>&lt;key&gt;</literal>, et le nom de la colonne pour l'événement dans l'attribut <literal>column</literal> de <literal>&lt;many-to-many&gt;</literal>. Vous devez aussi donner à Hibernate la classe des objets de votre collection (c'est-à-dire : la classe de l'autre côté de la collection).
ja_jp: Hibernateはありとあらゆる種類のコレクションマッピングをサポートしていますが、 最も一般的なものが <literal>&lt;set&gt;</literal> です。 多対多関連（または <emphasis>n:m</emphasis> エンティティリレーションシップ）には、 関連テーブルが必要です。 このテーブルのそれぞれの行は、人とイベント間のリンクを表現します。 テーブル名は <literal>set</literal> 要素の <literal>table</literal> 属性で設定します。 人側の関連の識別子カラム名は <literal>&lt;key&gt;</literal> 要素で、 イベント側のカラム名は <literal>&lt;many-to-many&gt;</literal> の <literal>column</literal> 属性で定義します。 Hibernateにコレクションのオブジェクトのクラス （正確には、参照のコレクションの反対側のクラス）を教えなければなりません。

source: The database schema for this mapping is therefore:
fr_fr: Le schéma de base de données pour ce mapping est donc :
ja_jp: そのためこのマッピングのデータベーススキーマは以下のようになります。：

source: Working the association
fr_fr: Travailler avec l'association
ja_jp: 関連を働かせる

source: Let's bring some people and events together in a new method in <literal>EventManager</literal>:
fr_fr: Réunissons quelques personnes et quelques événements dans une nouvelle méthode dans <literal>EventManager</literal> :
ja_jp: <literal>EventManager</literal> の新しいメソッドで人々とイベントを一緒にしましょう：

source: After loading a <literal>Person</literal> and an <literal>Event</literal>, simply modify the collection using the normal collection methods. As you can see, there is no explicit call to <literal>update()</literal> or <literal>save()</literal>, Hibernate automatically detects that the collection has been modified and needs to be updated. This is called <emphasis>automatic dirty checking</emphasis>, and you can also try it by modifying the name or the date property of any of your objects. As long as they are in <emphasis>persistent</emphasis> state, that is, bound to a particular Hibernate <literal>Session</literal> (i.e. they have been just loaded or saved in a unit of work), Hibernate monitors any changes and executes SQL in a write-behind fashion. The process of synchronizing the memory state with the database, usually only at the end of a unit of work, is called <emphasis>flushing</emphasis>. In our code, the unit of work ends with a commit (or rollback) of the database transaction - as defined by the <literal>thread</literal> configuration option for the <literal>CurrentSessionContext</literal> class.
fr_fr: Après le chargement d'une <literal>Person</literal> et d'un <literal>Event</literal>, modifiez simplement la collection en utilisant les méthodes normales de la collection. Comme vous pouvez le voir, il n'y a pas d'appel explicite à <literal>update()</literal> ou <literal>save()</literal>, Hibernate détecte automatiquement que la collection a été modifiée et a besoin d'être mise à jour. Ceci est appelé <emphasis>la vérification sale automatique</emphasis> (NdT : "automatic dirty checking"), et vous pouvez aussi l'essayer en modifiant le nom ou la propriété date de n'importe lequel de vos objets. Tant qu'ils sont dans un état <emphasis>persistant</emphasis>, c'est-à-dire, liés à une <literal>Session</literal> Hibernate particulière (c-à-d qu'ils ont juste été chargés ou sauvegardés dans une unité de travail), Hibernate surveille les changements et exécute le SQL correspondant. Le processus de synchronisation de l'état de la mémoire avec la base de données, généralement seulement à la fin d'une unité de travail, est appelé <emphasis>flushing</emphasis>. Dans notre code, l'unité de travail s'achève par un commit (ou rollback) de la transaction avec la base de données - comme défini par notre option <literal>thread</literal> de configuration pour la classe <literal>CurrentSessionContext</literal>.
ja_jp: <literal>Person</literal> と <literal>Event</literal> をロードした後、 普通のコレクションメソッドを使って単純にそのコレクションを修正してください。 ご覧のとおり <literal>update()</literal> や <literal>save()</literal> の明示的な呼び出しはありません。 Hibernateは、修正されたことにより更新する必要のあるコレクションを自動的に検知します。 これは <emphasis>自動ダーティチェック</emphasis> と呼ばれ、 オブジェクトの名前やdateプロパティを修正することで試すことも可能です。 それらが <emphasis>永続</emphasis> 状態にある限り、 つまり特定のHibernate <literal>Session</literal> にバインドされている限り （例えば作業単位(Unit of Work)の中で単にロードまたはセーブされた）、 Hibernateはどんな変更もモニターし、遅延書き込み(write-behind)でSQLを実行します。 通常、作業単位(Unit of Work)の最後にだけ行われるデータベースとメモリの状態を同期させる処理は、 <emphasis>フラッシュ</emphasis> と呼ばれます。 このコードでは、作業単位(Unit of Work)はデータベーストランザクションのコミット（もしくはロールバック）で終了します。 これは、 <literal>CurrentSessionContext</literal> クラスに対して <literal>thread</literal> を設定したためです。

source: You might of course load person and event in different units of work. Or you modify an object outside of a <literal>Session</literal>, when it is not in persistent state (if it was persistent before, we call this state <emphasis>detached</emphasis>). You can even modify a collection when it is detached:
fr_fr: Vous pourriez bien sûr charger une personne et un événement dans différentes unités de travail. Ou vous modifiez un objet à l'extérieur d'une <literal>Session</literal>, s'il n'est pas dans un état persistant (s'il était persistant avant, nous appelons cet état <emphasis>détaché</emphasis>). Vous pouvez même modifier une collection lorsqu'elle est détachée:
ja_jp: 異なる作業単位(Unit of Work)で人々とイベントをロードすることも当然できます。 そうでなければ、永続状態にないとき（以前に永続であったなら、この状態を <emphasis>分離（detached）</emphasis> と呼びます）、 <literal>Session</literal> の外部でオブジェクトを修正します。 分離されるときにはコレクションを変更することも可能です：

source: The call to <literal>update</literal> makes a detached object persistent again, you could say it binds it to a new unit of work, so any modifications you made to it while detached can be saved to the database. This includes any modifications (additions/deletions) you made to a collection of that entity object.
fr_fr: L'appel à <literal>update</literal> rend un objet détaché à nouveau persistant, vous pourriez dire qu'il le lie à une unité de travail, ainsi toutes les modifications (ajout, suppression) que vous avez faites pendant qu'il était détaché peuvent être sauvegardées dans la base de données (il se peut que vous ayez besoin de modifier quelques unes des méthodes précédentes pour retourner cet identifiant).
ja_jp: <literal>update</literal> の呼び出しは分離オブジェクトを再び永続化します。 これは、新しい作業単位(Unit of Work)にバインドすると言えるでしょう。 そのため分離の間に加えられたどのような修正もデータベースにセーブできます。 エンティティオブジェクトのコレクションへの修正（追加･削除）も同様にセーブできます。
