Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: fr_fr, ja_jp

source: Introduction to Hibernate
fr_fr: Introduction à Hibernate
ja_jp: Hibernateの導入

source: Preface
fr_fr: Préface
ja_jp: 前書き

source: This chapter is an introductory tutorial for new users of Hibernate. We start with a simple command line application using an in-memory database and develop it in easy to understand steps.
fr_fr: Ce chapitre est un didacticiel introductif destiné aux nouveaux utilisateurs d'Hibernate. Nous commençons avec une simple application en ligne de commande utilisant une base de données en mémoire, et la développons en étapes faciles à comprendre.
ja_jp: この章はHibernateを初めて使うユーザ向けの入門的なチュートリアルです。 インメモリデータベースを使う簡単なコマンドラインアプリケーションから始め、 一歩一歩わかりやすいやり方で開発を進めます。

source: This tutorial is intended for new users of Hibernate but requires Java and SQL knowledge. It is based on a tutorial by Michael Gloegl, the third-party libraries we name are for JDK 1.4 and 5.0. You might need others for JDK 1.3.
fr_fr: Ce didacticiel est destiné aux nouveaux utilisateurs d'Hibernate mais requiert des connaissances Java et SQL. Il est basé sur un didacticiel de Michael Gloegl, les bibliothèques tierces que nous nommons sont pour les JDK 1.4 et 5.0. Vous pourriez avoir besoin d'autres bibliothèques pour le JDK 1.3.
ja_jp: このチュートリアルはHibernateを初めて使うユーザを想定していますが、 理解するにはJavaとSQLについての知識が必要です。 これはMichael Gloeglの手によるチュートリアルを下敷きにしていますが、 ここでサードパーティライブラリと言っているのは、JDK 1.4と5.0用のものです。 JDK 1.3を利用するのであれば他のライブラリが必要かもしれません。

source: The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
fr_fr: Le code source de ce tutoriel est inclus dans la distribution dans le répertoire <literal>doc/reference/tutorial/</literal>.
ja_jp: チュートリアルのソースコードはHibernateディストリビューションの <literal>doc/reference/tutorial/</literal> にあります。

source: Part 1 - The first Hibernate Application
fr_fr: Partie 1 - Première application Hibernate
ja_jp: パート1 - 初めてのHibernateアプリケーション

source: First, we'll create a simple console-based Hibernate application. We use an Java database (HSQL DB), so we do not have to install any database server.
fr_fr: D'abord, nous créerons une simple application Hibernate en console. Nous utilisons une base de données en mémoire (HSQL DB), donc nous n'avons pas à installer de serveur de base de données.
ja_jp: 最初にコンソールベースの簡単なHibernateアプリケーションを作成します。 Javaデータベース（HSQL DB）を利用するので、 データベースサーバをインストールする必要はありません。

source: Let's assume we need a small database application that can store events we want to attend, and information about the hosts of these events.
fr_fr: Supposons que nous ayons besoin d'une petite application de base de données qui puisse stocker des événements que nous voulons suivre, et des informations à propos des hôtes de ces événements.
ja_jp: 仮に小さなデータベースアプリケーションが必要だとしましょう。 そのアプリケーションには出席したいイベントと、 そのイベントのホストについての情報を格納するものとします。

source: The first thing we do, is set up our development directory and put all the Java libraries we need into it. Download the Hibernate distribution from the Hibernate website. Extract the package and place all required libraries found in <literal>/lib</literal> into into the <literal>/lib</literal> directory of your new development working directory. It should look like this:
fr_fr: La première chose que nous faisons est de configurer notre répertoire de développement et de mettre toutes les bibliothèques dont nous avons besoin dedans. Téléchargez la distribution Hibernate à partir du site web d'Hibernate. Extrayez le paquet et placez toutes les bibliothèques requises trouvées dans <literal>/lib</literal> dans le répertoire <literal>/lib</literal> de votre nouveau répertoire de travail. Il devrait ressembler à ça :
ja_jp: まず最初にすることは開発用のディレクトリをセットアップして、 必要となるすべてのJavaライブラリを配置することです。 HibernateウェブサイトからHibernateディストリビューションをダウンロードしてください。 ファイルを解凍して <literal>/lib</literal> にある必要なライブラリのすべてを、 新しい開発用ディレクトリの <literal>/lib</literal> ディレクトリに配置してください。 このようになっているはずです：

source: This is the minimum set of required libraries (note that we also copied hibernate3.jar, the main archive) for Hibernate <emphasis>at the time of writing</emphasis>. The Hibernate release you are using might require more or less libraries. See the <literal>README.txt</literal> file in the <literal>lib/</literal> directory of the Hibernate distribution for more information about required and optional third-party libraries. (Actually, Log4j is not required but preferred by many developers.)
fr_fr: Ceci est l'ensemble minimum de bibliothèques requises (notez que nous avons aussi copié hibernate3.jar, l'archive principale) pour Hibernate. Lisez le fichier <literal>README.txt</literal> dans le répertoire <literal>lib/</literal> de la distribution Hibernate pour plus d'informations à propos des biliothèques tierces requises et optionnelles. (En fait, log4j n'est pas requis mais préféré par beaucoup de développeurs.)
ja_jp: これが <emphasis>本ドキュメント執筆時点での</emphasis> Hibernateの必要最低限のライブラリです （メインアーカイブのhibernate3.jarもコピーしていることに注意してください）。 Hibernateのバージョンによってはさらに必要なライブラリや、不要なライブラリがあるかもしれません。 Hibernateディストリビューションの <literal>lib/</literal> ディレクトリにある <literal>README.txt</literal> ファイルを見てください。 必須またはオプションのサードパーティライブラリについての情報を載せています （実際Log4jは必須ではありませんが、多くの開発者が好んでいます）。

source: Next we create a class that represents the event we want to store in database.
fr_fr: Ensuite, nous créons une classe qui réprésente l'événement que nous voulons stocker dans notre base de données.
ja_jp: 次にデータベースに格納するイベントを表すクラスを作成します。

source: The first class
fr_fr: La première classe
ja_jp: 最初のクラス

source: Our first persistent class is a simple JavaBean class with some properties:
fr_fr: Notre première classe persistante est une simple classe JavaBean avec quelques propriétés :
ja_jp: 最初の永続クラスは、プロパティをいくつか持つシンプルなJavaBeanです：

source: You can see that this class uses standard JavaBean naming conventions for property getter and setter methods, as well as private visibility for the fields. This is a recommended design - but not required. Hibernate can also access fields directly, the benefit of accessor methods is robustness for refactoring. The no-argument constructor is required to instantiate an object of this class through reflection.
fr_fr: Vous pouvez voir que cette classe utilise les conventions de nommage standard JavaBean pour les méthodes getter/setter des propriétés, ainsi qu'une visibilité privée pour les champs. Ceci est la conception recommandée - mais pas obligatoire. Hibernate peut aussi accéder aux champs directement, le bénéfice des méthodes d'accès est la robustesse pour la refonte de code. Le constructeur sans argument est requis pour instancier un objet de cette classe via reflexion.
ja_jp: ご覧のとおり、このクラスはフィールドがprivateの可視性を持っているのと同時に、 JavaBean標準のゲッター、セッターメソッドの命名規約に従っています。 このような設計は推奨されていますが必須ではありません。 アクセサメソッドを設けるのはリファクタリングを考えた頑健性のためで、 Hibernateはフィールドに直接アクセスすることも可能です。 引数のないコンストラクタは、リフレクションでこのクラスのインスタンスを作成するために 必要です。

source: The <literal>id</literal> property holds a unique identifier value for a particular event. All persistent entity classes (there are less important dependent classes as well) will need such an identifier property if we want to use the full feature set of Hibernate. In fact, most applications (esp. web applications) need to distinguish objects by identifier, so you should consider this a feature rather than a limitation. However, we usually don't manipulate the identity of an object, hence the setter method should be private. Only Hibernate will assign identifiers when an object is saved. You can see that Hibernate can access public, private, and protected accessor methods, as well as (public, private, protected) fields directly. The choice is up to you and you can match it to fit your application design.
fr_fr: La propriété <literal>id</literal> contient la valeur d'un identifiant unique pour un événement particulier. Toutes les classes d'entités persistantes (ainsi que les classes dépendantes de moindre importance) auront besoin d'une telle propriété identifiante si nous voulons utiliser l'ensemble complet des fonctionnalités d'Hibernate. En fait, la plupart des applications (surtout les applications web) ont besoin de distinguer des objets par des identifiants, donc vous devriez considérer ça comme une fonctionnalité plutôt que comme une limitation. Cependant, nous ne manipulons généralement pas l'identité d'un objet, dorénavant la méthode setter devrait être privée. Seul Hibernate assignera les identifiants lorsqu'un objet est sauvegardé. Vous pouvez voir qu'Hibernate peut accéder aux méthodes publiques, privées et protégées, ainsi qu'aux champs (publics, privés, protégés) directement. Le choix vous est laissé, et vous pouvez l'ajuster à la conception de votre application.
ja_jp: <literal>id</literal> プロパティは、ある特定のイベントに対するユニークな識別子の値を保持します。 Hibernateの完全な機能を使いたければ、すべての永続エンティティクラス （それほど重要ではない依存クラスというものもあります） にこのような識別子プロパティが必要になります。 事実上ほとんどのアプリケーション（特にwebアプリケーション）では、 識別子でオブジェクトを区別する必要があるため、これは制限というよりも特徴であると考えるべきです。 しかし通常オブジェクトのIDを操作するようなことはしません。 そのためセッターメソッドはprivateにするべきです。 Hibernateだけがオブジェクトがセーブされたときに識別子へ値を代入します。 Hibernateが（public, private, protected）フィールドに直接アクセスできるのと同様に、 public, private, protectedのアクセサメソッドにアクセスできるということがわかるでしょう。 選択はあなたに任されているので、あなたのアプリケーションの設計に合わせることができます。

source: The no-argument constructor is a requirement for all persistent classes; Hibernate has to create objects for you, using Java Reflection. The constructor can be private, however, package visibility is required for runtime proxy generation and efficient data retrieval without bytecode instrumentation.
fr_fr: Le constructeur sans argument est requis pour toutes les classes persistantes ; Hibernate doit créer des objets pour vous en utilisant la réflexion Java. Le constructeur peut être privé, cependant, la visibilité du paquet est requise pour la génération de proxy à l'exécution et une récupération des données efficaces sans instrumentation du bytecode.
ja_jp: 引数のないコンストラクタはすべての永続クラスに必須です。 これはHibernateがJavaのリフレクションを使って、オブジェクトを作成しなければならないためです。 コンストラクタをprivateにすることは可能ですが、 実行時のプロキシ生成と、バイトコード操作なしの効率的なデータの抽出には、 package可視性が必要です。

source: Place this Java source file in a directory called <literal>src</literal> in the development folder, and in its correct package. The directory should now look like this:
fr_fr: Placez ce fichier source Java dans un répertoire appelé <literal>src</literal> dans le dossier de développement. Ce répertoire devrait maintenant ressembler à ça :
ja_jp: 開発フォルダの <literal>src</literal> というディレクトリの適切なパッケージに、 このJavaソースファイルを配置してください。 この時点でディレクトリは以下のようになっているはずです：

source: In the next step, we tell Hibernate about this persistent class.
fr_fr: Dans la prochaine étape, nous informons Hibernate de cette classe persistante.
ja_jp: 次のステップでは、Hibernateにこの永続クラスの情報を教えます。

source: The mapping file
fr_fr: Le fichier de mapping
ja_jp: マッピングファイル

source: Hibernate needs to know how to load and store objects of the persistent class. This is where the Hibernate mapping file comes into play. The mapping file tells Hibernate what table in the database it has to access, and what columns in that table it should use.
fr_fr: Hibernate a besoin de savoir comment charger et stocker des objets d'une classe persistante. C'est là qu'intervient le fichier de mapping Hibernate. Le fichier de mapping indique à Hibernate à quelle table dans la base de données il doit accéder, et quelles colonnes de cette table il devra utiliser.
ja_jp: Hibernateは、どのように永続クラスのオブジェクトをロードし格納すればよいかを知る必要があります。 ここでHibernateマッピングファイルが登場します。 マッピングファイルは、データベース内のどのテーブルにアクセスしなければならないか、 そのテーブルのどのカラムを使うべきかを、Hibernateに教えます。

source: The basic structure of a mapping file looks like this:
fr_fr: La structure basique de ce fichier de mapping ressemble à ça :
ja_jp: マッピングファイルの基本的な構造はこのようになります：

source: Note that the Hibernate DTD is very sophisticated. You can use it for auto-completion of XML mapping elements and attributes in your editor or IDE. You also should open up the DTD file in your text editor - it's the easiest way to get an overview of all elements and attributes and to see the defaults, as well as some comments. Note that Hibernate will not load the DTD file from the web, but first look it up from the classpath of the application. The DTD file is included in <literal>hibernate3.jar</literal> as well as in the <literal>src/</literal> directory of the Hibernate distribution.
fr_fr: Notez que la DTD Hibernate est très sophistiquée. Vous pouvez l'utiliser pour l'auto-complétement des éléments et des attributs de mapping XML dans votre éditeur ou votre IDE. Vous devriez aussi ouvrir le fichier DTD dans votre éditeur de texte - c'est le moyen le plus facile d'obtenir une vue d'ensemble de tous les éléments et attributs, et de voir les valeurs par défaut, ainsi que quelques commentaires. Notez qu'Hibernate ne chargera pas le fichier DTD à partir du web, mais regardera d'abord dans le classpath de l'application. Le fichier DTD est inclus dans <literal>hibernate3.jar</literal> ainsi que dans le répertoire <literal>src</literal> de la distribution Hibernate.
ja_jp: Hibernate DTDが非常に洗練されていることに注目してください。 このDTDは、エディタやIDEでのXMLマッピング要素と属性のオートコンプリーション機能に利用できます。 またDTDファイルをテキストエディタで開けてみてください。 というのも、すべての要素と属性を概観し、 コメントやデフォルトの値を見るには一番簡単な方法だからです。 Hibernateは、webからDTDファイルをロードせずに、 まずアプリケーションのクラスパスからこれを探し出そうとすることに注意してください。 DTDファイルはHibernateディストリビューションの <literal>src/</literal> ディレクトリと同様、<literal>hibernate3.jar</literal> にも含まれています。

source: We will omit the DTD declaration in future examples to shorten the code. It is of course not optional.
fr_fr: Nous omettrons la déclaration de la DTD dans les exemples futurs pour raccourcir le code. Bien sûr il n'est pas optionnel.
ja_jp: 以降の例ではコードを短くするためにDTD宣言を省略します。 当然ですがこれはオプションではありません。

source: Between the two <literal>hibernate-mapping</literal> tags, include a <literal>class</literal> element. All persistent entity classes (again, there might be dependent classes later on, which are not first-class entities) need such a mapping, to a table in the SQL database:
fr_fr: Entre les deux balises <literal>hibernate-mapping</literal>, incluez un élément <literal>class</literal>. Toutes les classes d'entités persistantes (encore une fois, il pourrait y avoir des classes dépendantes plus tard, qui ne sont pas des entités mère) ont besoin d'un mapping vers une table de la base de données SQL :
ja_jp: 2つの <literal>hibernate-mapping</literal> タグの間に <literal>class</literal> 要素を含めてください。 すべての永続エンティティクラス（念を押しますが、 ファーストクラスのエンティティではない依存クラスというものが後ほど登場します） はSQLデータベース内のテーブルへのこのようなマッピングを必要とします。

source: So far we told Hibernate how to persist and load object of class <literal>Event</literal> to the table <literal>EVENTS</literal>, each instance represented by a row in that table. Now we continue with a mapping of the unique identifier property to the tables primary key. In addition, as we don't want to care about handling this identifier, we configure Hibernate's identifier generation strategy for a surrogate primary key column:
fr_fr: Plus loin, nous disons à Hibernate comment persister et charger un objet de la classe <literal>Event</literal> dans la table <literal>EVENTS</literal>, chaque instance est représentée par une ligne dans cette table. Maintenant nous continuons avec le mapping de la propriété de l'identifiant unique vers la clef primaire de la table. De plus, comme nous ne voulons pas nous occuper de la gestion de cet identifiant, nous utilisons une stratégie de génération d'identifiant d'Hibernate pour la colonne de la clef primaire subrogée :
ja_jp: これまで私たちは、<literal>Event</literal> クラスのオブジェクトを <literal>EVENTS</literal> テーブルに対して、どのように永続化したりロードしたりするのかを Hibernateに教えてきました。そして個々のインスタンスはテーブルの行として表現されます。 それでは引き続きテーブルの主キーに対するユニークな識別子プロパティをマッピングしていきます。 さらに、この識別子の扱いに気を使いたくなかったのと同様に、 代理の主キーカラムに対するHibernateの識別子生成戦略を設定します。

source: The <literal>id</literal> element is the declaration of the identifer property, <literal>name="id"</literal> declares the name of the Java property - Hibernate will use the getter and setter methods to access the property. The column attribute tells Hibernate which column of the <literal>EVENTS</literal> table we use for this primary key. The nested <literal>generator</literal> element specifies the identifier generation strategy, in this case we used <literal>native</literal>, which picks the best strategy depending on the configured database (dialect). Hibernate supports database generated, globally unique, as well as application assigned identifiers (or any strategy you have written an extension for).
fr_fr: L'élément <literal>id</literal> est la déclaration de la propriété de l'identifiant, <literal>name="id"</literal> déclare le nom de la propriété Java - Hibernate utilisera les méthodes getter et setter pour accéder à la propriété. L'attribut <literal>column</literal> indique à Hibernate quelle colonne de la table <literal>EVENTS</literal> nous utilisons pour cette clef primaire. L'élément <literal>generator</literal> imbriqué spécifie la stratégie de génération de l'identifiant, dans ce cas nous avons utilisé <literal>increment</literal>, laquelle est une méthode très simple utile surtout pour les tests (et didacticiels). Hibernate supporte aussi les identifiants générés par les bases de données, globalement uniques, ainsi que les identifiants assignés par l'application (ou n'importe quelle stratégie que vous avez écrit en extension).
ja_jp: <literal>id</literal> 要素は識別子プロパティの宣言であり、 <literal>name="id"</literal> でJavaプロパティの名前を宣言します。 Hibernateはこのプロパティへアクセスするためにゲッター、セッターメソッドを使います。 カラム属性では <literal>EVENTS</literal> テーブルのどのカラムを主キーとして使うのかを Hibernateに教えます。 入れ子になっている <literal>generator</literal> 要素は、識別子を生成する時の戦略を指定します。 （この例では <literal>native</literal> を用いました）。 この要素は、設定したデータベース（dialect）に対する最良な識別子生成戦略を選定するものです。 Hibernateは、アプリケーションで値を割り当てる戦略（もしくは独自に拡張した戦略）と同様に、 グローバルにユニークな値をデータベースに生成させる戦略もサポートしています。

source: Finally we include declarations for the persistent properties of the class in the mapping file. By default, no properties of the class are considered persistent:
fr_fr: Finalement nous incluons des déclarations pour les propriétés persistantes de la classe dans le fichier de mapping. Par défaut, aucune propriété de la classe n'est considérée comme persistante :
ja_jp: 最後にクラスの永続プロパティの宣言をマッピングファイルに含めます。 デフォルトでは、クラスのプロパティは永続と見なされません：

source: Just as with the <literal>id</literal> element, the <literal>name</literal> attribute of the <literal>property</literal> element tells Hibernate which getter and setter methods to use. So, in this case, Hibernate will look for <literal>getDate()/setDate()</literal>, as well as <literal>getTitle()/setTitle()</literal>.
fr_fr: Comme avec l'élément <literal>id</literal>, l'attribut <literal>name</literal> de l'élément <literal>property</literal> indique à Hibernate quels getters/setters utiliser.
ja_jp: <literal>id</literal> 要素の場合と同様に、 <literal>property</literal> 要素の <literal>name</literal> 属性で、どのゲッターとセッターメソッドを使うべきかをHibernateに教えます。 この例では、Hibernateは <literal>getDate()/setDate()</literal> と <literal>getTitle()/setTitle()</literal> を 探します。

source: Why does the <literal>date</literal> property mapping include the <literal>column</literal> attribute, but the <literal>title</literal> doesn't? Without the <literal>column</literal> attribute Hibernate by default uses the property name as the column name. This works fine for <literal>title</literal>. However, <literal>date</literal> is a reserved keyword in most database, so we better map it to a different name.
fr_fr: Pourquoi le mapping de la propriété <literal>date</literal> inclut l'attribut <literal>column</literal>, mais pas <literal>title</literal> ? Sans l'attribut <literal>column</literal> Hibernate utilise par défaut le nom de la propriété comme nom de colonne. Ca fonctionne bien pour <literal>title</literal>. Cependant, <literal>date</literal> est un mot clef réservé dans la plupart des bases de données, donc nous utilisons un nom différent pour le mapping.
ja_jp: なぜ <literal>date</literal> プロパティのマッピングには <literal>column</literal> 属性があり、<literal>title</literal> プロパティにはないのでしょうか？ <literal>column</literal> 属性がなければ、Hibernateはプロパティ名をカラム名として使います。 これは <literal>title</literal> では上手く行きます。 しかし <literal>date</literal> はほとんどのデータベースで予約語なので、 違う名前でマッピングした方がよいのです。

source: The next interesting thing is that the <literal>title</literal> mapping also lacks a <literal>type</literal> attribute. The types we declare and use in the mapping files are not, as you might expect, Java data types. They are also not SQL database types. These types are so called <emphasis>Hibernate mapping types</emphasis>, converters which can translate from Java to SQL data types and vice versa. Again, Hibernate will try to determine the correct conversion and mapping type itself if the <literal>type</literal> attribute is not present in the mapping. In some cases this automatic detection (using Reflection on the Java class) might not have the default you expect or need. This is the case with the <literal>date</literal> property. Hibernate can't know if the property (which is of <literal>java.util.Date</literal>) should map to a SQL <literal>date</literal>, <literal>timestamp</literal>, or <literal>time</literal> column. We preserve full date and time information by mapping the property with a <literal>timestamp</literal> converter.
fr_fr: La prochaine chose intéressante est que le mapping de <literal>title</literal> manque aussi d'un attribut <literal>type</literal>. Les types que nous déclarons et utilisons dans les fichiers de mapping ne sont pas, comme vous pourriez vous y attendre, des types de données Java. Ce ne sont pas, non plus, des types de base de données SQL. Ces types sont donc appelés des <emphasis>types de mapping Hibernate</emphasis>, des convertisseurs qui peuvent traduire des types Java en types SQL et vice versa. De plus, Hibernate tentera de déterminer la bonne conversion et le type de mapping lui-même si l'attribut <literal>type</literal> n'est pas présent dans le mapping. Dans certains cas, cette détection automatique (utilisant la réflexion sur la classe Java) pourrait ne pas donner la valeur attendue ou dont vous avez besoin. C'est le cas avec la propriété <literal>date</literal>. Hibernate ne peut pas savoir si la propriété "mappera" une colonne SQL de type <literal>date</literal>, <literal>timestamp</literal> ou <literal>time</literal>. Nous déclarons que nous voulons conserver des informations avec une date complète et l'heure en mappant la propriété avec un <literal>timestamp</literal>.
ja_jp: 次に興味深いのは <literal>title</literal> マッピングが <literal>type</literal> 属性をも欠いている点です。 マッピングファイルで宣言して使うtypeは、おわかりかもしれませんがJavaのデータ型ではありません。 SQLデータベースの型でもありません。 これは <emphasis>Hibernateマッピング型</emphasis> と呼ばれる、 JavaからSQLデータの型へまたはSQLからJavaデータ型へ翻訳するコンバータです。 繰り返しになりますが、Hibernateは <literal>type</literal> 属性がマッピングファイル内になければ、 正しいコンバージョンとマッピング型を自分で解決しようとします。 （Javaクラスのリフレクションを使った）この自動検知は、 場合によってはあなたが期待または必要とするデフォルト値にならないかもしれません。 <literal>date</literal> プロパティの場合がそうでした。 Hibernateはこの（ <literal>java.util.Date</literal> の）プロパティを SQLの <literal>date</literal> , <literal>timestamp</literal> , <literal>time</literal> のうち、どのカラムにマッピングするべきなのかわかりません。 <literal>timestamp</literal> コンバータでプロパティをマッピングすることにより、完全な日時を保存します。
