Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: fr_fr, ja_jp

source: To deploy this application you have to create a web archive, a WAR. Add the following Ant target to your <literal>build.xml</literal>:
fr_fr: Pour déployer cette application, vous devez créer une archive Web, un War. Ajoutez la cible Ant suivante dans votre <literal>build.xml</literal>:
ja_jp: このアプリケーションのデプロイのために、Webアーカイブ（WAR）を作成してください。 以下のAntターゲットを <literal>build.xml</literal> に加えてください。

source: This target creates a file called <literal>hibernate-tutorial.war</literal> in your project directory. It packages all libraries and the <literal>web.xml</literal> descriptor, which is expected in the base directory of your project:
fr_fr: Cette cible créé un fichier nommé <literal>hibernate-tutorial.war</literal> dans le répertoire de votre projet. Elle package les bibliothèques et le descripteur <literal>web.xml</literal> qui est attendu dans le répertoire racine de votre projet:
ja_jp: このターゲットは <literal>hibernate-tutorial.war</literal> というファイルを プロジェクトディレクトリに作成します。 このファイルはすべてのライブラリと <literal>web.xml</literal> 記述子を含んでおり、 プロジェクトのベースディレクトリに置かれることを期待されます。

source: Before you compile and deploy the web application, note that an additional library is required: <literal>jsdk.jar</literal>. This is the Java servlet development kit, if you don't have this library already, get it from the Sun website and copy it to your library directory. However, it will be only used for compliation and excluded from the WAR package.
fr_fr: Avant de compiler et déployer l'application web, notez qu'une bibliothèque supplémentaire est requise: <literal>servlet.jar</literal>. C'est le kit de développement de Servlet Java, si vous ne disposez pas de cette bibliothèque, prenez la sur le <ulink url="http://java.sun.com/products/servlet/archive.html">site de Sun</ulink> et copiez la dans votre répertoire des bibliothèques. Cependant, elle ne sera utilisée uniquement pour la compilation et sera exclue du paackage WAR.
ja_jp: Webアプリケーションのコンパイルとデプロイの前に、 <literal>jsdk.jar</literal> という 追加のライブラリが必要なことに注意してください。 これはJavaサーブレットの開発キットです。 もしまだこのライブラリを持っていないなら、Sunのウェブサイトで入手して、 ライブラリディレクトリにコピーしてください。 しかし、これはコンパイルにのみ使用され、WARパッケージからは除外されます。

source: To build and deploy call <literal>ant war</literal> in your project directory and copy the <literal>hibernate-tutorial.war</literal> file into your Tomcat <literal>webapp</literal> directory. If you don't have Tomcat installed, download it and follow the installation instructions. You don't have to change any Tomcat configuration to deploy this application though.
fr_fr: Pour construire et déployer, appelez <literal>ant war</literal> dans votre projet et copier le fichier <literal>hibernate-tutorial.war</literal> dans le répertoire <literal>webapp</literal> de tomcat Si vous n'avez pas installé Tomcat, téléchargez le et suivez la notice d'installation. Vous n'avez pas à modifier la configuration Tomcat pour déployer cette application.
ja_jp: ビルドとデプロイのために、プロジェクトディレクトリで <literal>ant war</literal> を呼び出し、 <literal>hibernate-tutorial.war</literal> ファイルをTomcatの <literal>webapp</literal> ディレクトリにコピーしてください。 まだTomcatをインストールしていなければ、ダウンロードして、以下のインストールガイドに従ってください。 しかし、このアプリケーションのデプロイするために、Tomcatの設定を変更する必要はありません。

source: Once deployed and Tomcat is running, access the application at <literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal>. Make sure you watch the Tomcat log to see Hibernate initialize when the first request hits your servlet (the static initializer in <literal>HibernateUtil</literal> is called) and to get the detailed output if any exceptions occurs.
fr_fr: Une fois l'application déployée et Tomcat lancé, accédez à l'application via <literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal>. Assurez vous de consulter les traces tomcat pour observer l'initialisation d'Hibernate à la première requête touchant votre servlet (l'initialisation statique dans <literal>HibernateUtil</literal> est invoquée) et pour vérifier qu'aucune exception ne survienne.
ja_jp: 一度デプロイしてTomcatを起動すれば、 <literal>http://localhost:8080/hibernate-tutorial/eventmanager</literal> で アプリケーションへのアクセスが可能です。 最初のリクエストが作成したサーブレットに渡ったときに、Tomcatのログで Hibernateの初期化処理を確認してください （ <literal>HibernateUtil</literal> 内の静的初期化ブロックが呼ばれています）。 また、exceptionが発生したなら詳細を確認してください。

source: Summary
fr_fr: Résumé
ja_jp: 要約

source: This tutorial covered the basics of writing a simple standalone Hibernate application and a small web application.
fr_fr: Ce didacticiel a couvert les bases de l'écriture d'une simple application Hibernate ainsi qu'une petite application web.
ja_jp: このチュートリアルでは、簡単なスタンドアローンのHibernateアプリケーションと 小規模のWebアプリケーションを書くための基本を紹介しました。

source: If you already feel confident with Hibernate, continue browsing through the reference documentation table of contents for topics you find interesting - most asked are transactional processing (<xref linkend="transactions"/>), fetch performance (<xref linkend="performance"/>), or the usage of the API (<xref linkend="objectstate"/>) and the query features (<xref linkend="objectstate-querying"/>).
fr_fr: Si vous êtes déjà confiants avec Hibernate, continuez à parcourir les sujets que vous trouvez intéressants à travers la table des matières de la documentation de référence - les plus demandés sont le traitement transactionnel (<xref linkend="transactions"/>), la performance des récupérations d'information (<xref linkend="performance"/>), ou l'utilisation de l'API (<xref linkend="objectstate"/>) et les fonctionnalités des requêtes (<xref linkend="objectstate-querying"/>).
ja_jp: もうHibernateに自信があれば、リファレンスドキュメントの目次に目を通して、 面白そうだと思うトピックを探してください。 最も頻繁に質問があるのは、トランザクション処理（<xref linkend="transactions"/>）、 フェッチのパフォーマンス（<xref linkend="performance"/>）、 APIの使い方（<xref linkend="objectstate"/>）とクエリ （<xref linkend="objectstate-querying"/>）です。

source: Don't forget to check the Hibernate website for more (specialized) tutorials.
fr_fr: N'oubliez pas de vérifier le site web d'Hibernate pour d'autres didacticiels (plus spécialisés).
ja_jp: さらに（特別な）チュートリアルが必要なら、Hibernateウェブサイトを忘れずにチェックしてください。

source: Let's turn this into a small web application.
ja_jp: ではこれを小さなWebアプリケーションにしてみましょう。

source: The servlet handles HTTP <literal>GET</literal> requests only, hence, the method we implement is <literal>doGet()</literal>:
ja_jp: ServletはHTTPの <literal>GET</literal> リクエストのみを処理するので、 <literal>doGet()</literal> を実装します。
