Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: fr_fr, ja_jp

source: Well, this is not much use in our current situation, but it's an important concept you can design into your own application. For now, complete this exercise by adding a new action to the <literal>EventManager</literal>'s main method and call it from the command line. If you need the identifiers of a person and an event - the <literal>save()</literal> method returns it (you might have to modify some of the previous methods to return that identifier):
fr_fr: Ce n'est pas très utile dans notre situation actuelle, mais c'est un concept important que vous pouvez mettre dans votre propre application. Pour le moment, complétez cet exercice en ajoutant une nouvelle action à la méthode principale des <literal>EventManager</literal>s et appelez la à partir de la ligne de commande. Si vous avez besoin des identifiants d'une personne et d'un événement - la méthode <literal>save()</literal> les retourne.
ja_jp: これは今はあまり使いみちがありませんが、 自分のアプリケーションの設計に組み込むことができる重要なコンセプトです。 それではこのエクササイズの最後に、 <literal>EventManager</literal> のメインメソッドに新しいアクションを追加して コマンドラインから呼び出してみましょう。 人やイベントの識別子が必要なら、 <literal>save()</literal> メソッドが返してくれます （場合によっては識別子を返すためにメソッドを修正する必要があるかもしれません）。

source: This was an example of an association between two equally important classes, two entities. As mentioned earlier, there are other classes and types in a typical model, usually "less important". Some you have already seen, like an <literal>int</literal> or a <literal>String</literal>. We call these classes <emphasis>value types</emphasis>, and their instances <emphasis>depend</emphasis> on a particular entity. Instances of these types don't have their own identity, nor are they shared between entities (two persons don't reference the same <literal>firstname</literal> object, even if they have the same first name). Of course, value types can not only be found in the JDK (in fact, in a Hibernate application all JDK classes are considered value types), but you can also write dependent classes yourself, <literal>Address</literal> or <literal>MonetaryAmount</literal>, for example.
fr_fr: C'était un exemple d'une association entre deux classes de même importance, deux entités. Comme mentionné plus tôt, il y a d'autres classes et d'autres types dans un modèle typique, généralement "moins importants". Vous en avez déjà vu certains, comme un <literal>int</literal> ou une <literal>String</literal>. Nous appelons ces classes des <emphasis>types de valeur</emphasis>, et leurs instances <emphasis>dépendent</emphasis> d'une entité particulière. Des instances de ces types n'ont pas leur propre identité, elles ne sont pas non plus partagées entre des entités (deux personnes ne référencent pas le même objet <literal>firstname</literal>, même si elles ont le même prénom). Bien sûr, des types de valeur ne peuvent pas seulement être trouvés dans le JDK (en fait, dans une application Hibernate toutes les classes du JDK sont considérées comme des types de valeur), vous pouvez aussi écrire vous-même des classes dépendantes, <literal>Address</literal> ou <literal>MonetaryAmount</literal>, par exemple.
ja_jp: これは同じように重要な2つのクラス、つまり2つのエンティティ間の関連の例でした。 前に述べたように、典型的なモデルには、普通「比較的重要ではない」他のクラスと型があります。 これまでに見たような <literal>int</literal> や <literal>String</literal> のようなものです。 このようなクラスを <emphasis>値型</emphasis> と言います。 このインスタンスは特定のエンティティに <emphasis>依存</emphasis> します。 この型のインスタンスは独自のIDを持ちませんし、 エンティティ間で共有されることもありません （ファーストネームが同じだったとしても、2人の人は同じ <literal>firstname</literal> オブジェクトを参照しません）。 値型はもちろんJDK内に見つかりますが、それだけではなく （実際、HibernateアプリケーションにおいてすべてのJDKクラスは値型と見なせます）、 例えば <literal>Address</literal> や <literal>MonetaryAmount</literal> のような独自の依存クラスを書くこともできます。

source: You can also design a collection of value types. This is conceptually very different from a collection of references to other entities, but looks almost the same in Java.
fr_fr: Vous pouvez aussi concevoir une collection de types de valeur. C'est conceptuellement très différent d'une collection de références vers d'autres entités, mais très ressemblant en Java.
ja_jp: 値型のコレクションを設計することもできます。 これは他のエンティティへの参照のコレクションとは概念的に非常に異なりますが、 Javaではほとんど同じように見えます。

source: Collection of values
fr_fr: Collection de valeurs
ja_jp: 値のコレクション

source: We add a collection of value typed objects to the <literal>Person</literal> entity. We want to store email addresses, so the type we use is <literal>String</literal>, and the collection is again a <literal>Set</literal>:
fr_fr: Nous ajoutons une collection d'objets de type de valeur à l'entité <literal>Person</literal>. Nous voulons stocker des adresses email, donc le type que nous utilisons est <literal>String</literal>, et la collection est encore un <literal>Set</literal> :
ja_jp: 値型オブジェクトのコレクションを <literal>Person</literal> エンティティへ追加します。 Eメールアドレスを格納したいのですが、<literal>String</literal> 型を使っているので、 コレクションは再び <literal>Set</literal> です：

source: The mapping of this <literal>Set</literal>:
fr_fr: Le mapping de ce <literal>Set</literal> :
ja_jp: この <literal>Set</literal> のマッピングです：

source: The difference compared with the earlier mapping is the <literal>element</literal> part, which tells Hibernate that the collection does not contain references to another entity, but a collection of elements of type <literal>String</literal> (the lowercase name tells you it's a Hibernate mapping type/converter). Once again, the <literal>table</literal> attribute of the <literal>set</literal> element determines the table name for the collection. The <literal>key</literal> element defines the foreign-key column name in the collection table. The <literal>column</literal> attribute in the <literal>element</literal> element defines the column name where the <literal>String</literal> values will actually be stored.
fr_fr: La différence comparée au mapping vu plus tôt est la partie <literal>element</literal>, laquelle dit à Hibernate que la collection ne contient pas de références vers une autre entité, mais une collection d'éléments de type <literal>String</literal> (le nom en minuscule vous indique que c'est un type/convertisseur du mapping Hibernate). Une fois encore, l'attribut <literal>table</literal> de l'élément <literal>set</literal> détermine le nom de la table pour la collection. L'élément <literal>key</literal> définit le nom de la colonne de la clef étrangère dans la table de la collection. L'attribut <literal>column</literal> dans l'élément <literal>element</literal> définit le nom de la colonne où les valeurs de <literal>String</literal> seront réellement stockées.
ja_jp: 前のマッピングと比べて違うのは <literal>element</literal> の部分ですが、 Hibernateにこのコレクションが他のエンティティへの参照を含まず、 <literal>String</literal> 型の要素のコレクションを含むことを教えます。 （小文字の名前(string)はHibernateのマッピング型またはコンバータであるということです）。 繰り返しますが、<literal>set</literal> 要素の <literal>table</literal> 属性は、 コレクションのためのテーブル名を指定します。 <literal>key</literal> 要素はコレクションテーブルの外部キーカラム名を定義します。 <literal>element</literal> 要素の <literal>column</literal> 属性は <literal>String</literal> の値が実際に格納されるカラムの名前を定義します。

source: Have a look at the updated schema:
fr_fr: Regardons le schéma mis à jour :
ja_jp: 更新したスキーマを見てください：

source: You can see that the primary key of the collection table is in fact a composite key, using both columns. This also implies that there can't be duplicate email addresses per person, which is exactly the semantics we need for a set in Java.
fr_fr: Vous pouvez voir que la clef primaire de la table de la collection est en fait une clef composée, utilisant deux colonnes. Ceci implique aussi qu'il ne peut pas y avoir d'adresses email dupliquées par personne, ce qui est exactement la sémantique dont nous avons besoin pour un ensemble en Java.
ja_jp: コレクションテーブルの主キーは、実際は両方のカラムを使った複合キーであることがわかります。 これは人ごとにEメールアドレスが重複できないということで、 Javaのsetに要求されるセマンティクスそのものです。

source: You can now try and add elements to this collection, just like we did before by linking persons and events. It's the same code in Java:
fr_fr: Vous pouvez maintenant tester et ajouter des éléments à cette collection, juste comme nous l'avons fait avant en liant des personnes et des événements. C'est le même code en Java.
ja_jp: 以前人とイベントを関連づけたときと全く同じように、 今や試しにコレクションに要素を追加することができるようになりました。 両方ともJavaでは同じコードです。

source: This time we didnt' use a <emphasis>fetch</emphasis> query to initialize the collection. Hence, the call to its getter method will trigger an additional select to initialize it, so we can add an element to it. Monitor the SQL log and try to optimize this with an eager fetch.
fr_fr: Cette fois ci, nous n'avons pas utilisé une requête de chargement agressif (<emphasis>fetch</emphasis>) pour initialiser la collection. Par conséquent, l'invocation du getter déclenchera un select supplémentaire pour l'initialiser. Traquez les logs SQL et tentez d'optimiser ce cas avec un chargement aggressif.
ja_jp: 今回、コレクションの初期化に <emphasis>fetch</emphasis> クエリを使用しませんでした。 そのため、getterメソッドの呼び出しによってコレクションを初期化するためのSELECTが 実行されるので、コレクションに要素を追加できます。 SQLのログを監視して、即時フェッチを使って最適化してください。

source: Bi-directional associations
fr_fr: Associations bidirectionnelles
ja_jp: 双方向関連

source: Next we are going to map a bi-directional association - making the association between person and event work from both sides in Java. Of course, the database schema doesn't change, we still have many-to-many multiplicity. A relational database is more flexible than a network programming language, so it doesn't need anything like a navigation direction - data can be viewed and retrieved in any possible way.
fr_fr: Ensuite nous allons mapper une association bidirectionnelle - faire fonctionner l'association entre une personne et un événement à partir des deux côtés en Java. Bien sûr, le schéma de la base de données ne change pas, nous avons toujours une pluralité many-to-many. Une base de données relationnelle est plus flexible qu'un langage de programmation réseau, donc elle n'a pas besoin de direction de navigation - les données peuvent être vues et récupérées de toutes les manières possibles.
ja_jp: 次に双方向関連をマッピングします。 Javaで両側から人とイベントの関連を動作させます。 もちろん、データベーススキーマは変わりませんが、多重度は多対多のままです。 リレーショナルデータベースはネットワークプログラミング言語よりも柔軟なので、 ナビゲーションの方向のようなものを必要としません。 データはあらゆるの方法で見たり復元できるということです。

source: First, add a collection of participants to the <literal>Event</literal> Event class:
fr_fr: D'abord, ajouter une collection de participants à la classe <literal>Event</literal> :
ja_jp: まず <literal>Event</literal> イベントクラスに参加者のコレクションを追加します：

source: Now map this side of the association too, in <literal>Event.hbm.xml</literal>.
fr_fr: Maintenant mapper ce côté de l'association aussi, dans <literal>Event.hbm.xml</literal>.
ja_jp: それでは <literal>Event.hbm.xml</literal> で関連のこちら側をマッピングしてください。

source: As you see, these are normal <literal>set</literal> mappings in both mapping documents. Notice that the column names in <literal>key</literal> and <literal>many-to-many</literal> are swapped in both mapping documents. The most important addition here is the <literal>inverse="true"</literal> attribute in the <literal>set</literal> element of the <literal>Event</literal>'s collection mapping.
fr_fr: Comme vous le voyez, ce sont des mappings de <literal>set</literal>s normaux dans les deux documents de mapping. Notez que les noms de colonne dans <literal>key</literal> et <literal>many-to-many</literal> sont inversés dans les 2 documents de mapping. L'ajout le plus important ici est l'attribut <literal>inverse="true"</literal> dans l'élément <literal>set</literal> du mapping de la collection des <literal>Event</literal>s.
ja_jp: ご覧のとおり、いずれのマッピングドキュメント(XMLファイル)でも、普通の <literal>set</literal> マッピングを使っています。 <literal>key</literal> と <literal>many-to-many</literal> のカラム名が、 両方のマッピングドキュメントで入れ替えになっていることに注目してください。 ここで最も重要な追加項目は、 <literal>Event</literal> のコレクションマッピングの <literal>set</literal> 要素にある <literal>inverse="true"</literal> 属性です。

source: What this means is that Hibernate should take the other side - the <literal>Person</literal> class - when it needs to find out information about the link between the two. This will be a lot easier to understand once you see how the bi-directional link between our two entities is created .
fr_fr: Ce que signifie qu'Hibernate devrait prendre l'autre côté - la classe <literal>Person</literal> - s'il a besoin de renseigner des informations à propos du lien entre les deux. Ce sera beaucoup plus facile à comprendre une fois que vous verrez comment le lien bidirectionnel entre les deux entités est créé.
ja_jp: この指定の意味は、2つの間のエンティティ間のリンクについての情報を探す必要があるとき、 Hibernateは反対側のエンティティ、つまり <literal>Person</literal> クラスから探すということです。 一度2つのエンティティ間の双方向リンクがどのように作成されるかがわかれば、 これを理解することはとても簡単です。

source: Working bi-directional links
fr_fr: Travailler avec des liens bidirectionnels
ja_jp: 双方向リンクの動作

source: First, keep in mind that Hibernate does not affect normal Java semantics. How did we create a link between a <literal>Person</literal> and an <literal>Event</literal> in the unidirectional example? We added an instance of <literal>Event</literal> to the collection of event references, of an instance of <literal>Person</literal>. So, obviously, if we want to make this link working bi-directional, we have to do the same on the other side - adding a <literal>Person</literal> reference to the collection in an <literal>Event</literal>. This "setting the link on both sides" is absolutely necessary and you should never forget doing it.
fr_fr: Premièrement, gardez à l'esprit qu'Hibernate n'affecte pas la sémantique normale de Java. Comment avons-nous créé un lien entre une <literal>Person</literal> et un <literal>Event</literal> dans l'exemple unidirectionnel ? Nous avons ajouté une instance de <literal>Event</literal> à la collection des références d'événement d'une instance de <literal>Person</literal>. Donc, évidemment, si vous voulons rendre ce lien bidirectionnel, nous devons faire la même chose de l'autre côté - ajouter une référence de <literal>Person</literal> à la collection d'un <literal>Event</literal>. Cette "configuration du lien des deux côtés" est absolument nécessaire et vous ne devriez jamais oublier de le faire.
ja_jp: まず、Hibernateが通常のJavaのセマンティクスに影響を及ぼさないことを心に留めておいてください。 私たちは、単方向の例としてどのように <literal>Person</literal> と <literal>Event</literal> の間のリンクを作成したでしょうか？ <literal>Person</literal> のインスタンスのイベントへの参照のコレクションに <literal>Event</literal> のインスタンスを追加しました。 そのためこのリンクを双方向にしたければ、 当たり前ですが反対側にも同じことをしなければなりません。 <literal>Event</literal> のコレクションに <literal>Person</literal> への 参照を追加するということです。 この「両側でリンクを設定すること」は絶対に必要なので、決して忘れないでください。

source: Many developers program defensive and create link management methods to correctly set both sides, e.g. in <literal>Person</literal>:
fr_fr: Beaucoup de développeurs programment de manière défensive et créent des méthodes de gestion de lien pour affecter correctement les deux côtés, par exemple dans <literal>Person</literal> :
ja_jp: 多くの開発者は慎重にプログラムするので、 エンティティの両側に正しく関連を設定するリンク管理メソッドを作成します。 例えば <literal>Person</literal> では以下のようになります。：

source: Notice that the get and set methods for the collection are now protected - this allows classes in the same package and subclasses to still access the methods, but prevents everybody else from messing with the collections directly (well, almost). You should probably do the same with the collection on the other side.
fr_fr: Notez que les méthodes get et set pour la collection sont maintenant protégées - ceci permet à des classes du même paquet et aux sous-classes d'accéder encore aux méthodes, mais empêche n'importe qui d'autre de mettre le désordre directement dans les collections (enfin, presque). Vous devriez probablement faire de même avec la collection de l'autre côté.
ja_jp: コレクションのゲットとセットメソッドが現在protectedになっていることに注意してください。 これは同じパッケージのクラスやサブクラスのメソッドは依然アクセスが可能ですが、 （ほとんど）そのパッケージ外のどのクラスでも直接そのコレクションを台無しにすることを防ぎます。 おそらく反対側のコレクションにも同じことをした方がいいでしょう。

source: What about the <literal>inverse</literal> mapping attribute? For you, and for Java, a bi-directional link is simply a matter of setting the references on both sides correctly. Hibernate however doesn't have enough information to correctly arrange SQL <literal>INSERT</literal> and <literal>UPDATE</literal> statements (to avoid constraint violations), and needs some help to handle bi-directional associations properly. Making one side of the association <literal>inverse</literal> tells Hibernate to basically ignore it, to consider it a <emphasis>mirror</emphasis> of the other side. That's all that is necessary for Hibernate to work out all of the issues when transformation a directional navigation model to a SQL database schema. The rules you have to remember are straightforward: All bi-directional associations need one side as <literal>inverse</literal>. In a one-to-many association it has to be the many-side, in many-to-many association you can pick either side, there is no difference.
fr_fr: Et à propos de l'attribut de mapping <literal>inverse</literal> ? Pour vous, et pour Java, un lien bidirectionnel est simplement une manière de configurer correctement les références des deux côtés. Hibernate n'a cependant pas assez d'informations pour ordonner correctement les expressions SQL <literal>INSERT</literal> et <literal>UPDATE</literal> (pour éviter les violations de contrainte), et a besoin d'aide pour gérer proprement les associations bidirectionnelles. Rendre <literal>inverse</literal> un côté d'une assocation dit à Hibernate de l'ignorer essentiellement, pour le considérer comme un <emphasis>miroir</emphasis> de l'autre côté. C'est tout ce qui est nécessaire à Hibernate pour découvrir tout des problèmes de transformation d'un modèle de navigation directionnelle vers un schéma SQL de base de données. Les règles dont vous devez vous souvenir sont : toutes les associations bidirectionnelles ont besoin d'un côté marqué <literal>inverse</literal>. Dans une association un-vers-plusieurs vous pouvez choisir n'importe quel côté, il n'y a pas de différence.
ja_jp: <literal>inverse</literal> マッピング属性とはいったい何でしょうか？ 開発者とJavaにとっては、双方向リンクは単に両側の参照を正しく設定するということです。 しかしHibernateは（制約違反を避けるために）SQLの <literal>INSERT</literal> と <literal>UPDATE</literal> 文を正確に変更するための十分な情報を持っていないので、 双方向関連プロパティを扱うための何らかの助けを必要とします。 関連の片側を <literal>inverse</literal> に設定することで、Hibernateは基本的には設定した側を無視し、 反対側の <emphasis>鏡</emphasis> として考えます。 これだけで、Hibernateは方向を持つナビゲーションモデルをSQLデータベーススキーマへ変換するときの すべての問題にうまく対処できます。 覚えておかなければならないルールは簡単です。 双方向関連は必ず片側を <literal>inverse</literal> にする必要があるということです。 一対多関連ではそれは多側でなければなりません。 多対多関連ではどちら側でも構いません。どちらでも違いはありません。

source: Part 3 - The EventManager web application
fr_fr: Part 3 - L'application web EventManager
ja_jp: パート3 - EventManager Webアプリケーション

source: A Hibernate web application uses <literal>Session</literal> and <literal>Transaction</literal> almost like a standalone application. However, some common patterns are useful. We now write an <literal>EventManagerServlet</literal>. This servlet can list all events stored in the database, and it provides an HTML form to enter new events.
fr_fr: Une application web Hibernate utilise la <literal>Session</literal> et <literal>Transaction</literal> comme une application standalone. Cependant, quelques patterns sont utiles. Nous allons coder une <literal>EventManagerServlet</literal>. Cette servlet peut lister tous les évènements stockés dans la base de données, et fournir une formulaire HTML pour saisir d'autres évènements.
ja_jp: HibernateのWebアプリケーションは、スタンドアローンのアプリケーションのように <literal>Session</literal> と <literal>Transaction</literal> を使用します。 しかしいくつかの一般的なパターンが役立ちます。 ここで <literal>EventManagerServlet</literal> を作成します。このサーブレットは、 データベースに格納した全てのイベントをリストにでき、さらにHTMLフォームから新しいイベントを入力できるものです。

source: Writing the basic servlet
fr_fr: Ecrire la servlet de base
ja_jp: 基本的なServletの記述

source: Create a new class in your source directory, in the <literal>events</literal> package:
fr_fr: Créons une nouvelle classe dans notre répertoire source, dans le package <literal>events</literal>:
ja_jp: 新しいクラスを、ソースディレクトリの <literal>events</literal> パッケージに作成してください。

source: Do <emphasis>not</emphasis> use a new Hibernate <literal>Session</literal> for every database operation. Use one Hibernate <literal>Session</literal> that is scoped to the whole request. Use <literal>getCurrentSession()</literal>, so that it is automatically bound to the current Java thread.
fr_fr: UNTRANSLATED Do <emphasis>not</emphasis> use a new Hibernate <literal>Session</literal> for every database operation. Use one Hibernate <literal>Session</literal> that is scoped to the whole request. Use <literal>getCurrentSession()</literal>, so that it is automatically bound to the current Java thread.

source: Next, the possible actions of the request are processed and the response HTML is rendered. We'll get to that part soon.
fr_fr: Ensuite, les actions possibles de la requêtes sont exécutées et la réponse HTML est rendue. Nous en parlerons plus tard.
ja_jp: 次に、リクエストのアクションは処理され、レスポンスであるHTMLが描画されます。 これについてはすぐに説明します。

source: Processing and rendering
fr_fr: Procéder et rendre
ja_jp: 処理と描画

source: Let's implement the processing of the request and rendering of the page.
fr_fr: Implémentons l'exécution de la requête et le rendu de la page.
ja_jp: では、リクエストの処理とページの描画を実装します。

source: The <literal>listEvents()</literal> method uses the Hibernate <literal>Session</literal> bound to the current thread to execute a query:
fr_fr: La méthode <literal>listEvents()</literal> utilise la <literal>Session</literal> Hibernate liée au thread courant pour exécuter la requête:
ja_jp: <literal>listEvents()</literal> メソッドは、現在のスレッドに結びつく Hibernateの <literal>Session</literal> を使用して、クエリを実行します。

source: Finally, the <literal>store</literal> action is dispatched to the <literal>createAndStoreEvent()</literal> method, which also uses the <literal>Session</literal> of the current thread:
fr_fr: FEnfin, l'action <literal>store</literal> renvoie à la méthode <literal>createAndStoreEvent()</literal>, qui utilise aussi la <literal>Session</literal> du thread courant:
ja_jp: 最後に、 <literal>store</literal> アクションが <literal>createAndStoreEvent()</literal> メソッドを 呼び出します。このメソッドでも現在のスレッドの <literal>Session</literal> を利用します。

source: That's it, the servlet is complete. A request to the servlet will be processed in a single <literal>Session</literal> and <literal>Transaction</literal>. As earlier in the standalone application, Hibernate can automatically bind these objects to the current thread of execution. This gives you the freedom to layer your code and access the <literal>SessionFactory</literal> in any way you like. Usually you'd use a more sophisticated design and move the data access code into data access objects (the DAO pattern). See the Hibernate Wiki for more examples.
fr_fr: La servlet est faite. Une requête à la servlet sera exécutée par une seule <literal>Session</literal> et <literal>Transaction</literal>. Comme pour une application standalone, Hibernate peut automatiquement lier ces objets au thread courant d'exécution. Cela vous laisse la liberté de séparer votre code en couches et d'accéder à la <literal>SessionFactory</literal> par le moyen que vous voulez. Généralement, vous utiliserez des conceptions plus sophistiquées et déplacerez le code d'accès aux données dans une couche DAO. Voir le wiki Hibernate pour plus d'exemples.
ja_jp: これでサーブレットの完成です。 サーブレットへのリクエストは、一つの <literal>Session</literal> と <literal>Transaction</literal> で処理されるでしょう。 最初のスタンドアローンのアプリケーションのように、 Hibernateは自動的にこれらのオブジェクトを実行するスレッドに結び付けることができます。 これにより、開発者が自由にコードをレイヤー分けでき、 好きな方法で <literal>SessionFactory</literal> へのアクセスができるようになります。 通常、開発者はより洗練されたデザインを使用して、データアクセスのコードを データアクセスオブジェクトに移動するでしょう（DAOパターン）。 より多くの例は、HibernateのWikiを参照してください。

source: Deploying and testing
fr_fr: Déployer et tester
ja_jp: デプロイとテスト
