Repository: hibernate/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: fr_fr, ja_jp

source: This mapping file should be saved as <literal>Event.hbm.xml</literal>, right in the directory next to the <literal>Event</literal> Java class source file. The naming of mapping files can be arbitrary, however the <literal>hbm.xml</literal> suffix is a convention in the Hibernate developer community. The directory structure should now look like this:
fr_fr: Ce fichier de mapping devrait être sauvegardé en tant que <literal>Event.hbm.xml</literal>, juste dans le répertoire à côté du fichier source de la classe Java <literal>Event</literal>. Le nommage des fichiers de mapping peut être arbitraire, cependant le suffixe <literal>hbm.xml</literal> est devenu une convention dans la communauté des développeurs Hibernate. La structure du répertoire devrait ressembler à ça :
ja_jp: このマッピングファイルは、<literal>Event.hbm.xml</literal> として <literal>Event</literal> Javaクラスソースファイルのすぐ隣にセーブするべきです。 マッピングファイルの命名方法は任意ですが、<literal>hbm.xml</literal> サフィックスがHibernateの開発者のコミュニティ内での習慣となっています。 現在ディレクトリ構造はこのようになっているはずです：

source: We continue with the main configuration of Hibernate.
fr_fr: Nous poursuivons avec la configuration principale d'Hibernate.
ja_jp: Hibernateの主要な設定を続けます。

source: Hibernate configuration
fr_fr: Configuration d'Hibernate
ja_jp: Hibernateの設定

source: We now have a persistent class and its mapping file in place. It is time to configure Hibernate. Before we do this, we will need a database. HSQL DB, a java-based SQL DBMS, can be downloaded from the HSQL DB website(http://hsqldb.org/). Actually, you only need the <literal>hsqldb.jar</literal> from this download. Place this file in the <literal>lib/</literal> directory of the development folder.
fr_fr: Nous avons maintenant une classe persistante et son fichier de mapping. Il est temps de configurer Hibernate. Avant ça, nous avons besoin d'une base de données. HSQL DB, un SGBD SQL basé sur Java et travaillant en mémoire, peut être téléchargé à partir du site web de HSQL. En fait, vous avez seulement besoin de <literal>hsqldb.jar</literal>. Placez ce fichier dans le répertoire <literal>lib/</literal> du dossier de développement.
ja_jp: ここまでで永続クラスとマッピングファイルが揃いました。これからHibernateの設定を行いますが、 その前にデータベースが必要です。 HSQL DBはJavaベースのインメモリSQL DBMSであり、HSQL DBウェブサイトからダウンロードできます。 実際にはダウンロードした中の <literal>hsqldb.jar</literal> だけが必要です。 このファイルを開発フォルダの <literal>lib/</literal> ディレクトリに配置してください。

source: Create a directory called <literal>data</literal> in the root of the development directory - this is where HSQL DB will store its data files. Now start the database by running <literal>java -classpath ../lib/hsqldb.jar org.hsqldb.Server</literal> in this data directory. You can see it start up and bind to a TCP/IP socket, this is where our application will connect later. If you want to start with a fresh database during this tutorial, shutdown HSQL DB (press <literal>CTRL + C</literal> in the window), delete all files in the <literal>data/</literal> directory, and start HSQL DB again.
fr_fr: Créez un répertoire appelé <literal>data</literal> à la racine du répertoire de développement - c'est là que HSQL DB stockera ses fichiers de données. Démarrez maintenant votre base de données en exécutant <literal>java -classpath lib/hsqldb.jar org.hsqldb.Server</literal> dans votre répertoire de travail. Vous observez qu'elle démarre et ouvre une socket TCP/IP, c'est là que notre application se connectera plus tard. Si vous souhaitez démarrez à partir d'une nouvelle base de données pour ce tutoriel (faites <literal>CTRL + C</literal> dans la fenêtre the window), effacez le répertoire <literal>data/</literal> et redémarrez HSQL DB à nouveau.
ja_jp: <literal>data</literal> というディレクトリを開発ディレクトリのルートに作成してください。 HSQL DBはここにデータファイルを格納します。 このデータディレクトリにおいて <literal>java -classpath lib/hsqldb.jar org.hsqldb.Server</literal> を実行し、 データベースを起動させてください。 動作の開始と、TCP/IPソケットのバインドが確認できます。 後ほど作成するアプリケーションはここに接続します。 もしこのチュートリアル中にデータベースを初期化したければ、 HSQL DBをシャットダウンして（作業ウィンドウで <literal>CTRL + C</literal> を押します） <literal>data/</literal> ディレクトリ内のファイルを全て消去した後、 HSQL DBを再起動します。

source: Hibernate is the layer in your application which connects to this database, so it needs connection information. The connections are made through a JDBC connection pool, which we also have to configure. The Hibernate distribution contains several open source JDBC connection pooling tools, but will use the Hibernate built-in connection pool for this tutorial. Note that you have to copy the required library into your classpath and use different connection pooling settings if you want to use a production-quality third party JDBC pooling software.
fr_fr: Hibernate est la couche de votre application qui se connecte à cette base de données, donc il a besoin des informations de connexion. Les connexions sont établies à travers un pool de connexions JDBC, que nous devons aussi configurer. La distribution Hibernate contient différents outils de gestion de pools de connexions JDBC open source, mais pour ce didacticiel nous utiliserons le pool de connexions intégré à Hibernate. Notez que vous devez copier les bibliothèques requises dans votre classpath et utiliser une configuration de pool de connexions différente si vous voulez utiliser un logiciel de gestion de pools JDBC tiers avec une qualité de production.
ja_jp: Hibernateはアプリケーションのデータベースに接続する層なので、 コネクションの情報が必要になります。 コネクションはJDBCコネクションプールを通じて行われますが、これも設定する必要があります。 HibernateディストリビューションにはいくつかのオープンソースのJDBCコネクションプールツールが含まれていますが、 このチュートリアルではHibernateに組み込まれたコネクションプールを使います。 もし製品レベルの品質のサードパーティJDBCコネクションプールソフトウェアを使いたければ、 クラスパスに必要なライブラリをコピーして、異なるコネクションプールを設定しなければ ならないことに注意してください。

source: For Hibernate's configuration, we can use a simple <literal>hibernate.properties</literal> file, a slightly more sophisticated <literal>hibernate.cfg.xml</literal> file, or even complete programmatic setup. Most users prefer the XML configuration file:
fr_fr: Pour la configuration d'Hibernate, nous pouvons utiliser un simple fichier <literal>hibernate.properties</literal>, un fichier <literal>hibernate.cfg.xml</literal> légèrement plus sophistiqué, ou même une configuration complète par programmation. La plupart des utilisateurs préfèrent le fichier de configuration XML :
ja_jp: Hibernateの設定では、単純な <literal>hibernate.properties</literal> ファイル、 それより少し洗練されている <literal>hibernate.cfg.xml</literal> ファイル、 または完全にプログラム上でセットアップする方法が利用できます。 ほとんどのユーザが好むのはXML設定ファイルです：

source: Note that this XML configuration uses a different DTD. We configure Hibernate's <literal>SessionFactory</literal> - a global factory responsible for a particular database. If you have several databases, use several <literal>&lt;session-factory&gt;</literal> configurations, usually in several configuration files (for easier startup).
fr_fr: Notez que cette configuration XML utilise une DTD différente. Nous configurons une <literal>SessionFactory</literal> d'Hibernate - une fabrique globale responsable d'une base de données particulière. Si vous avez plusieurs base de données, utilisez plusieurs configurations <literal>&lt;session-factory&gt;</literal>, généralement dans des fichiers de configuration différents (pour un démarrage plus facile).
ja_jp: このXMLの設定が異なるDTDを使うことに注意してください。 特定のデータベースを受け持つグローバルファクトリであるHibernateの <literal>SessionFactory</literal> を設定します。 もし複数のデータベースがある場合には、 （スタートアップを簡単にするため）通常いくつかの設定ファイル内で、 いくつかの <literal>&lt;session-factory&gt;</literal> を使う設定にしてください。

source: The first four <literal>property</literal> elements contain the necessary configuration for the JDBC connection. The dialect <literal>property</literal> element specifies the particular SQL variant Hibernate generates. Hibernate's automatic session management for persistence contexts will come in handy as you will soon see. The <literal>hbm2ddl.auto</literal> option turns on automatic generation of database schemas - directly into the database. This can of course also be turned off (by removing the config option) or redirected to a file with the help of the <literal>SchemaExport</literal> Ant task. Finally, we add the mapping file(s) for persistent classes to the configuration.
fr_fr: Les quatre premiers éléments <literal>property</literal> contiennent la configuration nécessaire pour la connexion JDBC. L'élément <literal>property</literal> du dialecte spécifie quelle variante du SQL Hibernate va générer. La gestion automatique des sessions d'Hibernate pour les contextes de persistance sera détaillée très vite. L'option <literal>hbm2ddl.auto</literal> active la génération automatique des schémas de base de données - directement dans la base de données. Cela peut bien sûr aussi être désactivé (en supprimant l'option de configuration) ou redirigé vers un fichier avec l'aide de la tâche Ant <literal>SchemaExport</literal>. Finalement, nous ajoutons le(s) fichier(s) de mapping pour les classes persistantes.
ja_jp: 最初の4つの <literal>property</literal> 要素はJDBCコネクションに必要な設定を含んでいます。 dialectという名前の <literal>property</literal> 要素は、Hibernateが生成する特定のSQL方言を指定します。 永続的なコンテキストに対するHibernateのセッションの自動管理は、後の例ですぐにわかるように、役に立つことでしょう。 <literal>hbm2ddl.auto</literal> オプションはデータベーススキーマの自動生成をonにします。 これは直接データベースに対して生成されます。 当然（configオプションを削除して）offにしたり、 <literal>SchemaExport</literal> というAntタスクの助けを借りてファイルにリダイレクトしたりできます。 最後に永続クラスのためのマッピングファイルを設定に追加します。

source: Copy this file into the source directory, so it will end up in the root of the classpath. Hibernate automatically looks for a file called <literal>hibernate.cfg.xml</literal> in the root of the classpath, on startup.
fr_fr: Copiez ce fichier dans le répertoire source, il terminera dans la racine du classpath. Hibernate cherchera automatiquement, au démarrage, un fichier appelé <literal>hibernate.cfg.xml</literal> dans la racine du classpath.
ja_jp: このファイルをソースディレクトリにコピーしてください。 するとこれはクラスパスのルートにあることになります。 Hibernateは、スタートアップ時にクラスパスのルートで <literal>hibernate.cfg.xml</literal> というファイルを自動的に探します。

source: Building with Ant
fr_fr: Construction avec Ant
ja_jp: Antによるビルド

source: We'll now build the tutorial with Ant. You will need to have Ant installed - get it from the <ulink url="http://ant.apache.org/bindownload.cgi">Ant download page</ulink>. How to install Ant will not be covered here. Please refer to the <ulink url="http://ant.apache.org/manual/index.html">Ant manual</ulink>. After you have installed Ant, we can start to create the buildfile. It will be called <literal>build.xml</literal> and placed directly in the development directory.
fr_fr: Nous allons maintenant construire le didacticiel avec Ant. Vous aurez besoin d'avoir Ant d'installé - récupérez-le à partir de <ulink url="http://ant.apache.org/bindownload.cgi"> la page de téléchargement de Ant</ulink>. Comment installer Ant ne sera pas couvert ici. Référez-vous au <ulink url="http://ant.apache.org/manual/index.html">manuel d'Ant</ulink>. Après que vous aurez installé Ant, nous pourrons commencer à créer le fichier de construction. Il s'appellera <literal>build.xml</literal> et sera placé directement dans le répertoire de développement.
ja_jp: それではAntを使ってチュートリアルをビルドしましょう。 それにはAntがインストールされていなければなりません。 <ulink url="http://ant.apache.org/bindownload.cgi">Antダウンロードページ</ulink> からダウンロードしてください。 Antのインストール方法はここでは説明しませんので、 <ulink url="http://ant.apache.org/manual/index.html">Antマニュアル</ulink> を参照してください。 Antをインストールすれば、ビルドファイルの作成を開始できます。 このファイルは <literal>build.xml</literal> と呼ばれ、開発ディレクトリに直接配置します。

source: A basic build file looks like this:
fr_fr: Un fichier de construction basique ressemble à ça :
ja_jp: 基本的なビルドファイルはこのようになります：

source: This will tell Ant to add all files in the lib directory ending with <literal>.jar</literal> to the classpath used for compilation. It will also copy all non-Java source files to the target directory, e.g. configuration and Hibernate mapping files. If you now run Ant, you should get this output:
fr_fr: Cela dira à Ant d'ajouter tous les fichiers du répertoire lib finissant par <literal>.jar</literal> dans le classpath utilisé pour la compilation. Cela copiera aussi tous les fichiers source non Java dans le répertoire cible, par exemple les fichiers de configuration et de mapping d'Hibernate. Si vous lancez Ant maintenant, vous devriez obtenir cette sortie :
ja_jp: これは <literal>.jar</literal> で終わるlibディレクトリのすべてのファイルを、 コンパイルに使用するクラスパスに追加することをAntに教えます。 また、Javaソースファイルでないすべてのファイルをターゲットディレクトリにコピーするということでもあります。 例えば設定ファイルやHibernateマッピングファイルなどです。 今Antを実行すると、このような出力があるはずです：

source: Startup and helpers
fr_fr: Démarrage et aides
ja_jp: スタートアップとヘルパ

source: It's time to load and store some <literal>Event</literal> objects, but first we have to complete the setup with some infrastructure code. We have to startup Hibernate. This startup includes building a global <literal>SessionFactory</literal> object and to store it somewhere for easy access in application code. A <literal>SessionFactory</literal> can open up new <literal>Session</literal>'s. A <literal>Session</literal> represents a single-threaded unit of work, the <literal>SessionFactory</literal> is a thread-safe global object, instantiated once.
fr_fr: Il est temps de charger et de stocker quelques objets <literal>Event</literal>, mais d'abord nous devons compléter la configuration avec du code d'infrastructure. Nous devons démarrer Hibernate. Ce démarrage inclut la construction d'un objet <literal>SessionFactory</literal> global et le stocker quelque part facile d'accès dans le code de l'application. Une <literal>SessionFactory</literal> peut ouvrir des nouvelles <literal>Session</literal>s. Une <literal>Session</literal> représente une unité de travail simplement "threadée", la <literal>SessionFactory</literal> est un objet global "thread-safe", instancié une seule fois.
ja_jp: さて <literal>Event</literal> オブジェクトをロードしたり格納したりする準備ができました。 しかしまずはインフラストラクチャのコードを書いて、セットアップを完了する必要があります。 まずはHibernateをスタートアップしなければなりません。 このスタートアップには、グローバルの <literal>SessionFactory</literal> オブジェクトを生成して、 それをアプリケーションのコードでアクセスしやすい場所に格納することが含まれます。 <literal>SessionFactory</literal> は新しく <literal>Session</literal> をオープンすることができます。 <literal>Session</literal> はシングルスレッドの作業単位(Unit of Work)を表現します。 それに対し<literal>SessionFactory</literal> はスレッドセーフのグローバルオブジェクトであり、 一度だけインスタンス化されます。

source: We'll create a <literal>HibernateUtil</literal> helper class which takes care of startup and makes accessing a <literal>SessionFactory</literal> convenient. Let's have a look at the implementation:
fr_fr: Nous créerons une classe d'aide <literal>HibernateUtil</literal> qui s'occupe du démarrage et rend la gestion des <literal>Session</literal>s plus facile. Regardons l'implémentation :
ja_jp: ここでスタートアップを行い、 便利に <literal>SessionFactory</literal> へアクセスする <literal>HibernateUtil</literal> ヘルパクラスを作成します。 実装を見てみましょう：

source: This class does not only produce the global <literal>SessionFactory</literal> in its static initializer (called once by the JVM when the class is loaded), but also hides the fact that it uses a static singleton. It might as well lookup the <literal>SessionFactory</literal> from JNDI in an application server.
fr_fr: Cette classe ne produit pas seulement la <literal>SessionFactory</literal> globale dans un initialiseur statique (appelé une seule fois par la JVM lorsque la classe est chargée), elle masque le fait qu'elle exploite un singleton. Elle pourrait aussi obtenir la <literal>SessionFactory</literal> depuis JNDI dans un serveur d'applications.
ja_jp: このクラスは静的初期化ブロック（クラスがロードされるときにJVMによって一度だけ呼ばれる） でグローバルの <literal>SessionFactory</literal> を生成するだけではなく、 静的シングルトンの使用を隠蔽します。 アプリケーションサーバーのJNDIから <literal>SessionFactory</literal> を ルックアップするのと同様です。

source: If you give the <literal>SessionFactory</literal> a name in your configuration file, Hibernate will in fact try to bind it to JNDI after it has been built. To avoid this code completely you could also use JMX deployment and let the JMX-capable container instantiate and bind a <literal>HibernateService</literal> to JNDI. These advanced options are discussed in the Hibernate reference documentation.
fr_fr: Si vous nommez la <literal>SessionFactory</literal> dans votre fichier de configuration, Hibernate tentera la récupération depuis JNDI. Pour éviter ce code, vous pouvez aussi utiliser un déploiement JMX et laisser le conteneur (compatible JMX) instancier et lier un <literal>HibernateService</literal> à JNDI. Ces options avancées sont détaillées dans la documentation de référence Hibernate.
ja_jp: 設定ファイル内で <literal>SessionFactory</literal> に名前を与えると、 Hibernateは <literal>SessionFactory</literal> 構築後にJNDIに対しバインドを行おうとします。 このコードを完全に排除するためには、 JMXデプロイメントを利用して JMXを利用できるコンテナをインスタンス化し、 <literal>HibernateService</literal> をJNDIへバインドすることもできます。 これらの高度なオプションは、Hibernateのリファレンスドキュメントで説明されています。

source: Place <literal>HibernateUtil.java</literal> in the development source directory, in a package next to <literal>events</literal>:
fr_fr: Placez <literal>HibernateUtil.java</literal> dans le répertoire source de développement, et ensuite <literal>Event.java</literal> :
ja_jp: <literal>HibernateUtil.java</literal> を開発ソースディレクトリにある <literal>events</literal> パッケージの 隣に配置してください。

source: This should again compile without problems. We finally need to configure a logging system - Hibernate uses commons logging and leaves you the choice between Log4j and JDK 1.4 logging. Most developers prefer Log4j: copy <literal>log4j.properties</literal> from the Hibernate distribution (it's in the <literal>etc/</literal> directory) to your <literal>src</literal> directory, next to <literal>hibernate.cfg.xml</literal>. Have a look at the example configuration and change the settings if you like to have more verbose output. By default, only Hibernate startup message are shown on stdout.
fr_fr: Cela devrait encore compiler sans problème. Nous avons finalement besoin de configurer le système de "logs" - Hibernate utilise commons-logging et vous laisse le choix entre log4j et le système de logs du JDK 1.4. La plupart des développeurs préfèrent log4j : copiez <literal>log4j.properties</literal> de la distribution d'Hibernate (il est dans le répertoire <literal>etc/</literal>) dans votre répertoire <literal>src</literal>, puis faites de même avec <literal>hibernate.cfg.xml</literal>. Regardez la configuration d'exemple et changez les paramètres si vous voulez une sortie plus verbeuse. Par défaut, seul le message de démarrage d'Hibernate est affiché sur la sortie standard.
ja_jp: これは問題なく再コンパイルできるはずです。 最後にロギングシステムを設定する必要があります。 Hibernateはcommons loggingを使うため、Log4jとJDK 1.4 loggingの選択をする必要がありません。 ほとんどの開発者が好むのはLog4jです。 Hibernateディストリビューション（の<literal>etc/</literal> ディレクトリ）から <literal>log4j.properties</literal> をあなたの <literal>src</literal> ディレクトリ内の <literal>hibernate.cfg.xml</literal> の隣にコピーしてください。 設定例を見て、冗長な出力がよければ設定を変更してください。 デフォルトではHibernateのスタートアップメッセージだけが標準出力に表示されます。

source: The tutorial infrastructure is complete - and we are ready to do some real work with Hibernate.
fr_fr: L'infrastructure de ce didacticiel est complète - et nous sommes prêts à effectuer un travail réel avec Hibernate.
ja_jp: チュートリアルのインフラは完全です。 Hibernateを使って実際の作業をする準備が整いました。

source: Loading and storing objects
fr_fr: Charger et stocker des objets
ja_jp: オブジェクトのロードと格納

source: Finally, we can use Hibernate to load and store objects. We write an <literal>EventManager</literal> class with a <literal>main()</literal> method:
fr_fr: Finalement nous pouvons utiliser Hibernate pour charger et stocker des objets. Nous écrivons une classe <literal>EventManager</literal> avec une méthode <literal>main()</literal> :
ja_jp: ついにオブジェクトのロードと格納にHibernateを使うことができます。 <literal>main()</literal> メソッドを持つ <literal>EventManager</literal> クラスを書きます：

source: We create a new <literal>Event</literal> object, and hand it over to Hibernate. Hibernate now takes care of the SQL and executes <literal>INSERT</literal>s on the database. Let's have a look at the <literal>Session</literal> and <literal>Transaction</literal>-handling code before we run this.
fr_fr: Nous créons un nouvel objet <literal>Event</literal>, et le remettons à Hibernate. Hibernate s'occupe maintenant du SQL et exécute les <literal>INSERT</literal>s dans la base de données. Regardons le code de gestion de la <literal>Session</literal> et de la <literal>Transaction</literal> avant de lancer ça.
ja_jp: 新しい <literal>Event</literal> オブジェクトを生成し、それをHibernateに渡します。 今ではHibernateがSQLを処理し、データベースで <literal>INSERT</literal> を実行します。 実行前に <literal>Session</literal> と <literal>Transaction</literal> を処理するコードを確認してください。

source: A <literal>Session</literal> is a single unit of work. For now we'll keep things simple and assume a one-to-one granularity between a Hibernate <literal>Session</literal> and a database transaction. To shield our code from the actual underlying transaction system (in this case plain JDBC, but it could also run with JTA) we use the <literal>Transaction</literal> API that is available on the Hibernate <literal>Session</literal>.
fr_fr: Une <literal>Session</literal> est une unité de travail. Pour le moment, nous allons faire les choses simplement et assumer une granularité un-un entre une <literal>Session</literal> hibernate et une transaction à la base de données. Pour isoler notre code du système de transaction sous-jacent (dans notre cas, du pure JDBC, mais cela pourrait être JTA), nous utilisons l'API <literal>Transaction</literal> qui est disponible depuis la <literal>Session</literal> Hibernate.
ja_jp: <literal>Session</literal> は1つの作業単位(Unit of Work)です。 当分の間、話を簡単にするために、 <literal>Session</literal> と <literal>Transaction</literal> の対応を一対一と仮定します。 使用しているトランザクション・システム（このケースではJTAと共存できる単純なJDBC）からコードを保護するために、 Hibernate <literal>Session</literal> 上で利用可能な <literal>Transaction</literal> APIを使用します。

source: What does <literal>sessionFactory.getCurrentSession()</literal> do? First, you can call it as many times and anywhere you like, once you get hold of your <literal>SessionFactory</literal> (easy thanks to <literal>HibernateUtil</literal>). The <literal>getCurrentSession()</literal> method always returns the "current" unit of work. Remember that we switched the configuration option for this mechanism to "thread" in <literal>hibernate.cfg.xml</literal>? Hence, the current unit of work is bound to the current Java thread that executes our application. However, this is not the full picture, you also have to consider scope, when a unit of work begins and when it ends.
fr_fr: Que fait <literal>sessionFactory.getCurrentSession()</literal> ? Premièrement, vous pouvez l'invoquer autant de fois que vous le voulez et n'importe où du moment que vous avez votre <literal>SessionFactory</literal> (facile grâce à <literal>HibernateUtil</literal>). La méthode <literal>getCurrentSession()</literal> renvoie toujours l'unité de travail courante. Souvenez vous que nous avons basculé notre option de configuration au mécanisme basé sur le "thread" dans <literal>hibernate.cfg.xml</literal>. Par conséquent, le scope de l'unité de travail courante est le thread java courant d'exécution. Ceci n'est pas totalement vrai.
ja_jp: <literal>sessionFactory.getCurrentSession()</literal> はなにをするのでしょうか？ まず、いったん <literal>SessionFactory</literal> を取得し保持すれば （ <literal>HibernateUtil</literal> のおかげで簡単です）、このメソッドを何度でも、 どこからでも呼び出すことが出来ます。 <literal>getCurrentSession()</literal> メソッドは常に「現在の」作業単位(Unit of Work)を返します。 <literal>hibernate.cfg.xml</literal> のこの機能の設定で、"thread"を指定したことを思い出してください。 このため現在の作業単位のスコープは、このアプリケーションを実行する現在のJavaスレッドです。 しかしこれで全てではありません。
