<?xml version='1.0' encoding="UTF-8"?>
<!DOCTYPE preface PUBLIC "-//OASIS//DTD DocBook XML V4.5//EN" "http://www.oasis-open.org/docbook/xml/4.5/docbookx.dtd">

    <preface id="preface" revision="2">
        <title>Prefacio</title>


        <para>
            Trabajar con software orientado a objetos y una base de datos relacional puede ser
            inc&#x00f3;modo y consumir tiempo en los entornos de empresa de hoy. Hibernate es una
            herramienta de mapeo objeto/relacional para entornos Java. El t&#x00e9;rmino mapeo
            objeto/relacional (MOR) hace referencia a la t&#x00e9;cnica de mapear una
            representaci&#x00f3;n de datos desde un modelo de objetos a un modelo de datos relacional
            con un esquema basado en SQL.
        </para>

        <para>
            Hibernate no s&#x00f3;lo se encarga de mapear de clases Java a tablas de base de datos
            (y de tipos de datos de Java a tipos de datos SQL), sino que tambi&#x00e9;n provee
            facilidades de consulta y recuperaci&#x00f3;n de datos y puede reducir significativamente
            el tiempo de desarrollo que de otra forma se gasta en el manejo de los datos en SQL y JDBC.
        </para>

        <para>
            La meta de Hibernate es relevar al desarrollador del 95 por ciento de las tareas comunes
            relacionadas a la programaci&#x00f3;n de la persistencia de los datos.
            Hibernate puede no ser la mejor soluci&#x00f3;n para aplicaciones que usan solamente
            procedimientos almacenados para implementar la l&#x00f3;gica de negocio en la base de
            datos, es mas &#x00fa;til con modelos de dominio orientados a objetos y l&#x00f3;gica de
            negocio en middle-tier basada en Java. Sin embargo, Hibernate ciertamente puede ayudarte
            a quitar o encapsular c&#x00f3;digo SQL espec&#x00ed;fico de vendedor y ayudar&#x00e1;
            con la tarea com&#x00fa;n de traducci&#x00f3;n de resultados desde una representaci&#x00f3;n
            tabular a un grafo de objetos.
        </para>

        <para>
            Si eres nuevo en Hibernate y lo del Mapeo Objeto/Relacional o incluso en Java,
            sigue por favor estos pasos:
        </para>

        <orderedlist>
            <listitem>
                <para>
                    Lee <xref linkend="quickstart"/> para un tutorial de 30 minutos, usando Tomcat.
                </para>
            </listitem>
            <listitem>
                <para>
                    Lee <xref linkend="architecture"/> para entender los entornos en los que
                    puede ser usado Hibernate.
                </para>
            </listitem>
            <listitem>
                <para>
                    Dale una mirada al directorio <literal>eg/</literal> en la distribuci&#x00f3;n
                    de Hibernate, contiene una aplicaci&#x00f3;n independiente simple.
                    Copia tu driver JDBC al directorio <literal>lib/</literal> y edita
                    <literal>etc/hibernate.properties</literal>, especificando los valores
                    correctos para tu base de datos. Desde l&#x00ed;nea de comandos en el
                    directorio de la distribuci&#x00f3;n, tipea <literal>ant eg</literal>
                    (usando Ant), o bajo Windows, tipea <literal>build eg</literal>.
                </para>
            </listitem>
            <listitem>
                <para>
                    Usa esta documentaci&#x00f3;n de referencia como tu fuente de informaci&#x00f3;n
                    primaria. Ten en consideraci&#x00f3;n leer <emphasis>Java Persistence with Hibernate</emphasis>
                    (http://www.manning.com/bauer2) si necesitas mas ayuda con el dise&#x00f1;o
                    de aplicaciones o si prefieres un tutorial paso a paso.
                    Visita tambi&#x00e9;n http://caveatemptor.hibernate.org y descarga la aplicaci&#x00f3;n
                    de ejemplo para Java Persistence with Hibernate.
                </para>
            </listitem>
            <listitem>
				<para>
					Los FAQs son respondidos en el sitio web de Hibernate.
				</para>
            </listitem>
			<listitem>
				<para>
                                        En el sitio web de Hibernate hay enlaces a demos de terceros, ejemplos
                                        y tutoriales.
				</para>
			</listitem>
            <listitem>
                <para>
                    El Area de Comunidad en el sitio web de Hibernate es una buena fuente
                    de patrones de dise&#x00f1;o y varias soluciones de integraci&#x00f3;n
                    (Tomcat, JBoss, Struts, EJB, etc.).
                </para>
            </listitem>
         </orderedlist>

         <para>
             Si tienes preguntas, usa el foro de usuarios enlazado en el sitio web de Hibernate.
             Tambi&#x00e9;n proveemos un sistema de seguimiento JIRA para reportes de defectos y
             peticiones de nuevas caracter&#x00ed;sticas.
             Si estas interesado en el desarrollo de Hibernate, &#x00fa;nete a la lista de correo
             de desarrolladores. Si estas interesado en traducir esta documentaci&#x00f3;n a tu
             lenguaje, cont&#x00e1;ctanos en la lista de correo de desarrolladores.
         </para>

         <para>
             A trav&#x00e9;s de JBoss Inc. (see http://www.hibernate.org/SupportTraining/) hay
             disponibilidad de soporte comercial de desarrollo, soporte de producci&#x00f3;n y
             entrenamiento en Hibernate.
             Hibernate es un proyecto de la suite de productos de c&#x00f3;digo abierto
             JBoss Professional.
         </para>

    </preface>
