Repository: hibernate/hibernate-orm
Catalog: documentation/manual/translations/*/content/example_parentchild.po
Languages: es_es, pt_br

source: We mentioned an alternative in the first paragraph. None of the above issues exist in the case of <literal>&lt;composite-element&gt;</literal> mappings, which have exactly the semantics of a parent / child relationship. Unfortunately, there are two big limitations to composite element classes: composite elements may not own collections, and they should not be the child of any entity other than the unique parent.
es_es: Hemos mencionado una alternativa en el primer p&#x00e1;rrafo. Ninguno de los temas anteriores existe en el caso de los mapeos <literal>&lt;composite-element&gt;</literal>, que tienen exactamente la sem&#x00e1;ntica de una relaci&#x00f3;n padre / hijo. Desafortunadamente, hay dos grandes limitaciones para las clases de elementos compuestos: los elementos compuestos no pueden poseer sus propias colecciones, y no deben ser el hijo de cualquier otra entidad que no sea su padre &#x00fa;nico.
pt_br: Nous avons évoqué une alternative dans le premier paragraphe. Aucun des points traités précédemment n'existe dans le cas d'un mapping <literal>&lt;composite-element&gt;</literal> qui possède exactement la sémantique d'une relation père / fils. Malheureusement, il y a deux grandes limitations pour les classes éléments composites : les éléments composites ne peuvent contenir de collections, et ils ne peuvent être les fils d'entités autres que l'unique parent.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: The following code will update <literal>parent</literal> and <literal>child</literal> and insert <literal>newChild</literal>.
pt_br: Le code suivant mettra à jour <literal>parent</literal> et <literal>child</literal> et insérera <literal>newChild</literal>.
