Repository: hibernate/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_criteria.po
Languages: es_es

source: Criteria Queries
es_es: Consultas por Criterios

source: Hibernate features an intuitive, extensible criteria query API.
es_es: Acompa&#x00f1;a a Hibernate una API de consultas por criterios intuitiva y extensible.

source: Creating a <literal>Criteria</literal> instance
es_es: Creando una instancia de <literal>Criteria</literal>

source: The interface <literal>org.hibernate.Criteria</literal> represents a query against a particular persistent class. The <literal>Session</literal> is a factory for <literal>Criteria</literal> instances.
es_es: La interface <literal>org.hibernate.Criteria</literal> representa una consulta contra una clase persistente en particular. La <literal>Session</literal> es una f&#x00e1;brica de instancias de <literal>Criteria</literal>.

source: Narrowing the result set
es_es: Estrechando el conjunto resultado

source: An individual query criterion is an instance of the interface <literal>org.hibernate.criterion.Criterion</literal>. The class <literal>org.hibernate.criterion.Restrictions</literal> defines factory methods for obtaining certain built-in <literal>Criterion</literal> types.
es_es: Un criterio individual de consulta es una instancia de la interface <literal>org.hibernate.criterion.Criterion</literal>. La clase <literal>org.hibernate.criterion.Restrictions</literal> define m&#x00e9;todos de f&#x00e1;brica para obtener ciertos tipos prefabricados de <literal>Criterion</literal>.

source: Restrictions may be grouped logically.
es_es: Las restricciones pueden ser agrupadas l&#x00f3;gicamente.

source: There are quite a range of built-in criterion types (<literal>Restrictions</literal> subclasses), but one that is especially useful lets you specify SQL directly.
es_es: Hay un gran rango de tipos de criterio prefabricados (subclases de <literal>Restrictions</literal>), pero uno que es especialmente útil te deja especificar SQL directamente.

source: <![CDATA[List cats = sess.createCriteria(Cat.class) .add( Restrictions.sqlRestriction("lower({alias}.name) like lower(?)", "Fritz%", Hibernate.STRING) ) .list();]]>
es_es: <![CDATA[List cats = sess.createCriteria(Cat.class) .add( Restrictions.sql("lower({alias}.name) like lower(?)", "Fritz%", Hibernate.STRING) ) .list();]]>

source: The <literal>{alias}</literal> placeholder with be replaced by the row alias of the queried entity.
es_es: El sitio <literal>{alias}</literal> ser&#x00e1; remplazado por el alias de fila de la entidad consultada.

source: An alternative approach to obtaining a criterion is to get it from a <literal>Property</literal> instance. You can create a <literal>Property</literal> by calling <literal>Property.forName()</literal>.
es_es: Un enfoque alternativo para obtener un criterio es tomarlo de una instancia de <literal>Property</literal>. Puedes crear una <literal>Property</literal> llamando a <literal>Property.forName()</literal>.

source: Ordering the results
es_es: Ordenando los resultados

source: You may order the results using <literal>org.hibernate.criterion.Order</literal>.
es_es: Puedes ordenar los resultados usando <literal>org.hibernate.criterion.Order</literal>.

source: Associations
es_es: Asociaciones

source: You may easily specify constraints upon related entities by navigating associations using <literal>createCriteria()</literal>.
es_es: Puedes especificar f&#x00e1;cilmente restricciones sobre las entidades relacionadas al navegar asociaciones usando <literal>createCriteria()</literal>.

source: note that the second <literal>createCriteria()</literal> returns a new instance of <literal>Criteria</literal>, which refers to the elements of the <literal>kittens</literal> collection.
es_es: nota que el segundo <literal>createCriteria()</literal> devuelve una nueva instancia de <literal>Criteria</literal>, que hace referencia a los elementos de la colecci&#x00f3;n <literal>kittens</literal>.

source: The following, alternate form is useful in certain circumstances.
es_es: La siguiente forma alternativa es útil en ciertas circunstancias.

source: (<literal>createAlias()</literal> does not create a new instance of <literal>Criteria</literal>.)
es_es: (<literal>createAlias()</literal> no crea una nueva instancia de <literal>Criteria</literal>.)

source: Note that the kittens collections held by the <literal>Cat</literal> instances returned by the previous two queries are <emphasis>not</emphasis> pre-filtered by the criteria! If you wish to retrieve just the kittens that match the criteria, you must use a <literal>ResultTransformer</literal>.
es_es: &#x00a1;Observa que las colecciones de gatitos tenidas por las instancias de <literal>Cat</literal> devueltas por las dos consultas previas <emphasis>no</emphasis> est&#x00e1;n prefiltradas por los criterios! Si deseas recuperar s&#x00f3;lo los gatitos que emparejen los criterios, debes usar <literal>returnMaps()</literal>.

source: <![CDATA[List cats = sess.createCriteria(Cat.class) .createCriteria("kittens", "kt") .add( Restrictions.eq("name", "F%") ) .setResultTransformer(Criteria.ALIAS_TO_ENTITY_MAP) .list(); Iterator iter = cats.iterator(); while ( iter.hasNext() ) { Map map = (Map) iter.next(); Cat cat = (Cat) map.get(Criteria.ROOT_ALIAS); Cat kitten = (Cat) map.get("kt"); }]]>
es_es: <![CDATA[List cats = sess.createCriteria(Cat.class) .createCriteria("kittens", "kt") .add( Restrictions.eq("name", "F%") ) .returnMaps() .list(); Iterator iter = cats.iterator(); while ( iter.hasNext() ) { Map map = (Map) iter.next(); Cat cat = (Cat) map.get(Criteria.ROOT_ALIAS); Cat kitten = (Cat) map.get("kt"); }]]>

source: Dynamic association fetching
es_es: Recuperaci&#x00f3;n din&#x00e1;mica de asociaciones

source: You may specify association fetching semantics at runtime using <literal>setFetchMode()</literal>.
es_es: Puedes especificar la sem&#x00e1;ntica de recuperaci&#x00f3;n de asociaciones en tiempo de ejecuci&#x00f3;n usando <literal>setFetchMode()</literal>.

source: This query will fetch both <literal>mate</literal> and <literal>kittens</literal> by outer join. See <xref linkend="performance-fetching"/> for more information.
es_es: Esta consulta recuperar&#x00e1; tanto <literal>mate</literal> como <literal>kittens</literal> por uni&#x00f3;n exterior (outer join). Ver <xref linkend="performance-fetching"/> para m&#x00e1;s informaci&#x00f3;n.

source: Example queries
es_es: Consultas por ejemplos

source: The class <literal>org.hibernate.criterion.Example</literal> allows you to construct a query criterion from a given instance.
es_es: La clase <literal>org.hibernate.criterion.Example</literal> te permite construir un criterio de consulta a partir de una instancia dada.

source: Version properties, identifiers and associations are ignored. By default, null valued properties are excluded.
es_es: Las propiedades de versi&#x00f3;n, los identificadores y las asociaciones son ignorados. Por defecto, las propiedades valuadas a nulo son exclu&#x00ed;das.

source: You can adjust how the <literal>Example</literal> is applied.
es_es: Puedes ajustar c&#x00f3;mo se aplica el <literal>Example</literal>.

source: You can even use examples to place criteria upon associated objects.
es_es: Puedes incluso usar ejemplos para colocar criterios sobre objetos asociados.

source: Projections, aggregation and grouping
es_es: Proyecciones, agregaci&#x00f3;n y agrupamiento

source: The class <literal>org.hibernate.criterion.Projections</literal> is a factory for <literal>Projection</literal> instances. We apply a projection to a query by calling <literal>setProjection()</literal>.
es_es: La clase <literal>org.hibernate.criterion.Projections</literal> es una f&#x00e1;brica de instancias de <literal>Projection</literal>. Aplicamos una proyecci&#x00f3;n a una consulta llamando a <literal>setProjection()</literal>.

source: There is no explicit "group by" necessary in a criteria query. Certain projection types are defined to be <emphasis>grouping projections</emphasis>, which also appear in the SQL <literal>group by</literal> clause.
es_es: No es necesario ningún "group by" expl&#x00ed;cito en una consulta por criterios. Ciertos tipos de proyecciones son definidos para ser <emphasis>proyecciones agrupadas</emphasis>, que adem&#x00e1;s aparecen en la cl&#x00e1;usula SQL <literal>group by</literal>.

source: An alias may optionally be assigned to a projection, so that the projected value may be referred to in restrictions or orderings. Here are two different ways to do this:
es_es: Puede opcionalmente asignarse un alias a una proyecci&#x00f3;n, de modo que el valor proyectado pueda ser referido en restricciones u ordenamientos. Aqu&#x00ed; hay dos formas diferentes de hacer esto:

source: The <literal>alias()</literal> and <literal>as()</literal> methods simply wrap a projection instance in another, aliased, instance of <literal>Projection</literal>. As a shortcut, you can assign an alias when you add the projection to a projection list:
es_es: Los m&#x00e9;todos <literal>alias()</literal> y <literal>as()</literal> simplemente envuelven una instancia de proyecci&#x00f3;n en otra instancia de <literal>Projection</literal> con alias. Como un atajo, puedes asignar un alias cuando agregas la proyecci&#x00f3;n a una lista de proyecciones:

source: You can also use <literal>Property.forName()</literal> to express projections:
es_es: Puedes tambi&#x00e9;n usar <literal>Property.forName()</literal> para expresar proyecciones:

source: Detached queries and subqueries
es_es: Consultas y subconsultas separadas

source: The <literal>DetachedCriteria</literal> class lets you create a query outside the scope of a session, and then later execute it using some arbitrary <literal>Session</literal>.
es_es: La clase <literal>DetachedCriteria</literal> te deja crear una consulta fuera del &#x00e1;mbito de una sesi&#x00f3;n, y entonces ejecutarla luego usando alguna <literal>Session</literal> arbitraria.

source: A <literal>DetachedCriteria</literal> may also be used to express a subquery. Criterion instances involving subqueries may be obtained via <literal>Subqueries</literal> or <literal>Property</literal>.
es_es: Tambi&#x00e9;n una <literal>DetachedCriteria</literal> puede usarse para expresar una subconsulta. Las instancias de Criterion implicando subconsultas pueden obtenerse v&#x00ed;a <literal>Subqueries</literal> o <literal>Property</literal>.

source: Even correlated subqueries are possible:
es_es: Incluso son posibles las subconsultas correlacionadas:

source: Queries by natural identifier
es_es: Consultas por identificador natural

source: For most queries, including criteria queries, the query cache is not very efficient, because query cache invalidation occurs too frequently. However, there is one special kind of query where we can optimize the cache invalidation algorithm: lookups by a constant natural key. In some applications, this kind of query occurs frequently. The criteria API provides special provision for this use case.
es_es: Para la mayor&#x00ed;a de consultas, incluyendo las consultas por criterios, el cach&#x00e9; de consulta no es muy eficiente, debido a que la invalidaci&#x00f3;n del cach&#x00e9; de consulta ocurre demasiado frecuentemente. Sin embargo, hay un tipo especial de consulta donde podemos optimizar el algoritmo de invalidaci&#x00f3;n de cach&#x00e9;: búsquedas por una clave natural constante. En algunas aplicaciones, este tipo de consulta, ocurre frecuentemente. La API de criterios brinda especial provisi&#x00f3;n para este caso de uso.

source: First, you should map the natural key of your entity using <literal>&lt;natural-id&gt;</literal>, and enable use of the second-level cache.
es_es: Primero, debes mapear la clave natural de tu entidad usando <literal>&lt;natural-id&gt;</literal>, y habilitar el uso del cach&#x00e9; de segundo nivel.

source: Note that this functionality is not intended for use with entities with <emphasis>mutable</emphasis> natural keys.
es_es: Nota que esta funcionalidad no est&#x00e1; pensada para uso con entidades con claves naturales <emphasis>mutable</emphasis>.

source: Next, enable the Hibernate query cache.
es_es: Seguido, habilita el cach&#x00e9; de consulta de Hibernate.

source: Now, <literal>Restrictions.naturalId()</literal> allows us to make use of the more efficient cache algorithm.
es_es: Ahora, <literal>Restrictions.naturalId()</literal> nos permite hacer uso de el algoritmo de cach&#x00e9; m&#x00e1;s eficiente.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
