Repository: hibernate/hibernate-orm
Catalog: documentation/manual/translations/*/content/tutorial.po
Languages: es_es

source: Related to the unit of work scope, should the Hibernate <literal>Session</literal> be used to execute one or several database operations? The above example uses one <literal>Session</literal> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope of a Hibernate <literal>Session</literal> is flexible but you should never design your application to use a new Hibernate <literal>Session</literal> for <emphasis>every</emphasis> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real (web) application is shown later in this tutorial.
es_es: Una <literal>Session</literal> es una sola unidad de trabajo. Podr&#x00ed;a sorprenderte que tengamos una API adicional, <literal>Transaction</literal>. Esto implica que una unidad de trabajo puede ser "m&#x00e1;s larga" que una sola transacci&#x00f3;n de base de datos; imagina una unidad de trabajo que se abarca varios ciclos petici&#x00f3;n/respuesta HTTP (por ejemplo, un di&#x00e1;logo asistente) en una aplicaci&#x00f3;n web. Separar las transacciones de base de datos de "las unidades de trabajo de la aplicaci&#x00f3;n desde el punto de vista del usuario" es uno de los conceptos b&#x00e1;sicos de dise&#x00f1;o de Hibernate. Llamamos una unidad de trabajo larga <emphasis>Transacci&#x00f3;n de Aplicaci&#x00f3;n</emphasis>, usualmente encapsulando varias transacciones de base de datos m&#x00e1;s cortas. Por ahora mantendremos las cosas simples y asumiremos una granularidad uno-a-uno entre una <literal>Session</literal> y una <literal>Transaction</literal>.

source: Have a look at <xref linkend="transactions"/> for more information about transaction handling and demarcation. We also skipped any error handling and rollback in the previous example.
es_es: ٯQu&#x00e9; es lo que hacen <literal>Transaction.begin()</literal> y <literal>commit()</literal>? ٯD&#x00f3;nde est&#x00e1; el rollback en caso que algo vaya mal? La API de <literal>Transaction</literal> de Hibernate es opcional realmente, pero la usamos por conveniencia y portabilidad. Si manejases la transacci&#x00f3;n de base de datos por ti mismo (por ejemplo, llamando a <literal>session.connection.commit()</literal>), ligar&#x00ed;as el c&#x00f3;digo a un entorno de despliegue particular, en este JDBC directo no manejado. Estableciendo la f&#x00e1;brica de <literal>Transaction</literal> en tu configuraci&#x00f3;n de Hibernate puedes desplegar tu capa de persistencia en cualquier sitio. Echa una mirada al <xref linkend="transactions"/> para m&#x00e1;s informaci&#x00f3;n sobre manejo y demarcaci&#x00f3;n de transacciones. Hemos saltado tambi&#x00e9;n cualquier manejo de excepciones y rollback en este ejemplo.

source: To run this first routine we have to add a callable target to the Ant build file:
es_es: Para ejecutar la primera rutina tenemos que agregar un objetivo llamable al fichero de construcci&#x00f3;n de Ant:

source: <![CDATA[<target name="run" depends="compile"> <java fork="true" classname="events.EventManager" classpathref="libraries"> <classpath path="${targetdir}"/> <arg value="${action}"/> </java> </target>]]>
es_es: <![CDATA[<target name="run" depends="compile"> <java fork="true" classname="EventManager" classpathref="libraries"> <classpath path="${targetdir}"/> <arg value="${action}"/> </java> </target>]]>

source: The value of the <literal>action</literal> argument is set on the command line when calling the target:
es_es: El valor del argumento <literal>action</literal> es establecido por l&#x00ed;nea de comandos al llamar al objetivo:

source: You should see, after compilation, Hibernate starting up and, depending on your configuration, lots of log output. At the end you will find the following line:
es_es: Debes ver, despu&#x00e9;s de la compilaci&#x00f3;n, a Hibernate arrancando y, dependiendo de tu configuraci&#x00f3;n mucha salida de registro (log). Al final encontrar&#x00e1;s la siguiente l&#x00ed;nea:

source: This is the <literal>INSERT</literal> executed by Hibernate, the question marks represent JDBC bind parameters. To see the values bound as arguments, or to reduce the verbosity of the log, check your <literal>log4j.properties</literal>.
es_es: Esta es la <literal>INSERT</literal> ejecutada por Hibernate, los signos de preguntas representan par&#x00e1;metros de ligado JDBC. Para ver los valores ligados como argumentos, o para reducir la verborragia del registro, chequea tu <literal>log4j.properties</literal>.

source: Now we'd like to list stored events as well, so we add an option to the main method:
es_es: Ahora quisi&#x00e9;ramos listar acontecimientos almacenados tambi&#x00e9;n, as&#x00ed; que agregamos una opci&#x00f3;n al m&#x00e9;todo principal:

source: We also add a new <literal>listEvents() method</literal>:
es_es: Agregamos tambi&#x00e9;n un nuevo m&#x00e9;todo <literal>listEvents()</literal>:

source: <![CDATA[private List listEvents() { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); List result = session.createQuery("from Event").list(); session.getTransaction().commit(); return result; }]]>
es_es: <![CDATA[private List listEvents() { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); List result = session.createQuery("from Event").list(); tx.commit(); session.close(); return result; }]]>

source: What we do here is use an HQL (Hibernate Query Language) query to load all existing <literal>Event</literal> objects from the database. Hibernate will generate the appropriate SQL, send it to the database and populate <literal>Event</literal> objects with the data. You can create more complex queries with HQL, of course.
es_es: Lo que hacemos aqu&#x00ed; es usar una consulta HQL (Lenguaje de Consulta de Hibernate o Hibernate Query Language) para cargar todos los objetos <literal>Event</literal> existentes de la base de datos. Hibernate generar&#x00e1; el SQL apropiado, lo enviar&#x00e1; a la base de datosy poblar&#x00e1; los objetos <literal>Event</literal> con datos. Puedes, por supuesto, crear consultas m&#x00e1;s complejas con HQL.

source: Now, to execute and test all of this, follow these steps:
es_es: Si ahora llamas a Ant con <literal>-Daction=list</literal>, debes ver los eventos que has almacenado hasta ahora. Puede sorprenderte que esto no funcione, al menos si has seguido este tutorial paso por paso; el resultado siempre estar&#x00e1; vac&#x00ed;o. La razon de esto es la opci&#x00f3;n <literal>hbm2ddl.auto</literal> en la configuraci&#x00f3;n de Hibernate: Hibernate recrear&#x00e1; la base de datos en cada ejecuci&#x00f3;n. Deshabil&#x00ed;tala quitando la opci&#x00f3;n, y ver&#x00e1;s resultados en tu listado despu&#x00e9;s que llames a la acci&#x00f3;n <literal>store</literal> unas cuantas veces. La generaci&#x00f3;n y exportaci&#x00f3;n de esquema es &#x00fa;til mayormente en testeo unitario.

source: Run <literal>ant run -Daction=store</literal> to store something into the database and, of course, to generate the database schema before through hbm2ddl.
es_es: Part 2 - Mapeando asociaciones

source: Now disable hbm2ddl by commenting out the property in your <literal>hibernate.cfg.xml</literal> file. Usually you only leave it turned on in continous unit testing, but another run of hbm2ddl would <emphasis>drop</emphasis> everything you have stored - the <literal>create</literal> configuration setting actually translates into "drop all tables from the schema, then re-create all tables, when the SessionFactory is build".
es_es: Hemos mapeado un clase de entidad persistente a una tabla. Construyamos sobre esto y agreguemos algunas asociaciones de clase. Primero agregaremos personas a nuestra aplicaci&#x00f3;n, y almacenaremos una lista de eventos en las que participan.

source: If you now call Ant with <literal>-Daction=list</literal>, you should see the events you have stored so far. You can of course also call the <literal>store</literal> action a few times more.
es_es: Mapeando la clase Person

source: Note: Most new Hibernate users fail at this point and we see questions about <emphasis>Table not found</emphasis> error messages regularly. However, if you follow the steps outlined above you will not have this problem, as hbm2ddl creates the database schema on the first run, and subsequent application restarts will use this schema. If you change the mapping and/or database schema, you have to re-enable hbm2ddl once again.
es_es: El primer corte de la clase <literal>Person</literal> es simple:

source: Part 2 - Mapping associations
es_es: <![CDATA[public class Person { private Long id; private int age; private String firstname; private String lastname; Person() {} // Accessor methods for all properties, private setter for 'id' }]]>

source: We mapped a persistent entity class to a table. Let's build on this and add some class associations. First we'll add people to our application, and store a list of events they participate in.
es_es: Crea un fichero de mapeo llamado <literal>Person.hbm.xml</literal>:

source: Mapping the Person class
es_es: <![CDATA[<hibernate-mapping> <class name="Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="increment"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> </class> </hibernate-mapping>]]>

source: The first cut of the <literal>Person</literal> class is simple:
es_es: Finalmente, agrega el nuevo mapeo a la configuraci&#x00f3;n de Hibernate:

source: <![CDATA[package events; public class Person { private Long id; private int age; private String firstname; private String lastname; public Person() {} // Accessor methods for all properties, private setter for 'id' }]]>
es_es: <![CDATA[ <mapping resource="Event.hbm.xml"/> <mapping resource="Person.hbm.xml"/> ]]>

source: Create a new mapping file called <literal>Person.hbm.xml</literal> (don't forget the DTD reference at the top):
es_es: Crearemos ahora una asociaci&#x00f3;n entre estas dos entidades. Obviamente, las personas pueden participar en eventos, y los eventos tienen participantes. Las cuestiones de dise&#x00f1;o con que tenemos que tratar son: direccionalidad, multiplicidad y comportamiento de colecci&#x00f3;n.

source: <![CDATA[<hibernate-mapping> <class name="events.Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="native"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> </class> </hibernate-mapping>]]>
es_es: Una asociaci&#x00f3;n unidireccional basada en Set

source: Finally, add the new mapping to Hibernate's configuration:
es_es: Agregaremos una colecci&#x00f3;n de eventos a la clase <literal>Person</literal>. De esta forma podemos navegar facilmente a los eventos de una persona en particular, sin ejecutar una consulta expl&#x00ed;cita, llamando a <literal>aPerson.getEvents()</literal>. Usamos una colecci&#x00f3;n Java, un <literal>Set</literal>, porque la colecci&#x00f3;n no contendr&#x00e1; elementos duplicados y el ordenamiento no nos es relevante.

source: <![CDATA[<mapping resource="events/Event.hbm.xml"/> <mapping resource="events/Person.hbm.xml"/>]]>
es_es: Hasta ahora hemos dise&#x00f1;ado asociaciones unidireccionales multivaluadas, implementadas con un <literal>Set</literal>. Escribamos el c&#x00f3;digo para esto en las clases Java y luego lo mapeemos:

source: We'll now create an association between these two entities. Obviously, persons can participate in events, and events have participants. The design questions we have to deal with are: directionality, multiplicity, and collection behavior.
es_es: <![CDATA[public class Person { private Set events = new HashSet(); public Set getEvents() { return events; } public void setEvents(Set events) { this.events = events; } }]]>

source: A unidirectional Set-based association
es_es: Antes que mapeemos esta asociaci&#x00f3;n, piensa sobre el otro lado. Claramente, podemos mantener esto solamente unidireccional. O podemos crear otra colecci&#x00f3;n en el <literal>Event</literal>, si queremos ser capaces de navegarlos bidireccionalmente; por ejemplo, <literal>anEvent.getParticipants()</literal>. Esta es una elecci&#x00f3;n de dise&#x00f1;o que recae en ti, pero lo que est&#x00e1; claro de esta discusi&#x00f3;n es la multiplicidad de la asociaci&#x00f3;n: "multi" valuada a ambos lados, llamamos a esto una asociaci&#x00f3;n <emphasis>muchos-a-muchos</emphasis>. Por lo tanto, usamos un mapeo many-to-many de Hibernate:

source: We'll add a collection of events to the <literal>Person</literal> class. That way we can easily navigate to the events for a particular person, without executing an explicit query - by calling <literal>aPerson.getEvents()</literal>. We use a Java collection, a <literal>Set</literal>, because the collection will not contain duplicate elements and the ordering is not relevant for us.
es_es: <![CDATA[<class name="Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="increment"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> <set name="events" table="PERSON_EVENT"> <key column="PERSON_ID"/> <many-to-many column="EVENT_ID" class="Event"/> </set> </class>]]>

source: We need a unidirectional, many-valued associations, implemented with a <literal>Set</literal>. Let's write the code for this in the Java classes and then map it:
es_es: Hibernate soporta todo tipo de mapeos de colecci&#x00f3;n, siendo el m&#x00e1;s com&#x00fa;n un <literal>&lt;set&gt;</literal>. Para una asociaci&#x00f3;n muchos-a-muchos (o relaci&#x00f3;n de entidad <emphasis>n:m</emphasis>), se necesita una tabla de asociaci&#x00f3;n. Cada fila en esta tabla representa un enlace entre una persona y un evento. Esta tabla se configura con el atributo <literal>table</literal> del elemento <literal>set</literal>. El nombre de la columna identificadora en la asociaci&#x00f3;n, para el lado de la persona, se define con el elemento <literal>&lt;key&gt;</literal>. El nombre de columna para el lado del evento se define con el atributo <literal>column</literal> del <literal>&lt;many-to-many&gt;</literal>. Tambi&#x00e9;n tienes que decirle a Hibernate la clase de los objetos en tu colecci&#x00f3;n (correcto: la clase del otro lado de la colecci&#x00f3;n de referencias).

source: <![CDATA[public class Person { private Set events = new HashSet(); public Set getEvents() { return events; } public void setEvents(Set events) { this.events = events; } }]]>
es_es: El esquema de base de datos para este mapeo es, por lo tanto:

source: Before we map this association, think about the other side. Clearly, we could just keep this unidirectional. Or, we could create another collection on the <literal>Event</literal>, if we want to be able to navigate it bi-directional, i.e. <literal>anEvent.getParticipants()</literal>. This is not necessary, from a functional perspective. You could always execute an explicit query to retrieve the participants for a particular event. This is a design choice left to you, but what is clear from this discussion is the multiplicity of the association: "many" valued on both sides, we call this a <emphasis>many-to-many</emphasis> association. Hence, we use Hibernate's many-to-many mapping:
es_es: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | |_____________| |__________________| | PERSON | | | | | |_____________| | *EVENT_ID | <--> | *EVENT_ID | | | | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | |_____________| | FIRSTNAME | | LASTNAME | |_____________| ]]>

source: <![CDATA[<class name="events.Person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="native"/> </id> <property name="age"/> <property name="firstname"/> <property name="lastname"/> <set name="events" table="PERSON_EVENT"> <key column="PERSON_ID"/> <many-to-many column="EVENT_ID" class="events.Event"/> </set> </class>]]>
es_es: Trabajando la asociaci&#x00f3;n

source: Hibernate supports all kinds of collection mappings, a <literal>&lt;set&gt;</literal> being most common. For a many-to-many association (or <emphasis>n:m</emphasis> entity relationship), an association table is needed. Each row in this table represents a link between a person and an event. The table name is configured with the <literal>table</literal> attribute of the <literal>set</literal> element. The identifier column name in the association, for the person's side, is defined with the <literal>&lt;key&gt;</literal> element, the column name for the event's side with the <literal>column</literal> attribute of the <literal>&lt;many-to-many&gt;</literal>. You also have to tell Hibernate the class of the objects in your collection (correct: the class on the other side of the collection of references).
es_es: Traigamos alguna gente y eventos juntos en un nuevo m&#x00e9;todo en <literal>EventManager</literal>:

source: The database schema for this mapping is therefore:
es_es: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); aPerson.getEvents().add(anEvent); tx.commit(); HibernateUtil.closeSession(); }]]>

source: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | |_____________| |__________________| | PERSON | | | | | |_____________| | *EVENT_ID | <--> | *EVENT_ID | | | | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | |_____________| | FIRSTNAME | | LASTNAME | |_____________| ]]>
es_es: Despu&#x00e9;s de cargar una <literal>Person</literal> y un <literal>Event</literal>, simplemente modifica la colecci&#x00f3;n usando sus m&#x00e9;todos normales. Como puedes ver, no hay una llamada expl&#x00ed;cita a <literal>update()</literal> o <literal>save()</literal>. Hibernate detecta autom&#x00e1;ticamente que la colecci&#x00f3;n ha sido modificada y necesita ser salvada. Esto es llamado <emphasis>chequeo sucio autom&#x00f3;tico (automatic dirty checking)</emphasis>, y tambi&#x00e9;n puedes intentarlo modificando el nombre de la propiedad de fecha de cualquiera de tus objetos. Mientras est&#x00e9;n en estado <emphasis>persistente</emphasis>, esto es, ligados a una <literal>Session</literal> de Hibernate particular (es decir, justo han sido cargados o almacenados en una unidad de trabajo), Hibernate monitoriza cualquier cambio y ejecuta SQL en estilo escribe-por-detr&#x00e1;s. El proceso de sincronizaci&#x00f3;n del estado de memoria con la base de datos, usualmente s&#x00f3;lo al final de una unidad de trabajo, es llamado <emphasis>limpieza (flushing)</emphasis>.

source: Working the association
es_es: Podr&#x00ed;as, por supuesto, cargar persona y evento en unidades de trabajo diferentes. O modificas un objeto fuera de una <literal>Session</literal>, cuando no est&#x00e1; en estado persistente (si antes era persistente llamamos a este estado <emphasis>separado (detached) </emphasis>). En c&#x00f3;digo (no muy realista), esto se ver&#x00ed;a como sigue:

source: Let's bring some people and events together in a new method in <literal>EventManager</literal>:
es_es: <![CDATA[ private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.currentSession(); Transaction tx = session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); tx.commit(); HibernateUtil.closeSession(); aPerson.getEvents().add(anEvent); // aPerson is detached Session session2 = HibernateUtil.currentSession(); Transaction tx2 = session.beginTransaction(); session2.update(aPerson); // Reattachment of aPerson tx2.commit(); HibernateUtil.closeSession(); } ]]>

source: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); Event anEvent = (Event) session.load(Event.class, eventId); aPerson.getEvents().add(anEvent); session.getTransaction().commit(); }]]>
es_es: La llamada a <literal>update</literal> hace a un objeto persistente de nuevo, podr&#x00ed;as decir que la liga a una nueva unidad de trabajo, de modo que cualquier modificaci&#x00f3;n que le hagas mientras est&#x00e9; separado puede ser salvada a base de datos.

source: After loading a <literal>Person</literal> and an <literal>Event</literal>, simply modify the collection using the normal collection methods. As you can see, there is no explicit call to <literal>update()</literal> or <literal>save()</literal>, Hibernate automatically detects that the collection has been modified and needs to be updated. This is called <emphasis>automatic dirty checking</emphasis>, and you can also try it by modifying the name or the date property of any of your objects. As long as they are in <emphasis>persistent</emphasis> state, that is, bound to a particular Hibernate <literal>Session</literal> (i.e. they have been just loaded or saved in a unit of work), Hibernate monitors any changes and executes SQL in a write-behind fashion. The process of synchronizing the memory state with the database, usually only at the end of a unit of work, is called <emphasis>flushing</emphasis>. In our code, the unit of work ends with a commit (or rollback) of the database transaction - as defined by the <literal>thread</literal> configuration option for the <literal>CurrentSessionContext</literal> class.
es_es: Bueno, esto no es muy usado en nuestra situaci&#x00f3;n actual, pero es un concepto importante que puedes dise&#x00f1;ar en tu propia aplicaci&#x00f3;n. Por ahora, completa este ejercicio agregando una nueva acci&#x00f3;n al m&#x00e9;todo main de <literal>EventManager</literal> y ll&#x00e1;mala desde la l&#x00ed;nea de comandos. Si necesitas los identificadores de una persona o evento, el m&#x00e9;todo <literal>save()</literal> los devuelve.

source: You might of course load person and event in different units of work. Or you modify an object outside of a <literal>Session</literal>, when it is not in persistent state (if it was persistent before, we call this state <emphasis>detached</emphasis>). You can even modify a collection when it is detached:
es_es: Esto fue un ejemplo de una asociaci&#x00f3;n entre dos clases igualmente importantes, dos entidades. Como se ha mencionado anteriormente, hay otras clases y tipos en un modelo t&#x00ed;pico, usualmente "menos importantes". Algunos ya los habr&#x00e1;s visto, como un <literal>int</literal> o un <literal>String</literal>. Llamamos a estas clases <emphasis>tipos de valor (value types)</emphasis>, y sus instancias <emphasis>dependen</emphasis> de una entidad en particular. Las instancias de estos tipos no tienen su propia identidad, ni son compartidas entre entidades (dos personas no referencian el mismo objeto <literal>firstname</literal>, incluso si tuvieran el mismo primer nombre). Por supuesto, los tipos de valor no s&#x00f3;lo pueden encontrarse en el JDK (de hecho, en una aplicaci&#x00f3;n Hibernate todas las clases del JDK son consideradas tipos de valor), sino que adem&#x00e1;s puedes escribir por ti mismo clases dependientes, por ejemplo, <literal>Address</literal> o <literal>MonetaryAmount</literal>.
