Repository: hibernate/hibernate-orm
Catalog: documentation/manual/translations/*/content/tutorial.po
Languages: es_es

source: Introduction to Hibernate
es_es: Introducci&#x00f3;n a Hibernate

source: Preface
es_es: Prefacio

source: This chapter is an introductory tutorial for new users of Hibernate. We start with a simple command line application using an in-memory database and develop it in easy to understand steps.
es_es: Este cap&#x00ed;tulo es un tutorial introductorio de Hibernate. Comenzamos con una aplicaci&#x00f3;n simple de l&#x00ed;nea de comandos usando un base de datos en-memoria y desarroll&#x00e1;ndola en f&#x00e1;cil para entender los pasos.

source: This tutorial is intended for new users of Hibernate but requires Java and SQL knowledge. It is based on a tutorial by Michael Gloegl, the third-party libraries we name are for JDK 1.4 and 5.0. You might need others for JDK 1.3.
es_es: Este tutorial est&#x00e1; concebido para usuarios nuevos de Hibernate pero requiere conocimiento en Java y SQL. Est&#x00e1; basado en un tutorial de Michael Gloegl. Las bibliotecas de terceros que mencionamos son para JDK 1.4 y 5.0. Podr&#x00ed;as necesitar otras para JDK 1.3.

source: The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
es_es: Parte 1 - La primera Aplicaci&#x00f3;n Hibernate

source: Part 1 - The first Hibernate Application
es_es: Primero, crearemos una aplicaci&#x00f3;n simple de Hibenate basada en consola. Usamos usamos una base de datos en-memoria (HSQL DB), de modo que no necesitamos instalar ning&#x00fa;n servidor de base de datos.

source: First, we'll create a simple console-based Hibernate application. We use an Java database (HSQL DB), so we do not have to install any database server.
es_es: Asumamos que necesitamos una aplicaci&#x00f3;n peque&#x00f1;a de base de datos que pueda almacenar eventos que queremos atender, e informaci&#x00f3;n acerca de los hostales de estos eventos.

source: Let's assume we need a small database application that can store events we want to attend, and information about the hosts of these events.
es_es: La primera cosa que hacemos, es armar nuestro directorio de desarrollo y poner en &#x00e9;l todas las bibliotecas Java que necesitamos. Descarga la distribuci&#x00f3;n de Hibernate del sitio web de Hibernate. Extrae el paquete y coloca todas las bibliotecas requeridas encontradas en <literal>/lib</literal> dentro del directorio <literal>/lib</literal> de nuestro nuevo directorio de desarrollo de trabajo. Debe asemejarse a esto:

source: The first thing we do, is set up our development directory and put all the Java libraries we need into it. Download the Hibernate distribution from the Hibernate website. Extract the package and place all required libraries found in <literal>/lib</literal> into into the <literal>/lib</literal> directory of your new development working directory. It should look like this:
es_es: <![CDATA[. +lib antlr.jar cglib-full.jar asm.jar asm-attrs.jars commons-collections.jar commons-logging.jar ehcache.jar hibernate3.jar jta.jar dom4j.jar log4j.jar ]]>

source: <![CDATA[. +lib antlr.jar cglib.jar asm.jar asm-attrs.jars commons-collections.jar commons-logging.jar hibernate3.jar jta.jar dom4j.jar log4j.jar ]]>
es_es: Este es el conjunto m&#x00ed;nimo de bibliotecas requeridas para Hibernate (observa que tambi&#x00e9;n hemos copiado hibernate3.jar, el fichero principal). Ver el fichero <literal>README.txt</literal> en el directorio <literal>lib/</literal> de la distribuci&#x00f3;n de Hibernate para m&#x00e1;s informaci&#x00f3;n sobre bibliotecas de terceros requeridas y opcionales. (Realmente, Log4J no es requerida aunque preferida por muchos desarrolladores).

source: This is the minimum set of required libraries (note that we also copied hibernate3.jar, the main archive) for Hibernate <emphasis>at the time of writing</emphasis>. The Hibernate release you are using might require more or less libraries. See the <literal>README.txt</literal> file in the <literal>lib/</literal> directory of the Hibernate distribution for more information about required and optional third-party libraries. (Actually, Log4j is not required but preferred by many developers.)
es_es: Por siguiente, creamos una clase que represente el evento que queremos almacenar en base de datos.

source: Next we create a class that represents the event we want to store in database.
es_es: La primera clase

source: The first class
es_es: Nuestra primera clase persistente es un JavaBean simple con algunas propiedades:

source: Our first persistent class is a simple JavaBean class with some properties:
es_es: <![CDATA[import java.util.Date; public class Event { private Long id; private String title; private Date date; Event() {} public Long getId() { return id; } private void setId(Long id) { this.id = id; } public Date getDate() { return date; } public void setDate(Date date) { this.date = date; } public String getTitle() { return title; } public void setTitle(String title) { this.title = title; } }]]>

source: <![CDATA[package events; import java.util.Date; public class Event { private Long id; private String title; private Date date; public Event() {} public Long getId() { return id; } private void setId(Long id) { this.id = id; } public Date getDate() { return date; } public void setDate(Date date) { this.date = date; } public String getTitle() { return title; } public void setTitle(String title) { this.title = title; } }]]>
es_es: Puedes ver que esta clase usa las convenciones de nombrado est&#x00e1;ndar de JavaBean para m&#x00e9;todos getter y setter de propiedad, as&#x00ed; como visibilidad privada para los campos. Esto es un dise&#x00f1;o recomendado, aunque no requerido. Hibernate tambi&#x00e9;n puede acceder a los campos directamente; el beneficio de los m&#x00e9;todos de acceso es la robustez para la refactorizaci&#x00f3;n.

source: You can see that this class uses standard JavaBean naming conventions for property getter and setter methods, as well as private visibility for the fields. This is a recommended design - but not required. Hibernate can also access fields directly, the benefit of accessor methods is robustness for refactoring. The no-argument constructor is required to instantiate an object of this class through reflection.
es_es: La propiedad <literal>id</literal> tiene un valor &#x00fa;nico de identificador para un evento en particular. Todas las clase de entidad persistentes ( tambi&#x00e9;n hay clases dependientes menos importantes) necesitar&#x00e1;n una propiedad identificadora similar si queremos usar el conjunto completo de funcionalidades de Hibernate. De hecho, la mayor&#x00ed;a de las aplicaciones (esp. aplicaciones web) necesitan distinguir objetos por identificador, de modo que debes considerar esto como un aspecto en vez de una limitaci&#x00f3;n. Sin embargo, usualmente no manipulamos la identidad de un objeto, por lo tanto el m&#x00e9;todo setter debe ser privado. S&#x00f3;lo Hibernate asignar&#x00e1; identificadores cuando un objeto sea salvado. Puedes ver que Hibernate puede acceder a m&#x00e9;todos de acceso p&#x00fa;blicos, privados y protegidos, tanto como directamente a campos (p&#x00fa;blicos, privados y protegidos). La elecci&#x00f3;n est&#x00e1; en ti, y puedes ajustarla a tu dise&#x00f1;o de aplicaci&#x00f3;n.

source: The <literal>id</literal> property holds a unique identifier value for a particular event. All persistent entity classes (there are less important dependent classes as well) will need such an identifier property if we want to use the full feature set of Hibernate. In fact, most applications (esp. web applications) need to distinguish objects by identifier, so you should consider this a feature rather than a limitation. However, we usually don't manipulate the identity of an object, hence the setter method should be private. Only Hibernate will assign identifiers when an object is saved. You can see that Hibernate can access public, private, and protected accessor methods, as well as (public, private, protected) fields directly. The choice is up to you and you can match it to fit your application design.
es_es: El constructor sin argumentos es un requerimiento para todas las clases persistentes. Hibernate tiene que crear objetos para ti, usando reflecci&#x00f3;n Java. El constructor puede ser privado, sin embargo, la visibilidad de paquete es requerida para la generaci&#x00f3;n de proxies en tiempo de ejecuci&#x00f3;n y la recuperaci&#x00f3;n de datos sin instrumentaci&#x00f3;n del bytecode.

source: The no-argument constructor is a requirement for all persistent classes; Hibernate has to create objects for you, using Java Reflection. The constructor can be private, however, package visibility is required for runtime proxy generation and efficient data retrieval without bytecode instrumentation.
es_es: Coloca este fichero de c&#x00f3;digo Java en un directorio llamado <literal>src</literal> en la carpeta de desarrollo. El directorio ahora debe verse como esto:

source: Place this Java source file in a directory called <literal>src</literal> in the development folder, and in its correct package. The directory should now look like this:
es_es: <![CDATA[. +lib <Hibernate and third-party libraries> +src Event.java]]>

source: <![CDATA[. +lib <Hibernate and third-party libraries> +src +events Event.java]]>
es_es: En el pr&#x00f3;ximo paso, le decimos a Hibernate sobre esta clase persistente.

source: In the next step, we tell Hibernate about this persistent class.
es_es: El fichero de mapeo

source: The mapping file
es_es: Hibernate necesita saber c&#x00f3;mo cargar y almacenar objetos de la clase persistente. Aqu&#x00ed; es donde el fichero de mapeo de Hibernate entra en juego. El fichero de mapeo le dice a Hibernate a qu&#x00e9; tabla en la base de datos tiene que acceder, y qu&#x00e9; columnas en esta tabla debe usar.

source: Hibernate needs to know how to load and store objects of the persistent class. This is where the Hibernate mapping file comes into play. The mapping file tells Hibernate what table in the database it has to access, and what columns in that table it should use.
es_es: La estructura b&#x00e1;sica de un fichero de mapeo se parece a esto:

source: The basic structure of a mapping file looks like this:
es_es: <![CDATA[<?xml version="1.0"?> <!DOCTYPE hibernate-mapping PUBLIC "-//Hibernate/Hibernate Mapping DTD 3.0//EN" "http://hibernate.sourceforge.net/hibernate-mapping-3.0.dtd"> <hibernate-mapping> [...] </hibernate-mapping>]]>

source: <![CDATA[<?xml version="1.0"?> <!DOCTYPE hibernate-mapping PUBLIC "-//Hibernate/Hibernate Mapping DTD 3.0//EN" "http://hibernate.sourceforge.net/hibernate-mapping-3.0.dtd"> <hibernate-mapping> [...] </hibernate-mapping>]]>
es_es: Observa que el DTD de Hibernate es muy sofisticado. Puedes usarlo para autocompleci&#x00f3;n de los elementos y atributos XML de mapeo en tu editor o IDE. Debes tambi&#x00e9;n abrir el fichero DTD en tu editor de texto. Es la forma m&#x00e1;s f&#x00e1;cil para tener un panorama de todos los elementos y atributos y ver los valores por defectos, as&#x00ed; como algunos comentarios. Nota que Hibernate no cargar&#x00e1; el fichero DTD de la web, sino que primero buscar&#x00e1; en el classpath de la aplicaci&#x00f3;n. El fichero DTD est&#x00e1; inclu&#x00ed;do en <literal>hibernate3.jar</literal> as&#x00ed; como tambi&#x00e9;n en el directorio <literal>src/</literal> de la distribuci&#x00f3;n de Hibernate.

source: Note that the Hibernate DTD is very sophisticated. You can use it for auto-completion of XML mapping elements and attributes in your editor or IDE. You also should open up the DTD file in your text editor - it's the easiest way to get an overview of all elements and attributes and to see the defaults, as well as some comments. Note that Hibernate will not load the DTD file from the web, but first look it up from the classpath of the application. The DTD file is included in <literal>hibernate3.jar</literal> as well as in the <literal>src/</literal> directory of the Hibernate distribution.
es_es: Omitiremos la declaraci&#x00f3;n de DTD en futuros ejemplos para acortar el c&#x00f3;digo. Por supuesto, no es opcional.

source: We will omit the DTD declaration in future examples to shorten the code. It is of course not optional.
es_es: Entre las dos etiquetas <literal>hibernate-mapping</literal>, incluye un elemento <literal>class</literal>. Todas las clases de entidad persistentes (de nuevo, podr&#x00ed;a haber m&#x00e1;s adelante clases dependientes, que no sean entidades de-primera-clase) necesitan dicho mapeo a una tabla en la base de datos SQL:

source: Between the two <literal>hibernate-mapping</literal> tags, include a <literal>class</literal> element. All persistent entity classes (again, there might be dependent classes later on, which are not first-class entities) need such a mapping, to a table in the SQL database:
es_es: <![CDATA[<hibernate-mapping> <class name="Event" table="EVENTS"> </class> </hibernate-mapping>]]>

source: <![CDATA[<hibernate-mapping> <class name="events.Event" table="EVENTS"> </class> </hibernate-mapping>]]>
es_es: Hasta ahora dijimos a Hibernate c&#x00f3;mo persistir y cargar el objeto de clase <literal>Event</literal> a la tabla <literal>EVENTS</literal>, cada instancia representada por una fila en esta tabla. Ahora continuamos con un mapeo de la propiedad de identificado &#x00fa;nico a la clave primaria de la tabla. Adem&#x00e1;s, como no queremos cuidar del manejo de este identificador, configuramos la estrategia de generaci&#x00f3;n de identificadores para una columna clave primaria delegada:

source: So far we told Hibernate how to persist and load object of class <literal>Event</literal> to the table <literal>EVENTS</literal>, each instance represented by a row in that table. Now we continue with a mapping of the unique identifier property to the tables primary key. In addition, as we don't want to care about handling this identifier, we configure Hibernate's identifier generation strategy for a surrogate primary key column:
es_es: <![CDATA[<hibernate-mapping> <class name="Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="increment"/> </id> </class> </hibernate-mapping>]]>

source: <![CDATA[<hibernate-mapping> <class name="events.Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="native"/> </id> </class> </hibernate-mapping>]]>
es_es: El elemento <literal>id</literal> el la declaraci&#x00f3;n de la propiedad identificadora, <literal>name="id"</literal> declara el nombre de la propiedad Java. Hibernate usar&#x00e1; los m&#x00e9;todos getter y setter para acceder a la propiedad. El attributo de columna dice a Hibernate cu&#x00e1;l columna de la tabla <literal>EVENTS</literal> usamos para esta clave primaria. El elemento anidado <literal>generator</literal> especifica la estrategia de generaci&#x00f3;n de identificadores, en este caso usamos <literal>increment</literal>, que es un m&#x00e9;todo muy simple de incremento de n&#x00fa;mero en-memoria &#x00fa;til mayormente para testeo (y tutoriales). Hibernate tambi&#x0e9;n soporta identificadores generados por base de datos, globalmente &#x00fa;nicos, as&#x00ed; como tambi&#x00e9;n asignados por aplicaci&#x00f3;n (o cualquier estrategia para la que hayas escrito una extensi&#x00f3;n).

source: The <literal>id</literal> element is the declaration of the identifer property, <literal>name="id"</literal> declares the name of the Java property - Hibernate will use the getter and setter methods to access the property. The column attribute tells Hibernate which column of the <literal>EVENTS</literal> table we use for this primary key. The nested <literal>generator</literal> element specifies the identifier generation strategy, in this case we used <literal>native</literal>, which picks the best strategy depending on the configured database (dialect). Hibernate supports database generated, globally unique, as well as application assigned identifiers (or any strategy you have written an extension for).
es_es: Finalmente inclu&#x00ed;mos declaraciones para las propiedades persistentes de la clases en el fichero de mapeo. Por defecto, ninguna propiedad de la clase se considera persistente:

source: Finally we include declarations for the persistent properties of the class in the mapping file. By default, no properties of the class are considered persistent:
es_es: <![CDATA[ <hibernate-mapping> <class name="Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="increment"/> </id> <property name="date" type="timestamp" column="EVENT_DATE"/> <property name="title"/> </class> </hibernate-mapping>]]>

source: <![CDATA[ <hibernate-mapping> <class name="events.Event" table="EVENTS"> <id name="id" column="EVENT_ID"> <generator class="native"/> </id> <property name="date" type="timestamp" column="EVENT_DATE"/> <property name="title"/> </class> </hibernate-mapping>]]>
es_es: Al igual que con el elemento <literal>id</literal>, el atributo <literal>name</literal> del elemento <literal>property</literal> dice a Hibernate c&#x00e1;les m&#x00e9;todos getter y setter usar.

source: Just as with the <literal>id</literal> element, the <literal>name</literal> attribute of the <literal>property</literal> element tells Hibernate which getter and setter methods to use. So, in this case, Hibernate will look for <literal>getDate()/setDate()</literal>, as well as <literal>getTitle()/setTitle()</literal>.
es_es: ٯPor qu&#x00e9; el mapeo de la propiedad <literal>date</literal> incluye el atributo <literal>column</literal>, pero el de la de <literal>title</literal> no? Sin el atributo <literal>column</literal> Hibernate usa por defecto el nombre de propiedad como nombre de columna. Esto funciona bien para <literal>title</literal>. Sin embargo, However, <literal>date</literal> es una palabra reservada en la mayor&#x00ed;a de las bases de datos, as&#x00ed; que mejor la mapeamos a un nombre diferente.

source: Why does the <literal>date</literal> property mapping include the <literal>column</literal> attribute, but the <literal>title</literal> doesn't? Without the <literal>column</literal> attribute Hibernate by default uses the property name as the column name. This works fine for <literal>title</literal>. However, <literal>date</literal> is a reserved keyword in most database, so we better map it to a different name.
es_es: La pr&#x00f3;xima cosa interesante es que el mapeo de <literal>title</literal> carece de un atributo <literal>type</literal>. Los tipos que declaramos y usamos en el fichero de mapeo no son, como podr&#x00ed;as esperar, tipos de datos Java. Tampoco son tipos de base de datos SQL. Estos tipos son los llamados as&#x00ed; <emphasis>Tipos de mapeo de Hibernate</emphasis>, convertidores que pueden traducir de tipos Java a SQL y vice versa. De nuevo, Hibernate intentar&#x00e1; determinar la conversi&#x00f3;n y el mapeo mismo de tipo correctos si el atributo <literal>type</literal> no estuviese presente en el mapeo. En algunos casos esta detecci&#x00f3;n autom&#x00e1;tica (usando reflecci&#x00f3;n en la clase Java) puede no tener lo que esperas o necesitas. Este es el caso de la propiedad <literal>date</literal>. Hibernate no puede saber is la propiedad mapear&#x00e1; a una columna <literal>date</literal>, <literal>timestamp</literal> o <literal>time</literal>. Declaramos que queremos preservar la informaci&#x00f3;n completa de fecha y hora mapeando la propiedad con un <literal>timestamp</literal>.

source: The next interesting thing is that the <literal>title</literal> mapping also lacks a <literal>type</literal> attribute. The types we declare and use in the mapping files are not, as you might expect, Java data types. They are also not SQL database types. These types are so called <emphasis>Hibernate mapping types</emphasis>, converters which can translate from Java to SQL data types and vice versa. Again, Hibernate will try to determine the correct conversion and mapping type itself if the <literal>type</literal> attribute is not present in the mapping. In some cases this automatic detection (using Reflection on the Java class) might not have the default you expect or need. This is the case with the <literal>date</literal> property. Hibernate can't know if the property (which is of <literal>java.util.Date</literal>) should map to a SQL <literal>date</literal>, <literal>timestamp</literal>, or <literal>time</literal> column. We preserve full date and time information by mapping the property with a <literal>timestamp</literal> converter.
es_es: Este fichero de mapeo debe ser salvado como <literal>Event.hbm.xml</literal>, justo en el directorio pr&#x00f3;ximo al fichero de c&#x00f3;digo fuente de la clase Java <literal>Event</literal>. El nombrado de los ficheros de mapeo puede ser arbitrario, sin embargo, el sufijo <literal>hbm.xml</literal> se ha vuelto una convenci&#x00f3;n el la comunidad de desarrolladores de Hibernate. La estructura de directorio debe ahora verse como esto:

source: This mapping file should be saved as <literal>Event.hbm.xml</literal>, right in the directory next to the <literal>Event</literal> Java class source file. The naming of mapping files can be arbitrary, however the <literal>hbm.xml</literal> suffix is a convention in the Hibernate developer community. The directory structure should now look like this:
es_es: <![CDATA[. +lib <Hibernate and third-party libraries> +src Event.java Event.hbm.xml]]>

source: <![CDATA[. +lib <Hibernate and third-party libraries> +src +events Event.java Event.hbm.xml]]>
es_es: Continuamos con la configuraci&#x00f3;n principal de Hibernate.

source: We continue with the main configuration of Hibernate.
es_es: Configuraci&#x00f3;n de Hibernate

source: Hibernate configuration
es_es: Tenemos ahora una clase persistente y su fichero de mapeo en su sitio. Es momento de configurar Hibernate. Antes que hagamos esto, necesitaremos una base de datos. HSQL DB, un DBMS SQL en-memoria basado en Java, puede ser descargado del sitio web de HSQL DB. Realmente, de esta descarga s&#x00f3;lo necesitas el <literal>hsqldb.jar</literal>. Coloca este fichero en el directorio <literal>lib/</literal> de la carpeta de desarrollo.

source: We now have a persistent class and its mapping file in place. It is time to configure Hibernate. Before we do this, we will need a database. HSQL DB, a java-based SQL DBMS, can be downloaded from the HSQL DB website(http://hsqldb.org/). Actually, you only need the <literal>hsqldb.jar</literal> from this download. Place this file in the <literal>lib/</literal> directory of the development folder.
es_es: Crea un directorio llamado <literal>data</literal> en la ra&#x00ed;z del directorio de desarrollo. All&#x00ed; es donde HSQL DB almacenar&#x00e1; sus ficheros de datos.
