Repository: hibernate/hibernate-orm
Catalog: documentation/manual/translations/*/content/tutorial.po
Languages: es_es

source: <![CDATA[private void addPersonToEvent(Long personId, Long eventId) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session .createQuery("select p from Person p left join fetch p.events where p.id = :pid") .setParameter("pid", personId) .uniqueResult(); // Eager fetch the collection so we can use it detached Event anEvent = (Event) session.load(Event.class, eventId); session.getTransaction().commit(); // End of first unit of work aPerson.getEvents().add(anEvent); // aPerson (and its collection) is detached // Begin second unit of work Session session2 = HibernateUtil.getSessionFactory().getCurrentSession(); session2.beginTransaction(); session2.update(aPerson); // Reattachment of aPerson session2.getTransaction().commit(); }]]>
es_es: Tambi&#x00e9;n puedes dise&#x00f1;ar una colecci&#x00f3;n de tipos de valor. Esto es conceptualmente muy diferente de una colecci&#x00f3;n de referencias a otras entidades, pero se ve casi lo mismo en Java.

source: The call to <literal>update</literal> makes a detached object persistent again, you could say it binds it to a new unit of work, so any modifications you made to it while detached can be saved to the database. This includes any modifications (additions/deletions) you made to a collection of that entity object.
es_es: Colecci&#x00f3;n de valores

source: Well, this is not much use in our current situation, but it's an important concept you can design into your own application. For now, complete this exercise by adding a new action to the <literal>EventManager</literal>'s main method and call it from the command line. If you need the identifiers of a person and an event - the <literal>save()</literal> method returns it (you might have to modify some of the previous methods to return that identifier):
es_es: Agregamos una colecci&#x00f3;n de objetos tipificados en valor a la entidad <literal>Person</literal>. Queremos almacenar direcciones de email, de modo que el tipo que usamos es <literal>String</literal>, y la colecci&#x00f3;n es nuevamente un <literal>Set</literal>:

source: <![CDATA[else if (args[0].equals("addpersontoevent")) { Long eventId = mgr.createAndStoreEvent("My Event", new Date()); Long personId = mgr.createAndStorePerson("Foo", "Bar"); mgr.addPersonToEvent(personId, eventId); System.out.println("Added person " + personId + " to event " + eventId); }]]>
es_es: <![CDATA[private Set emailAddresses = new HashSet(); public Set getEmailAddresses() { return emailAddresses; } public void setEmailAddresses(Set emailAddresses) { this.emailAddresses = emailAddresses; }]]>

source: This was an example of an association between two equally important classes, two entities. As mentioned earlier, there are other classes and types in a typical model, usually "less important". Some you have already seen, like an <literal>int</literal> or a <literal>String</literal>. We call these classes <emphasis>value types</emphasis>, and their instances <emphasis>depend</emphasis> on a particular entity. Instances of these types don't have their own identity, nor are they shared between entities (two persons don't reference the same <literal>firstname</literal> object, even if they have the same first name). Of course, value types can not only be found in the JDK (in fact, in a Hibernate application all JDK classes are considered value types), but you can also write dependent classes yourself, <literal>Address</literal> or <literal>MonetaryAmount</literal>, for example.
es_es: El mapeo de este <literal>Set</literal>:

source: You can also design a collection of value types. This is conceptually very different from a collection of references to other entities, but looks almost the same in Java.
es_es: <![CDATA[<set name="emailAddresses" table="PERSON_EMAIL_ADDR"> <key column="PERSON_ID"/> <element type="string" column="EMAIL_ADDR"/> </set>]]>

source: Collection of values
es_es: La diferencia comparada con el mapeo anterior es la parte <literal>element</literal>, que le dice a Hibernate que la colecci&#x00f3;n no contiene referencias a otra entidad, sino una colecci&#x00f3;n de elementos de tipo <literal>String</literal> (el nombre en min&#x00fa;sculas te dice que es un tipo/conversor de mapeo de Hibernate). Una vez m&#x00e1;s, el atributo <literal>table</literal> del elemento <literal>set</literal> determina el nombre de la tabla para la colecci&#x00f3;n. El elemento <literal>key</literal> define el nombre de la columna clave for&#x00e1;nea en la tabla de colecci&#x00f3;n. El atributo <literal>column</literal> en el elemento <literal>element</literal> define el nombre de columna donde realmente ser&#x00e1;n almacenados los valores <literal>String</literal>.

source: We add a collection of value typed objects to the <literal>Person</literal> entity. We want to store email addresses, so the type we use is <literal>String</literal>, and the collection is again a <literal>Set</literal>:
es_es: Echa una mirada al esquema actualizado:

source: <![CDATA[private Set emailAddresses = new HashSet(); public Set getEmailAddresses() { return emailAddresses; } public void setEmailAddresses(Set emailAddresses) { this.emailAddresses = emailAddresses; }]]>
es_es: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | ___________________ |_____________| |__________________| | PERSON | | | | | | | |_____________| | PERSON_EMAIL_ADDR | | *EVENT_ID | <--> | *EVENT_ID | | | |___________________| | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | | *EMAIL_ADDR | |_____________| | FIRSTNAME | |___________________| | LASTNAME | |_____________| ]]>

source: The mapping of this <literal>Set</literal>:
es_es: Puedes ver que la clave primaria de la tabla de colecci&#x00f3;n es de hecho una clave compuesta, usando ambas columnas. Esto implica tambi&#x00e9;n que no pueden haber direcciones de email duplicadas por persona, que es exactamente la sem&#x00e1;ntica que necesitamos para un conjunto en Java.

source: <![CDATA[<set name="emailAddresses" table="PERSON_EMAIL_ADDR"> <key column="PERSON_ID"/> <element type="string" column="EMAIL_ADDR"/> </set>]]>
es_es: Puedes ahora intentar y agregar elementos a esta colecci&#x00f3;n, al igual que hicimos antes enlazando personas y eventos. Es el mismo c&#x00f3;digo en Java.

source: The difference compared with the earlier mapping is the <literal>element</literal> part, which tells Hibernate that the collection does not contain references to another entity, but a collection of elements of type <literal>String</literal> (the lowercase name tells you it's a Hibernate mapping type/converter). Once again, the <literal>table</literal> attribute of the <literal>set</literal> element determines the table name for the collection. The <literal>key</literal> element defines the foreign-key column name in the collection table. The <literal>column</literal> attribute in the <literal>element</literal> element defines the column name where the <literal>String</literal> values will actually be stored.
es_es: Asociaciones bidireccionales

source: Have a look at the updated schema:
es_es: A continuacion vamos a mapear una asociaci&#x00f3;n bidireccional, haciendo que la asociaci&#x00f3;n entre persona y evento funcione desde ambos lados en Java. Por supuesto, el esquema de base de datos no cambia; todav&#x00ed;a necesitamos multiplicidad muchos-a-muchos. Una base de datos relacional es m&#x00e1;s flexible que un lenguaje de programaci&#x00f3;n de red, as&#x00ed; que no necesita nada parecido a una direcci&#x00f3;n de navegaci&#x00f3;n; los datos pueden ser vistos y recuperados en cualquier forma posible.

source: <![CDATA[ _____________ __________________ | | | | _____________ | EVENTS | | PERSON_EVENT | | | ___________________ |_____________| |__________________| | PERSON | | | | | | | |_____________| | PERSON_EMAIL_ADDR | | *EVENT_ID | <--> | *EVENT_ID | | | |___________________| | EVENT_DATE | | *PERSON_ID | <--> | *PERSON_ID | <--> | *PERSON_ID | | TITLE | |__________________| | AGE | | *EMAIL_ADDR | |_____________| | FIRSTNAME | |___________________| | LASTNAME | |_____________| ]]>
es_es: Primero agrega una colecci&#x00f3;n de participantes a la clase de eventos <literal>Event</literal>:

source: You can see that the primary key of the collection table is in fact a composite key, using both columns. This also implies that there can't be duplicate email addresses per person, which is exactly the semantics we need for a set in Java.
es_es: <![CDATA[private Set participants = new HashSet(); public Set getParticipants() { return participants; } public void setParticipants(Set participants) { this.participants = participants; }]]>

source: You can now try and add elements to this collection, just like we did before by linking persons and events. It's the same code in Java:
es_es: Ahora mapea este lado de la asociaci&#x00f3;n tambi&#x00e9;n, en <literal>Event.hbm.xml</literal>.

source: <![CDATA[private void addEmailToPerson(Long personId, String emailAddress) { Session session = HibernateUtil.getSessionFactory().getCurrentSession(); session.beginTransaction(); Person aPerson = (Person) session.load(Person.class, personId); // The getEmailAddresses() might trigger a lazy load of the collection aPerson.getEmailAddresses().add(emailAddress); session.getTransaction().commit(); }]]>
es_es: <![CDATA[<set name="participants" table="PERSON_EVENT" inverse="true"> <key column="EVENT_ID"/> <many-to-many column="PERSON_ID" class="Person"/> </set>]]>

source: This time we didnt' use a <emphasis>fetch</emphasis> query to initialize the collection. Hence, the call to its getter method will trigger an additional select to initialize it, so we can add an element to it. Monitor the SQL log and try to optimize this with an eager fetch.
es_es: Como ves, estos son mapeos normales de <literal>set</literal> en ambos documentos de mapeo. Nota que los nombres de columnas en <literal>key</literal> y <literal>many-to-many</literal> fueron permutados en ambos documentos de mapeo. Aqu&#x00ed; la adici&#x00f3;n m&#x00e1;s importante es el atributo <literal>inverse="true"</literal> en el elemento <literal>set</literal> del mapeo de colecci&#x00f3;n de <literal>Event</literal>.

source: Bi-directional associations
es_es: Lo que esto significa es que Hibernate debe tomar el otro lado - la clase <literal>Person</literal> - cuando necesite descubrir informaci&#x00f3;n sobre el enlace entre las dos. Esto ser&#x00e1; mucho m&#x00e1;s f&#x00e1;cil de entender una vez que veas c&#x00f3;mo se crea el enlace bidireccional entre nuestras dos entidades.

source: Next we are going to map a bi-directional association - making the association between person and event work from both sides in Java. Of course, the database schema doesn't change, we still have many-to-many multiplicity. A relational database is more flexible than a network programming language, so it doesn't need anything like a navigation direction - data can be viewed and retrieved in any possible way.
es_es: Trabajando enlaces bidireccionales

source: First, add a collection of participants to the <literal>Event</literal> Event class:
es_es: Primero, ten en mente que Hhibernate no afecta la sem&#x00e1;ntica normal de Java. ٯC&#x00f3;mo hemos creado un enlace entre una <literal>Person</literal> y un <literal>Event</literal> en el ejemplo unidireccional? Hemos agregado una instancia de <literal>Event</literal> a la colecci&#x00f3;n de referencias de eventos de una instancia de <literal>Person</literal>. De modo que, obviamente, si queremos que este enlace funcione bidireccionalmente, tenemos que hacer lo mismo del otro lado, agregando una referencia a <literal>Person</literal> a la colecci&#x00f3;n en un <literal>Event</literal>. Este "establecer el enlace a ambos lados" es absolutamente necesario y nunca debes olvidar hacerlo.

source: <![CDATA[private Set participants = new HashSet(); public Set getParticipants() { return participants; } public void setParticipants(Set participants) { this.participants = participants; }]]>
es_es: Muchos desarrolladores programan a la defensiva y crean m&#x00e9;todos de manejo de un enlace para establecer correctamente ambos lados, por ejemplo en <literal>Person</literal>:

source: Now map this side of the association too, in <literal>Event.hbm.xml</literal>.
es_es: <![CDATA[protected Set getEvents() { return events; } protected void setEvents(Set events) { this.events = events; } public void addToEvent(Event event) { this.getEvents().add(event); event.getParticipants().add(this); } public void removeFromEvent(Event event) { this.getEvents().remove(event); event.getParticipants().remove(this); }]]>

source: <![CDATA[<set name="participants" table="PERSON_EVENT" inverse="true"> <key column="EVENT_ID"/> <many-to-many column="PERSON_ID" class="events.Person"/> </set>]]>
es_es: Nota que los m&#x00e9;todos get y set para esta colecci&#x00f3;n son ahora protegidos. Esto le permite a clases en el mismo paquete y a subclases acceder a&#x00fa;n a los m&#x00e9;todos, pero previene a cualquier otro de ensuciarse con la colecci&#x00f3;n directamente (bueno, casi). Probablemente debas hacer lo mismo con la colecci&#x00f3;n al otro lado.

source: As you see, these are normal <literal>set</literal> mappings in both mapping documents. Notice that the column names in <literal>key</literal> and <literal>many-to-many</literal> are swapped in both mapping documents. The most important addition here is the <literal>inverse="true"</literal> attribute in the <literal>set</literal> element of the <literal>Event</literal>'s collection mapping.
es_es: Y ٯqu&#x00e9; del atributo de mapeo <literal>inverse</literal>? Para ti, y para Java, un enlace bidireccional es simplemente cuesti&#x00f3;n de establecer correctamente las referencias a ambos lados. Hibernate, sin embargo, no tiene suficiente informaci&#x00f3;n para arreglar correctamente sentencias <literal>INSERT</literal> y <literal>UPDATE</literal> de SQL (para evitar violaci&#x00f3;n de restricciones), y necesita alguna ayuda para manejar asociaciones bidireccionales apropiadamente. El hacer un lado de la asociaci&#x00f3;n <literal>inverse</literal> le dice a Hibernate que basicamente lo ignore, que lo considere un <emphasis>espejo</emphasis> del otro lado. Esto es todo lo necesario para que Hibernate resuelva todas las incidencias al transformar un modelo de navegaci&#x00f3;n direccional a un esquema SQL de base de datos. Las reglas que tienes que recordar son directas: Todas las asociaciones bidireccionales necesitan uno de los lados como <literal>inverse</literal>. En una asociaci&#x00f3;n uno-a-muchos debe ser el lado-de-muchos. En una asociaci&#x00f3;n muchos-a-muchos, puedes tomar cualquier lado, no hay diferencia.

source: What this means is that Hibernate should take the other side - the <literal>Person</literal> class - when it needs to find out information about the link between the two. This will be a lot easier to understand once you see how the bi-directional link between our two entities is created .
es_es: Summary

source: Working bi-directional links
es_es: Este tutorial cubri&#x00f3; los fundamentos de escribir una simple aplicaci&#x00f3;n independiente de Hibernate.

source: First, keep in mind that Hibernate does not affect normal Java semantics. How did we create a link between a <literal>Person</literal> and an <literal>Event</literal> in the unidirectional example? We added an instance of <literal>Event</literal> to the collection of event references, of an instance of <literal>Person</literal>. So, obviously, if we want to make this link working bi-directional, we have to do the same on the other side - adding a <literal>Person</literal> reference to the collection in an <literal>Event</literal>. This "setting the link on both sides" is absolutely necessary and you should never forget doing it.
es_es: Si ya te sientes confidente con Hibernate, contin&#x00fa;a navegando a trav&#x00e9;s de la tabla de contenidos de la documentaci&#x00f3;n de referencia para los temas que encuentres interesantes. Los m&#x00e1;s consultados son procesamiento transaccional (<xref linkend="transactions"/>), rendimiento de recuperaci&#x00f3;n (<xref linkend="performance"/>), o el uso de la API (<xref linkend="objectstate"/>) y las funcionalidades de consulta (<xref linkend="objectstate-querying"/>).

source: Many developers program defensive and create link management methods to correctly set both sides, e.g. in <literal>Person</literal>:
es_es: No olvides chequear el sitio web de Hibernate por m&#x00e1;s (especializados) tutoriales.

source: ROLES_OF_TRANSLATORS
es_es: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
es_es: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
